{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ec570e53-4c76-45a9-804d-dc3f355ff7a7')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ec570e53-4c76-45a9-804d-dc3f355ff7a7')]",
      "properties": {
        "alertRuleTemplateName": "ec570e53-4c76-45a9-804d-dc3f355ff7a7",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/27",
        "description": "Detects execution of 7z in order to compress a file with a \".dmp\"/\".dump\" extension, which could be a step in a process of dump file exfiltration.",
        "displayName": "7Zip Compressing Dump Files",
        "enabled": true,
        "entityMappings": null,
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/09/12",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \".dmp\" or ProcessCommandLine contains \".dump\" or ProcessCommandLine contains \".hdmp\") and (ProcessVersionInfoFileDescription contains \"7-Zip\" or (FolderPath endswith \"\\\\7z.exe\" or FolderPath endswith \"\\\\7zr.exe\" or FolderPath endswith \"\\\\7za.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"7z.exe\", \"7za.exe\")))",
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "tactics": [
          "collection"
        ],
        "techniques": [
          "t1560"
        ],
        "templateVersion": "1.0.0"
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
