name: AADInternals PowerShell Cmdlets Execution - ProccessCreation
id: c86500e9-a645-4680-98d7-f882c70c1ea3
author: Austin Songer (@austinsonger), Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/23
severity: high
description: Detects ADDInternals Cmdlet execution. A tool for administering Azure
  AD and Office 365. Which can be abused by threat actors to attack Azure AD or Office
  365.
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- credential_access
- discovery
- execution
- impact
- reconnaissance
relevantTechniques: []
query: 'DeviceProcessEvents

  | where (ProcessCommandLine contains "Add-AADInt" or ProcessCommandLine contains
  "ConvertTo-AADInt" or ProcessCommandLine contains "Disable-AADInt" or ProcessCommandLine
  contains "Enable-AADInt" or ProcessCommandLine contains "Export-AADInt" or ProcessCommandLine
  contains "Get-AADInt" or ProcessCommandLine contains "Grant-AADInt" or ProcessCommandLine
  contains "Install-AADInt" or ProcessCommandLine contains "Invoke-AADInt" or ProcessCommandLine
  contains "Join-AADInt" or ProcessCommandLine contains "New-AADInt" or ProcessCommandLine
  contains "Open-AADInt" or ProcessCommandLine contains "Read-AADInt" or ProcessCommandLine
  contains "Register-AADInt" or ProcessCommandLine contains "Remove-AADInt" or ProcessCommandLine
  contains "Restore-AADInt" or ProcessCommandLine contains "Search-AADInt" or ProcessCommandLine
  contains "Send-AADInt" or ProcessCommandLine contains "Set-AADInt" or ProcessCommandLine
  contains "Start-AADInt" or ProcessCommandLine contains "Update-AADInt") and ((FolderPath
  endswith "\\powershell.exe" or FolderPath endswith "\\pwsh.exe") or (ProcessVersionInfoOriginalFileName
  in~ ("PowerShell.Exe", "pwsh.dll")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
