name: Access To Windows Credential History File By Uncommon Application
id: 7a2a22ea-a203-4cd3-9abf-20eb1c5c6cd2
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/17
severity: medium
description: 'Detects file access requests to the Windows Credential History File
  by an uncommon application.

  This can be a sign of credential stealing. Example case would be usage of mimikatz
  "dpapi::credhist" function

  '
status: experimental
modified: 2023/12/18
logsource:
  category: file_access
  product: windows
tactics:
- Credential Access
relevantTechniques:
- T1555
query: 'DeviceFileEvents

  | where FileName endswith "\\Microsoft\\Protect\\CREDHIST" and (not((InitiatingProcessFolderPath
  endswith ":\\Windows\\explorer.exe" or (InitiatingProcessFolderPath contains ":\\Program
  Files\\" or InitiatingProcessFolderPath contains ":\\Program Files (x86)\\" or InitiatingProcessFolderPath
  contains ":\\Windows\\system32\\" or InitiatingProcessFolderPath contains ":\\Windows\\SysWOW64\\"))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
