name: Access To Windows DPAPI Master Keys By Uncommon Application
id: 46612ae6-86be-4802-bc07-39b59feb1309
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/17
severity: medium
description: 'Detects file access requests to the the Windows Data Protection API
  Master keys by an uncommon application.

  This can be a sign of credential stealing. Example case would be usage of mimikatz
  "dpapi::masterkey" function

  '
status: experimental
modified: 2023/12/18
logsource:
  category: file_access
  product: windows
tactics:
- Credential Access
relevantTechniques:
- T1555
query: 'DeviceFileEvents

  | where (FileName contains "\\Microsoft\\Protect\\S-1-5-18\\" or FileName contains
  "\\Microsoft\\Protect\\S-1-5-21-") and (not((InitiatingProcessFolderPath contains
  ":\\Program Files\\" or InitiatingProcessFolderPath contains ":\\Program Files (x86)\\"
  or InitiatingProcessFolderPath contains ":\\Windows\\system32\\" or InitiatingProcessFolderPath
  contains ":\\Windows\\SysWOW64\\")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
