name: Always Install Elevated Windows Installer
id: cd951fdc-4b2f-47f5-ba99-a33bf61e3770
author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
date: 2020/10/13
severity: medium
description: Detects Windows Installer service (msiexec.exe) trying to install MSI
  packages with SYSTEM privilege
status: test
modified: 2023/03/23
logsource:
  category: process_creation
  product: windows
tactics:
- privilege_escalation
relevantTechniques:
- t1548.002
query: 'DeviceProcessEvents

  | where (((FolderPath contains "\\Windows\\Installer\\" and FolderPath contains
  "msi") and FolderPath endswith "tmp") or (FolderPath endswith "\\msiexec.exe" and
  ProcessIntegrityLevel =~ "System")) and (AccountName contains "AUTHORI" or AccountName
  contains "AUTORI") and (not(((InitiatingProcessFolderPath startswith "C:\\Program
  Files\\Avast Software\\" or InitiatingProcessFolderPath startswith "C:\\Program
  Files (x86)\\Avast Software\\") or InitiatingProcessFolderPath startswith "C:\\ProgramData\\Avira\\"
  or (InitiatingProcessFolderPath startswith "C:\\Program Files\\Google\\Update\\"
  or InitiatingProcessFolderPath startswith "C:\\Program Files (x86)\\Google\\Update\\")
  or InitiatingProcessFolderPath =~ "C:\\Windows\\System32\\services.exe" or (ProcessCommandLine
  endswith "\\system32\\msiexec.exe /V" or InitiatingProcessCommandLine endswith "\\system32\\msiexec.exe
  /V") or InitiatingProcessFolderPath startswith "C:\\ProgramData\\Sophos\\")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
