name: Aruba Network Service Potential DLL Sideloading
id: 90ae0469-0cee-4509-b67f-e5efcef040f7
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/22
severity: high
description: Detects potential DLL sideloading activity via the Aruba Networks Virtual
  Intranet Access "arubanetsvc.exe" process using DLL Search Order Hijacking
status: test
modified: 2023/03/15
logsource:
  category: image_load
  product: windows
tactics:
- persistence
- privilege_escalation
relevantTechniques:
- t1574.001
- t1574.002
query: 'DeviceImageLoadEvents

  | where ((FolderPath endswith "\\wtsapi32.dll" or FolderPath endswith "\\msvcr100.dll"
  or FolderPath endswith "\\msvcp100.dll" or FolderPath endswith "\\dbghelp.dll" or
  FolderPath endswith "\\dbgcore.dll" or FolderPath endswith "\\wininet.dll" or FolderPath
  endswith "\\iphlpapi.dll" or FolderPath endswith "\\version.dll" or FolderPath endswith
  "\\cryptsp.dll" or FolderPath endswith "\\cryptbase.dll" or FolderPath endswith
  "\\wldp.dll" or FolderPath endswith "\\profapi.dll" or FolderPath endswith "\\sspicli.dll"
  or FolderPath endswith "\\winsta.dll" or FolderPath endswith "\\dpapi.dll") and
  InitiatingProcessFolderPath endswith "\\arubanetsvc.exe") and (not((FolderPath startswith
  "C:\\Windows\\System32\\" or FolderPath startswith "C:\\Windows\\SysWOW64\\" or
  FolderPath startswith "C:\\Windows\\WinSxS\\")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
