name: Bad Opsec Defaults Sacrificial Processes With Improper Arguments
id: a7c3d773-caef-227e-a7e7-c2f13c622329
author: Oleg Kolesnikov @securonix invrep_de, oscd.community, Florian Roth (Nextron
  Systems), Christian Burkard (Nextron Systems)
date: 2020/10/23
level: high
description: 'Detects attackers using tooling with bad opsec defaults.

  E.g. spawning a sacrificial process to inject a capability into the process without
  taking into account how the process is normally run.

  One trivial example of this is using rundll32.exe without arguments as a sacrificial
  process (default in CS, now highlighted by c2lint), running WerFault without arguments
  (Kraken - credit am0nsec), and other examples.

  '
status: experimental
modified: 2023/12/02
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1218.011
query: 'DeviceProcessEvents

  | where ((ProcessCommandLine endswith "regasm.exe" and FolderPath endswith "\\regasm.exe")
  or (ProcessCommandLine endswith "regsvcs.exe" and FolderPath endswith "\\regsvcs.exe")
  or (ProcessCommandLine endswith "regsvr32.exe" and FolderPath endswith "\\regsvr32.exe")
  or (ProcessCommandLine endswith "rundll32.exe" and FolderPath endswith "\\rundll32.exe")
  or (ProcessCommandLine endswith "WerFault.exe" and FolderPath endswith "\\WerFault.exe"))
  and (not((InitiatingProcessFolderPath contains ":\\Users\\" and InitiatingProcessFolderPath
  contains "\\AppData\\Local\\Microsoft\\EdgeUpdate\\Install\\{"))) and (not((ProcessCommandLine
  endswith "rundll32.exe" and FolderPath endswith "\\rundll32.exe" and InitiatingProcessCommandLine
  contains "--uninstall --channel=stable" and (InitiatingProcessFolderPath contains
  ":\\Users\\" and InitiatingProcessFolderPath contains "\\AppData\\Local\\Google\\Chrome\\Application\\")
  and InitiatingProcessFolderPath endswith "\\Installer\\setup.exe")))'
