name: Change the Fax Dll
id: 9e3357ba-09d4-4fbd-a7c5-ad6386314513
author: frack113
date: 2022/07/17
severity: high
description: Detect possible persistence using Fax DLL load when service restart
status: test
modified: 2022/12/30
logsource:
  category: registry_set
  product: windows
tactics:
- Defense Evasion
relevantTechniques:
- T1112
query: 'DeviceRegistryEvents

  | where (RegistryKey contains "\\Software\\Microsoft\\Fax\\Device Providers" and
  RegistryKey contains "\\ImageName") and (not(RegistryValueData =~ "%systemroot%\\system32\\fxst30.dll"))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
