{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fa3c117a-bc0d-416e-a31b-0c0e80653efb')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fa3c117a-bc0d-416e-a31b-0c0e80653efb')]",
      "properties": {
        "alertRuleTemplateName": "fa3c117a-bc0d-416e-a31b-0c0e80653efb",
        "author": "Florian Roth (Nextron Systems), MSTI (query)",
        "customDetails": null,
        "date": "2022/10/01",
        "description": "Detects patterns found in process executions cause by China Chopper like tiny (ASPX) webshells",
        "displayName": "Chopper Webshell Process Pattern",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"&ipconfig&echo\" or ProcessCommandLine contains \"&quser&echo\" or ProcessCommandLine contains \"&whoami&echo\" or ProcessCommandLine contains \"&c:&echo\" or ProcessCommandLine contains \"&cd&echo\" or ProcessCommandLine contains \"&dir&echo\" or ProcessCommandLine contains \"&echo [E]\" or ProcessCommandLine contains \"&echo [S]\") and (FolderPath endswith \"\\\\w3wp.exe\" or InitiatingProcessFolderPath endswith \"\\\\w3wp.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1018",
          "t1033",
          "t1087",
          "t1505"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
