name: COM Hijacking via TreatAs
id: dc5c24af-6995-49b2-86eb-a9ff62199e82
author: frack113
date: 2022/08/28
severity: medium
description: Detect modification of TreatAs key to enable "rundll32.exe -sta" command
status: experimental
modified: 2023/08/17
logsource:
  category: registry_set
  product: windows
tactics:
- Persistence
relevantTechniques:
- T1546
query: 'DeviceRegistryEvents

  | where RegistryKey endswith "TreatAs\\(Default)" and (not(((InitiatingProcessFolderPath
  in~ ("C:\\Windows\\system32\\msiexec.exe", "C:\\Windows\\SysWOW64\\msiexec.exe"))
  or (InitiatingProcessFolderPath endswith "\\OfficeClickToRun.exe" and InitiatingProcessFolderPath
  startswith "C:\\Program Files\\Common Files\\Microsoft Shared\\ClickToRun\\") or
  InitiatingProcessFolderPath =~ "C:\\Program Files (x86)\\Microsoft Office\\root\\integration\\integrator.exe"
  or InitiatingProcessFolderPath =~ "C:\\Windows\\system32\\svchost.exe")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
