name: Console CodePage Lookup Via CHCP
id: 7090adee-82e2-4269-bd59-80691e7c6338
author: _pete_0, TheDFIRReport
date: 2022/02/21
level: medium
description: Detects use of chcp to look up the system locale value as part of host
  discovery
status: experimental
modified: 2024/03/05
logsource:
  category: process_creation
  product: windows
tactics:
- discovery
relevantTechniques:
- t1614.001
query: 'DeviceProcessEvents

  | where (ProcessCommandLine endswith "chcp" or ProcessCommandLine endswith "chcp
  " or ProcessCommandLine endswith "chcp  ") and FolderPath endswith "\\chcp.com"
  and (InitiatingProcessCommandLine contains " -c " or InitiatingProcessCommandLine
  contains " /c " or InitiatingProcessCommandLine contains " -r " or InitiatingProcessCommandLine
  contains " /r " or InitiatingProcessCommandLine contains " -k " or InitiatingProcessCommandLine
  contains " /k ") and InitiatingProcessFolderPath endswith "\\cmd.exe"'
