name: Copying Sensitive Files with Credential Data
id: e7be6119-fc37-43f0-ad4f-1f3f99be2f9f
author: Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
date: 2019/10/22
severity: high
description: Files with well-known filenames (sensitive files with credential data)
  copying
status: test
modified: 2024/06/04
logsource:
  category: process_creation
  product: windows
tactics:
- Credential Access
- S0404
relevantTechniques:
- T1003
query: 'DeviceProcessEvents

  | where ((ProcessCommandLine contains "vss" or ProcessCommandLine contains " -m
  " or ProcessCommandLine contains " /m " or ProcessCommandLine contains " -y " or
  ProcessCommandLine contains " /y ") and (FolderPath endswith "\\esentutl.exe" or
  ProcessVersionInfoOriginalFileName =~ "\\esentutl.exe")) or (ProcessCommandLine
  contains "\\config\\RegBack\\sam" or ProcessCommandLine contains "\\config\\RegBack\\security"
  or ProcessCommandLine contains "\\config\\RegBack\\system" or ProcessCommandLine
  contains "\\config\\sam" or ProcessCommandLine contains "\\config\\security" or
  ProcessCommandLine contains "\\config\\system " or ProcessCommandLine contains "\\repair\\sam"
  or ProcessCommandLine contains "\\repair\\security" or ProcessCommandLine contains
  "\\repair\\system" or ProcessCommandLine contains "\\windows\\ntds\\ntds.dit")'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
