name: CredUI.DLL Loaded By Uncommon Process
id: 9ae01559-cf7e-4f8e-8e14-4c290a1b4784
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/10/20
severity: medium
description: Detects loading of "credui.dll" and related DLLs by an uncommon process.
  Attackers might leverage this DLL for potential use of "CredUIPromptForCredentials"
  or "CredUnPackAuthenticationBufferW".
status: test
modified: 2023/07/28
logsource:
  category: image_load
  product: windows
tactics:
- collection
- credential_access
relevantTechniques:
- t1056.002
query: 'DeviceImageLoadEvents

  | where ((FolderPath endswith "\\credui.dll" or FolderPath endswith "\\wincredui.dll")
  or (InitiatingProcessVersionInfoOriginalFileName in~ ("credui.dll", "wincredui.dll")))
  and (not(((InitiatingProcessFolderPath in~ ("C:\\Windows\\explorer.exe", "C:\\Windows\\ImmersiveControlPanel\\SystemSettings.exe",
  "C:\\Windows\\regedit.exe")) or (InitiatingProcessFolderPath startswith "C:\\Program
  Files (x86)\\" or InitiatingProcessFolderPath startswith "C:\\Program Files\\" or
  InitiatingProcessFolderPath startswith "C:\\Windows\\System32\\" or InitiatingProcessFolderPath
  startswith "C:\\Windows\\SysWOW64\\")))) and (not(((InitiatingProcessFolderPath
  contains "\\AppData\\Local\\Microsoft\\OneDrive\\" and InitiatingProcessFolderPath
  startswith "C:\\Users\\") or InitiatingProcessFolderPath endswith "\\opera_autoupdate.exe"
  or (InitiatingProcessFolderPath endswith "\\procexp64.exe" or InitiatingProcessFolderPath
  endswith "\\procexp.exe") or (InitiatingProcessFolderPath contains "\\AppData\\Local\\Microsoft\\Teams\\"
  and InitiatingProcessFolderPath endswith "\\Teams.exe" and InitiatingProcessFolderPath
  startswith "C:\\Users\\"))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
