name: Disable Windows IIS HTTP Logging
id: e4ed6030-ffe5-4e6a-8a8a-ab3c1ab9d94e
author: frack113
date: 2022/01/09
level: high
description: Disables HTTP logging on a Windows IIS web server as seen by Threat Group
  3390 (Bronze Union)
status: test
modified: 2023/01/22
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1562.002
query: 'DeviceProcessEvents

  | where (ProcessCommandLine contains "set" and ProcessCommandLine contains "config"
  and ProcessCommandLine contains "section:httplogging" and ProcessCommandLine contains
  "dontLog:true") and (FolderPath endswith "\\appcmd.exe" or ProcessVersionInfoOriginalFileName
  =~ "appcmd.exe")'
