name: Disable Windows Defender AV Security Monitoring
id: a7ee1722-c3c5-aeff-3212-c777e4733217
author: ok @securonix invrep-de, oscd.community, frack113
date: 2020/10/12
severity: high
description: Detects attackers attempting to disable Windows Defender using Powershell
status: test
modified: 2022/11/18
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1562.001
query: 'DeviceProcessEvents

  | where (((FolderPath endswith "\\powershell.exe" or FolderPath endswith "\\pwsh.exe")
  or (ProcessVersionInfoOriginalFileName in~ ("PowerShell.EXE", "pwsh.dll"))) and
  (ProcessCommandLine contains "-DisableBehaviorMonitoring $true" or ProcessCommandLine
  contains "-DisableRuntimeMonitoring $true")) or ((FolderPath endswith "\\sc.exe"
  or ProcessVersionInfoOriginalFileName =~ "sc.exe") and ((ProcessCommandLine contains
  "delete" and ProcessCommandLine contains "WinDefend") or (ProcessCommandLine contains
  "config" and ProcessCommandLine contains "WinDefend" and ProcessCommandLine contains
  "start=disabled") or (ProcessCommandLine contains "stop" and ProcessCommandLine
  contains "WinDefend")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
