name: DLL Sideloading by VMware Xfer Utility
id: ebea773c-a8f1-42ad-a856-00cb221966e8
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/02
severity: high
description: Detects execution of VMware Xfer utility (VMwareXferlogs.exe) from the
  non-default directory which may be an attempt to sideload arbitrary DLL
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1574.002
query: 'DeviceProcessEvents

  | where FolderPath endswith "\\VMwareXferlogs.exe" and (not(FolderPath startswith
  "C:\\Program Files\\VMware\\"))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
