{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fd877b94-9bb5-4191-bb25-d79cbd93c167')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fd877b94-9bb5-4191-bb25-d79cbd93c167')]",
      "properties": {
        "alertRuleTemplateName": "fd877b94-9bb5-4191-bb25-d79cbd93c167",
        "author": "Teymur Kheirkhabarov, Endgame, JHasenbusch, Daniil Yugoslavskiy, oscd.community, frack113",
        "customDetails": null,
        "date": "2019/10/22",
        "description": "Detects the usage of \"reg.exe\" in order to dump sensitive registry hives. This includes SAM, SYSTEM and SECURITY hives.",
        "displayName": "Dumping of Sensitive Hives Via Reg.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" save \" or ProcessCommandLine contains \" export \" or ProcessCommandLine contains \" ˢave \" or ProcessCommandLine contains \" eˣport \") and (ProcessCommandLine contains \"\\\\system\" or ProcessCommandLine contains \"\\\\sam\" or ProcessCommandLine contains \"\\\\security\" or ProcessCommandLine contains \"\\\\ˢystem\" or ProcessCommandLine contains \"\\\\syˢtem\" or ProcessCommandLine contains \"\\\\ˢyˢtem\" or ProcessCommandLine contains \"\\\\ˢam\" or ProcessCommandLine contains \"\\\\ˢecurity\") and (ProcessCommandLine contains \"hklm\" or ProcessCommandLine contains \"hk˪m\" or ProcessCommandLine contains \"hkey_local_machine\" or ProcessCommandLine contains \"hkey_˪ocal_machine\" or ProcessCommandLine contains \"hkey_loca˪_machine\" or ProcessCommandLine contains \"hkey_˪oca˪_machine\") and (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
