name: ETW Logging Disabled For SCM
id: 4f281b83-0200-4b34-bf35-d24687ea57c2
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/09
severity: low
description: Detects changes to the "TracingDisabled" key in order to disable ETW
  logging for services.exe (SCM)
status: test
modified: 2023/08/17
logsource:
  category: registry_set
  product: windows
tactics:
- Defense Evasion
relevantTechniques:
- T1112
- T1562
query: 'DeviceRegistryEvents

  | where RegistryValueData =~ "DWORD (0x00000001)" and RegistryKey endswith "Software\\Microsoft\\Windows
  NT\\CurrentVersion\\Tracing\\SCM\\Regular\\TracingDisabled"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
