name: Execution of Suspicious File Type Extension
id: c09dad97-1c78-4f71-b127-7edb2b8e491a
author: Max Altgelt (Nextron Systems)
date: 2021/12/09
severity: medium
description: 'Detects whether the image specified in a process creation event doesn''t
  refer to an ".exe" (or other known executable extension) file. This can be caused
  by process ghosting or other unorthodox methods to start a process.

  This rule might require some initial baselining to align with some third party tooling
  in the user environment.

  '
status: experimental
modified: 2023/11/23
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques: []
query: 'DeviceProcessEvents

  | where (not((FolderPath endswith ".bin" or FolderPath endswith ".cgi" or FolderPath
  endswith ".com" or FolderPath endswith ".exe" or FolderPath endswith ".scr" or FolderPath
  endswith ".tmp"))) and (not((FolderPath contains ":\\$Extend\\$Deleted\\" or FolderPath
  contains ":\\Windows\\System32\\DriverStore\\FileRepository\\" or (FolderPath in~
  ("-", "")) or (FolderPath in~ ("System", "Registry", "MemCompression", "vmmem"))
  or FolderPath contains ":\\Windows\\Installer\\MSI" or (FolderPath contains ":\\Config.Msi\\"
  and (FolderPath endswith ".rbf" or FolderPath endswith ".rbs")) or isnull(FolderPath)
  or (InitiatingProcessFolderPath contains ":\\Windows\\Temp\\" or FolderPath contains
  ":\\Windows\\Temp\\")))) and (not((InitiatingProcessFolderPath contains ":\\ProgramData\\Avira\\"
  or (FolderPath endswith "com.docker.service" and InitiatingProcessFolderPath =~
  "C:\\Windows\\System32\\services.exe") or FolderPath contains ":\\Program Files\\Mozilla
  Firefox\\" or FolderPath endswith "\\LZMA_EXE" or (FolderPath endswith ":\\Program
  Files (x86)\\MyQ\\Server\\pcltool.dll" or FolderPath endswith ":\\Program Files\\MyQ\\Server\\pcltool.dll")
  or (FolderPath contains "NVIDIA\\NvBackend\\" and FolderPath endswith ".dat") or
  ((FolderPath contains ":\\Program Files (x86)\\WINPAKPRO\\" or FolderPath contains
  ":\\Program Files\\WINPAKPRO\\") and FolderPath endswith ".ngn") or (FolderPath
  contains "\\AppData\\Local\\Packages\\" and FolderPath contains "\\LocalState\\rootfs\\"))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
