name: Explorer Process Tree Break
id: 949f1ffb-6e85-4f00-ae1e-c3c5b190d605
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems),
  @gott_cyber
date: 2019-06-29
severity: medium
description: 'Detects a command line process that uses explorer.exe to launch arbitrary
  commands or binaries,

  which is similar to cmd.exe /c, only it breaks the process tree and makes its parent
  a new instance of explorer spawning from "svchost"

  '
status: test
modified: 2024-06-04
logsource:
  category: process_creation
  product: windows
tactics:
- Defense-evasion
relevantTechniques:
- T1036
query: "DeviceProcessEvents\n| where ProcessCommandLine contains \"/factory,{75dff2b7-6936-4c06-a8bb-676a7b00b24b}\"\
  \ or ((ProcessCommandLine contains \"explorer.exe\") and (ProcessCommandLine contains\
  \ \" -root,\" or ProcessCommandLine contains \" /root,\" or ProcessCommandLine contains\
  \ \" \u2013root,\" or ProcessCommandLine contains \" \u2014root,\" or ProcessCommandLine\
  \ contains \" \u2015root,\"))"
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
