name: Files Added To An Archive Using Rar.EXE
id: 6f3e2987-db24-4c78-a860-b4f4095a7095
author: Timur Zinniatullin, E.M. Anhaus, oscd.community
date: 2019/10/21
level: low
description: Detects usage of "rar" to add files to an archive for potential compression.
  An adversary may compress data (e.g. sensitive documents) that is collected prior
  to exfiltration in order to make it portable and minimize the amount of data sent
  over the network.
status: test
modified: 2023/02/05
logsource:
  category: process_creation
  product: windows
tactics:
- collection
relevantTechniques:
- t1560.001
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains " a " and FolderPath endswith "\\rar.exe"'
