name: Files With System DLL Name In Unsuspected Locations
id: 13c02350-4177-4e45-ac17-cf7ca628ff5e
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/06/24
severity: medium
description: 'Detects the creation of a file with the ".dll" extension that has the
  name of a System DLL in uncommon or unsuspected locations. (Outisde of "System32",
  "SysWOW64", etc.).

  It is highly recommended to perform an initial baseline before using this rule in
  production.

  '
status: test
modified: ''
logsource:
  category: file_event
  product: windows
tactics:
- Defense Evasion
relevantTechniques:
- T1036
query: 'DeviceFileEvents

  | where (FolderPath endswith "\\secur32.dll" or FolderPath endswith "\\tdh.dll")
  and (not((FolderPath contains "C:\\$WINDOWS.~BT\\" or FolderPath contains "C:\\$WinREAgent\\"
  or FolderPath contains "C:\\Windows\\SoftwareDistribution\\" or FolderPath contains
  "C:\\Windows\\System32\\" or FolderPath contains "C:\\Windows\\SysWOW64\\" or FolderPath
  contains "C:\\Windows\\WinSxS\\" or FolderPath contains "C:\\Windows\\uus\\")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
