{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/33339be3-148b-4e16-af56-ad16ec6c7e7b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/33339be3-148b-4e16-af56-ad16ec6c7e7b')]",
      "properties": {
        "alertRuleTemplateName": "33339be3-148b-4e16-af56-ad16ec6c7e7b",
        "author": "Trent Liffick",
        "customDetails": null,
        "date": "2020/05/01",
        "description": "Detects usage of findstr to identify and execute a lnk file as seen within the HHS redirect attack",
        "displayName": "Findstr Launching .lnk File",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/01/15",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \".lnk\" or ProcessCommandLine endswith \".lnk\\\"\" or ProcessCommandLine endswith \".lnk'\") and ((FolderPath endswith \"\\\\find.exe\" or FolderPath endswith \"\\\\findstr.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"FIND.EXE\", \"FINDSTR.EXE\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1027",
          "t1036",
          "t1202"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
