{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/57c4bf16-227f-4394-8ec7-1b745ee061c3')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/57c4bf16-227f-4394-8ec7-1b745ee061c3')]",
      "properties": {
        "alertRuleTemplateName": "57c4bf16-227f-4394-8ec7-1b745ee061c3",
        "author": "Fatih Sirin",
        "customDetails": null,
        "date": "2019/11/01",
        "description": "Detects netsh commands that turns off the Windows firewall",
        "displayName": "Firewall Disabled via Netsh.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/13",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\") and ((ProcessCommandLine contains \"firewall\" and ProcessCommandLine contains \"set\" and ProcessCommandLine contains \"opmode\" and ProcessCommandLine contains \"disable\") or (ProcessCommandLine contains \"advfirewall\" and ProcessCommandLine contains \"set\" and ProcessCommandLine contains \"state\" and ProcessCommandLine contains \"off\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1562"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
