{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1e59c230-6670-45bf-83b0-98903780607e')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1e59c230-6670-45bf-83b0-98903780607e')]",
      "properties": {
        "alertRuleTemplateName": "1e59c230-6670-45bf-83b0-98903780607e",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/05/16",
        "description": "Detects the execution of the LOLBIN gpscript, which executes logon or startup scripts configured in Group Policy",
        "displayName": "Gpscript Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/06/14",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" /logon\" or ProcessCommandLine contains \" /startup\") and (FolderPath endswith \"\\\\gpscript.exe\" or ProcessVersionInfoOriginalFileName =~ \"GPSCRIPT.EXE\")) and (not(InitiatingProcessCommandLine =~ \"C:\\\\windows\\\\system32\\\\svchost.exe -k netsvcs -p -s gpsvc\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
