{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f26307d8-14cd-47e3-a26b-4b4769f24af6')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f26307d8-14cd-47e3-a26b-4b4769f24af6')]",
      "properties": {
        "alertRuleTemplateName": "f26307d8-14cd-47e3-a26b-4b4769f24af6",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/03/12",
        "description": "Detects suspicious process patterns found in logs when CrackMapExec is used",
        "displayName": "HackTool - CrackMapExec Process Patterns",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/13",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"cmd.exe /c \" or ProcessCommandLine contains \"cmd.exe /r \" or ProcessCommandLine contains \"cmd.exe /k \" or ProcessCommandLine contains \"cmd /c \" or ProcessCommandLine contains \"cmd /r \" or ProcessCommandLine contains \"cmd /k \") and (ProcessCommandLine contains \"tasklist /fi \" and ProcessCommandLine contains \"Imagename eq lsass.exe\") and (AccountName contains \"AUTHORI\" or AccountName contains \"AUTORI\")) or (ProcessCommandLine contains \"do rundll32.exe C:\\\\windows\\\\System32\\\\comsvcs.dll, MiniDump\" and ProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\" and ProcessCommandLine contains \" full\" and ProcessCommandLine contains \"%%B\") or (ProcessCommandLine contains \"tasklist /v /fo csv\" and ProcessCommandLine contains \"findstr /i \\\"lsass\\\"\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
