name: HackTool - winPEAS Execution
id: 98b53e78-ebaf-46f8-be06-421aafd176d9
author: Georg Lauenstein (sure[secure])
date: 2022/09/19
severity: high
description: WinPEAS is a script that search for possible paths to escalate privileges
  on Windows hosts. The checks are explained on book.hacktricks.xyz
status: test
modified: 2023/03/23
logsource:
  category: process_creation
  product: windows
tactics:
- privilege_escalation
relevantTechniques:
- t1046
- t1082
- t1087
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains "https://github.com/carlospolop/PEASS-ng/releases/latest/download/"
  or (ProcessCommandLine contains " applicationsinfo" or ProcessCommandLine contains
  " browserinfo" or ProcessCommandLine contains " eventsinfo" or ProcessCommandLine
  contains " fileanalysis" or ProcessCommandLine contains " filesinfo" or ProcessCommandLine
  contains " processinfo" or ProcessCommandLine contains " servicesinfo" or ProcessCommandLine
  contains " windowscreds") or (InitiatingProcessCommandLine endswith " -linpeas"
  or ProcessCommandLine endswith " -linpeas") or (ProcessVersionInfoOriginalFileName
  =~ "winPEAS.exe" or (FolderPath endswith "\\winPEASany_ofs.exe" or FolderPath endswith
  "\\winPEASany.exe" or FolderPath endswith "\\winPEASx64_ofs.exe" or FolderPath endswith
  "\\winPEASx64.exe" or FolderPath endswith "\\winPEASx86_ofs.exe" or FolderPath endswith
  "\\winPEASx86.exe"))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
