name: HackTool - SharpMove Tool Execution
id: 055fb54c-a8f4-4aee-bd44-f74cf30a0d9d
author: Luca Di Bartolomeo (CrimpSec)
date: 2024/01/29
level: high
description: 'Detects the execution of SharpMove, a .NET utility performing multiple
  tasks such as "Task Creation", "SCM" query, VBScript execution using WMI via its
  PE metadata and command line options.

  '
status: experimental
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- lateral_movement
relevantTechniques:
- t1021.002
query: 'DeviceProcessEvents

  | where (FolderPath endswith "\\SharpMove.exe" or ProcessVersionInfoOriginalFileName
  =~ "SharpMove.exe") or ((ProcessCommandLine contains "action=create" or ProcessCommandLine
  contains "action=dcom" or ProcessCommandLine contains "action=executevbs" or ProcessCommandLine
  contains "action=hijackdcom" or ProcessCommandLine contains "action=modschtask"
  or ProcessCommandLine contains "action=modsvc" or ProcessCommandLine contains "action=query"
  or ProcessCommandLine contains "action=scm" or ProcessCommandLine contains "action=startservice"
  or ProcessCommandLine contains "action=taskscheduler") and ProcessCommandLine contains
  "computername=")'
