{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e96253b8-6b3b-4f90-9e59-3b24b99cf9b4')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e96253b8-6b3b-4f90-9e59-3b24b99cf9b4')]",
      "properties": {
        "alertRuleTemplateName": "e96253b8-6b3b-4f90-9e59-3b24b99cf9b4",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/04/27",
        "description": "Detects the use of KrbRelay, a Kerberos relaying tool",
        "displayName": "HackTool - KrbRelay Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/04",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -spn \" and ProcessCommandLine contains \" -clsid \" and ProcessCommandLine contains \" -rbcd \") or (ProcessCommandLine contains \"shadowcred\" and ProcessCommandLine contains \"clsid\" and ProcessCommandLine contains \"spn\") or (ProcessCommandLine contains \"spn \" and ProcessCommandLine contains \"session \" and ProcessCommandLine contains \"clsid \") or (FolderPath endswith \"\\\\KrbRelay.exe\" or ProcessVersionInfoOriginalFileName =~ \"KrbRelay.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1558"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
