name: HackTool - Wmiexec Default Powershell Command
id: 022eaba8-f0bf-4dd9-9217-4604b0bb3bb0
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/08
level: high
description: Detects the execution of PowerShell with a specific flag sequence that
  is used by the Wmiexec script
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
- lateral_movement
relevantTechniques: []
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains "-NoP -NoL -sta -NonI -W Hidden -Exec Bypass
  -Enc"'
