{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/26488ad0-f9fd-4536-876f-52fea846a2e4')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/26488ad0-f9fd-4536-876f-52fea846a2e4')]",
      "properties": {
        "alertRuleTemplateName": "26488ad0-f9fd-4536-876f-52fea846a2e4",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/15",
        "description": "Detects the execution of the hacktool SharPersist - used to deploy various different kinds of persistence mechanisms",
        "displayName": "HackTool - SharPersist Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/04",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -t schtask -c \" or ProcessCommandLine contains \" -t startupfolder -c \") or (ProcessCommandLine contains \" -t reg -c \" and ProcessCommandLine contains \" -m add\") or (ProcessCommandLine contains \" -t service -c \" and ProcessCommandLine contains \" -m add\") or (ProcessCommandLine contains \" -t schtask -c \" and ProcessCommandLine contains \" -m add\") or (FolderPath endswith \"\\\\SharPersist.exe\" or ProcessVersionInfoProductName =~ \"SharPersist\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1053"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
