{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/52cad028-0ff0-4854-8f67-d25dfcbc78b4')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/52cad028-0ff0-4854-8f67-d25dfcbc78b4')]",
      "properties": {
        "alertRuleTemplateName": "52cad028-0ff0-4854-8f67-d25dfcbc78b4",
        "author": "Maxim Pavlunin, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2020/04/01",
        "description": "Detects a suspicious child process of a Microsoft HTML Help (HH.exe)",
        "displayName": "HTML Help HH.EXE Suspicious Child Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/04/12",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\CertReq.exe\" or FolderPath endswith \"\\\\CertUtil.exe\" or FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\installutil.exe\" or FolderPath endswith \"\\\\MSbuild.exe\" or FolderPath endswith \"\\\\MSHTA.EXE\" or FolderPath endswith \"\\\\msiexec.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\wmic.exe\" or FolderPath endswith \"\\\\wscript.exe\") and InitiatingProcessFolderPath endswith \"\\\\hh.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1047",
          "t1059",
          "t1218",
          "t1566"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
