name: Hypervisor Enforced Code Integrity Disabled
id: 8b7273a4-ba5d-4d8a-b04f-11f2900d043a
author: Nasreddine Bencherchali (Nextron Systems), Anish Bogati
date: 2023/03/14
severity: high
description: Detects changes to the HypervisorEnforcedCodeIntegrity registry key and
  the "Enabled" value being set to 0 in order to disable the Hypervisor Enforced Code
  Integrity feature. This allows an attacker to load unsigned and untrusted code to
  be run in the kernel
status: experimental
modified: 2024/01/10
logsource:
  category: registry_set
  product: windows
tactics:
- Defense Evasion
relevantTechniques:
- T1562
query: 'DeviceRegistryEvents

  | where RegistryValueData =~ "DWORD (0x00000000)" and ActionType =~ "RegistryValueSet"
  and (RegistryKey endswith "\\Microsoft\\Windows\\DeviceGuard\\HypervisorEnforcedCodeIntegrity"
  or RegistryKey endswith "\\Control\\DeviceGuard\\HypervisorEnforcedCodeIntegrity"
  or RegistryKey endswith "\\Control\\DeviceGuard\\Scenarios\\HypervisorEnforcedCodeIntegrity\\Enabled")'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
