name: Invoke-Obfuscation Via Stdin
id: 9c14c9fa-1a63-4a64-8e57-d19280559490
author: Nikita Nazarov, oscd.community
date: 2020/10/12
severity: high
description: Detects Obfuscated Powershell via Stdin in Scripts
status: test
modified: 2024/04/16
logsource:
  category: process_creation
  product: windows
tactics:
- Defense Evasion
- Execution
relevantTechniques:
- T1027
- T1059
query: 'DeviceProcessEvents

  | where ProcessCommandLine matches regex "(?i)(set).*&&\\s?set.*(environment|invoke|\\$\\{?input).*&&.*""'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
