name: LSASS Process Dump Artefact In CrashDumps Folder
id: 6902955a-01b7-432c-b32a-6f5f81d8f625
author: '@pbssubhash'
date: 2022-12-08
severity: high
description: Detects the presence of an LSASS dump file in the "CrashDumps" folder.
  This could be a sign of LSASS credential dumping. Techniques such as the LSASS Shtinkering
  have been seen abusing the Windows Error Reporting to dump said process.
status: test
modified: ''
logsource:
  category: file_event
  product: windows
tactics:
- Credential-access
relevantTechniques:
- T1003
query: 'DeviceFileEvents

  | where FolderPath contains "lsass.exe." and FolderPath endswith ".dmp" and FolderPath
  startswith "C:\\Windows\\System32\\config\\systemprofile\\AppData\\Local\\CrashDumps\\"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
