name: Monitoring For Persistence Via BITS
id: b9cbbc17-d00d-4e3d-a827-b06d03d2380d
author: Sreeman
date: 2020/10/29
severity: medium
description: 'BITS will allow you to schedule a command to execute after a successful
  download to notify you that the job is finished.

  When the job runs on the system the command specified in the BITS job will be executed.

  This can be abused by actors to create a backdoor within the system and for persistence.

  It will be chained in a BITS job to schedule the download of malware/additional
  binaries and execute the program after being downloaded.

  '
status: test
modified: 2024/01/25
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1197
query: 'DeviceProcessEvents

  | where (FolderPath endswith "\\bitsadmin.exe" or ProcessVersionInfoOriginalFileName
  =~ "bitsadmin.exe") and ((ProcessCommandLine contains "/SetNotifyCmdLine" and (ProcessCommandLine
  contains "%COMSPEC%" or ProcessCommandLine contains "cmd.exe" or ProcessCommandLine
  contains "regsvr32.exe")) or (ProcessCommandLine contains "/Addfile" and (ProcessCommandLine
  contains "http:" or ProcessCommandLine contains "https:" or ProcessCommandLine contains
  "ftp:" or ProcessCommandLine contains "ftps:")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
