{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/07837ab9-60e1-481f-a74d-c31fb496a94c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/07837ab9-60e1-481f-a74d-c31fb496a94c')]",
      "properties": {
        "alertRuleTemplateName": "07837ab9-60e1-481f-a74d-c31fb496a94c",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2024/05/31",
        "description": "Detects an executable accessing the portmap.io domain, which could be a sign of forbidden C2 traffic or data exfiltration by malicious actors",
        "displayName": "Network Communication Initiated To Portmap.IO Domain",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceNetworkEvents\n| where RemoteUrl endswith \".portmap.io\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "exfiltration"
        ],
        "techniques": [
          "t1041",
          "t1090"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
