name: New Firewall Rule Added Via Netsh.EXE
id: cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c
author: Markus Neis, Sander Wiebing
date: 2019/01/29
level: medium
description: Detects the addition of a new rule to the Windows firewall via netsh
status: test
modified: 2023/02/10
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
- s0246
relevantTechniques:
- t1562.004
query: 'DeviceProcessEvents

  | where ((ProcessCommandLine contains " firewall " and ProcessCommandLine contains
  " add ") and (FolderPath endswith "\\netsh.exe" or ProcessVersionInfoOriginalFileName
  =~ "netsh.exe")) and (not(((ProcessCommandLine contains "advfirewall firewall add
  rule name=Dropbox dir=in action=allow \"program=" and ProcessCommandLine contains
  ":\\Program Files (x86)\\Dropbox\\Client\\Dropbox.exe\" enable=yes profile=Any")
  or (ProcessCommandLine contains "advfirewall firewall add rule name=Dropbox dir=in
  action=allow \"program=" and ProcessCommandLine contains ":\\Program Files\\Dropbox\\Client\\Dropbox.exe\"
  enable=yes profile=Any"))))'
