{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b1ec66c6-f4d1-4b5c-96dd-af28ccae7727')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b1ec66c6-f4d1-4b5c-96dd-af28ccae7727')]",
      "properties": {
        "alertRuleTemplateName": "b1ec66c6-f4d1-4b5c-96dd-af28ccae7727",
        "author": "frack113, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/02/03",
        "description": "Detects usage of \"cmdkey.exe\" to add generic credentials.\nAs an example, this can be used before connecting to an RDP session via command line interface.\n",
        "displayName": "New Generic Credentials Added Via Cmdkey.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/05",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -g\" or ProcessCommandLine contains \" /g\") and (ProcessCommandLine contains \" -p\" or ProcessCommandLine contains \" /p\") and (ProcessCommandLine contains \" -u\" or ProcessCommandLine contains \" /u\") and (FolderPath endswith \"\\\\cmdkey.exe\" or ProcessVersionInfoOriginalFileName =~ \"cmdkey.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
