name: New ODBC Driver Registered
id: 3390fbef-c98d-4bdd-a863-d65ed7c610dd
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/23
severity: low
description: Detects the registration of a new ODBC driver.
status: experimental
modified: 2023/08/17
logsource:
  category: registry_set
  product: windows
tactics:
- Persistence
relevantTechniques: []
query: 'DeviceRegistryEvents

  | where (RegistryKey contains "\\SOFTWARE\\ODBC\\ODBCINST.INI" and RegistryKey endswith
  "\\Driver") and (not((RegistryValueData =~ "%WINDIR%\\System32\\SQLSRV32.dll" and
  RegistryKey contains "\\SQL Server"))) and (not(((RegistryValueData endswith "\\ACEODBC.DLL"
  and RegistryValueData startswith "C:\\Progra" and RegistryKey contains "\\Microsoft
  Access ") or (RegistryValueData endswith "\\ACEODBC.DLL" and RegistryValueData startswith
  "C:\\Progra" and RegistryKey contains "\\Microsoft Excel Driver"))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
