name: Office Macro File Download
id: 0e29e3a7-1ad8-40aa-b691-9f82ecd33d66
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/01/23
severity: medium
description: Detects the creation of a new office macro files on the systems via an
  application (browser, mail client).
status: test
modified: 2023/04/18
logsource:
  category: file_event
  product: windows
tactics:
- Initial Access
relevantTechniques:
- T1566
query: 'DeviceFileEvents

  | where ((FolderPath endswith ".docm" or FolderPath endswith ".dotm" or FolderPath
  endswith ".xlsm" or FolderPath endswith ".xltm" or FolderPath endswith ".potm" or
  FolderPath endswith ".pptm") or (FolderPath contains ".docm:Zone" or FolderPath
  contains ".dotm:Zone" or FolderPath contains ".xlsm:Zone" or FolderPath contains
  ".xltm:Zone" or FolderPath contains ".potm:Zone" or FolderPath contains ".pptm:Zone"))
  and (InitiatingProcessFolderPath endswith "\\RuntimeBroker.exe" or InitiatingProcessFolderPath
  endswith "\\outlook.exe" or InitiatingProcessFolderPath endswith "\\thunderbird.exe"
  or InitiatingProcessFolderPath endswith "\\brave.exe" or InitiatingProcessFolderPath
  endswith "\\chrome.exe" or InitiatingProcessFolderPath endswith "\\firefox.exe"
  or InitiatingProcessFolderPath endswith "\\iexplore.exe" or InitiatingProcessFolderPath
  endswith "\\maxthon.exe" or InitiatingProcessFolderPath endswith "\\MicrosoftEdge.exe"
  or InitiatingProcessFolderPath endswith "\\msedge.exe" or InitiatingProcessFolderPath
  endswith "\\msedgewebview2.exe" or InitiatingProcessFolderPath endswith "\\opera.exe"
  or InitiatingProcessFolderPath endswith "\\safari.exe" or InitiatingProcessFolderPath
  endswith "\\seamonkey.exe" or InitiatingProcessFolderPath endswith "\\vivaldi.exe"
  or InitiatingProcessFolderPath endswith "\\whale.exe")'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
