{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cec8e918-30f7-4e2d-9bfa-a59cc97ae60f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cec8e918-30f7-4e2d-9bfa-a59cc97ae60f')]",
      "properties": {
        "alertRuleTemplateName": "cec8e918-30f7-4e2d-9bfa-a59cc97ae60f",
        "author": "Beyu Denis, oscd.community (rule), @harr0ey (idea)",
        "customDetails": null,
        "date": "2019/10/12",
        "description": "The OpenWith.exe executes other binary",
        "displayName": "OpenWith.exe Executes Specified Binary",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2021/11/27",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"/c\" and FolderPath endswith \"\\\\OpenWith.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
