name: Persistence Via New SIP Provider
id: 5a2b21ee-6aaa-4234-ac9d-59a59edf90a1
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-21
severity: medium
description: Detects when an attacker register a new SIP provider for persistence
  and defense evasion
status: test
modified: 2023-08-17
logsource:
  category: registry_set
  product: windows
tactics:
- Defense-evasion
- Persistence
relevantTechniques:
- T1553
query: 'DeviceRegistryEvents

  | where ((RegistryKey contains "\\Dll" or RegistryKey contains "\\$DLL") and (RegistryKey
  contains "\\SOFTWARE\\Microsoft\\Cryptography\\Providers\\" or RegistryKey contains
  "\\SOFTWARE\\Microsoft\\Cryptography\\OID\\EncodingType" or RegistryKey contains
  "\\SOFTWARE\\WOW6432Node\\Microsoft\\Cryptography\\Providers\\" or RegistryKey contains
  "\\SOFTWARE\\WOW6432Node\\Microsoft\\Cryptography\\OID\\EncodingType")) and (not(((RegistryValueData
  in~ ("WINTRUST.DLL", "mso.dll")) or (RegistryValueData =~ "C:\\Windows\\System32\\PsfSip.dll"
  and InitiatingProcessFolderPath =~ "C:\\Windows\\System32\\poqexec.exe" and RegistryKey
  contains "\\CryptSIPDll"))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
