name: Php Inline Command Execution
id: d81871ef-5738-47ab-9797-7a9c90cd4bfb
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/02
level: medium
description: Detects execution of php using the "-r" flag. This is could be used as
  a way to launch a reverse shell or execute live php code.
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- execution
relevantTechniques:
- t1059
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains " -r" and (FolderPath endswith "\\php.exe" or
  ProcessVersionInfoOriginalFileName =~ "php.exe")'
