name: Potential Azure Browser SSO Abuse
id: 50f852e6-af22-4c78-9ede-42ef36aa3453
author: Den Iuzvyk
date: 2020/07/15
level: low
description: 'Detects abusing Azure Browser SSO by requesting OAuth 2.0 refresh tokens
  for an Azure-AD-authenticated Windows user (i.e. the machine is joined to Azure
  AD and a user logs in with their Azure AD account) wanting to perform SSO authentication
  in the browser.

  An attacker can use this to authenticate to Azure AD in a browser as that user.

  '
status: test
modified: 2023/04/18
logsource:
  category: image_load
  product: windows
tactics:
- defense_evasion
- privilege_escalation
relevantTechniques:
- t1574.002
query: 'DeviceImageLoadEvents

  | where FolderPath =~ "C:\\Windows\\System32\\MicrosoftAccountTokenProvider.dll"
  and (not((InitiatingProcessFolderPath endswith "\\BackgroundTaskHost.exe" and (InitiatingProcessFolderPath
  startswith "C:\\Windows\\System32\\" or InitiatingProcessFolderPath startswith "C:\\Windows\\SysWOW64\\"))))
  and (not(((InitiatingProcessFolderPath endswith "\\IDE\\devenv.exe" and (InitiatingProcessFolderPath
  startswith "C:\\Program Files\\Microsoft Visual Studio\\" or InitiatingProcessFolderPath
  startswith "C:\\Program Files (x86)\\Microsoft Visual Studio\\")) or (InitiatingProcessFolderPath
  startswith "C:\\Program Files (x86)\\Microsoft\\EdgeWebView\\Application\\" or InitiatingProcessFolderPath
  endswith "\\WindowsApps\\MicrosoftEdge.exe" or (InitiatingProcessFolderPath in~
  ("C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe", "C:\\Program
  Files\\Microsoft\\Edge\\Application\\msedge.exe"))) or ((InitiatingProcessFolderPath
  endswith "\\msedge.exe" or InitiatingProcessFolderPath endswith "\\msedgewebview2.exe")
  and (InitiatingProcessFolderPath startswith "C:\\Program Files (x86)\\Microsoft\\EdgeCore\\"
  or InitiatingProcessFolderPath startswith "C:\\Program Files\\Microsoft\\EdgeCore\\"))
  or (InitiatingProcessFolderPath in~ ("C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe",
  "C:\\Program Files\\Internet Explorer\\iexplore.exe")) or isnull(InitiatingProcessFolderPath)
  or InitiatingProcessFolderPath endswith "\\AppData\\Local\\Microsoft\\OneDrive\\OneDrive.exe")))'
