name: Potential Qakbot Registry Activity
id: 1c8e96cd-2bed-487d-9de0-b46c90cade56
author: Hieu Tran
date: 2023/03/13
severity: high
description: Detects a registry key used by IceID in a campaign that distributes malicious
  OneNote files
status: test
modified: ''
logsource:
  category: registry_event
  product: windows
tactics:
- Defense Evasion
relevantTechniques:
- T1112
query: 'DeviceRegistryEvents

  | where RegistryKey endswith "\\Software\\firm\\soft\\Name"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
