name: Potentially Suspicious EventLog Recon Activity Using Log Query Utilities
id: beaa66d6-aa1b-4e3c-80f5-e0145369bfaf
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
date: 2022/09/09
level: medium
description: 'Detects execution of different log query utilities and commands to search
  and dump the content of specific event logs or look for specific event IDs.

  This technique is used by threat actors in order to extract sensitive information
  from events logs such as usernames, IP addresses, hostnames, etc.

  '
status: experimental
modified: 2024/01/02
logsource:
  category: process_creation
  product: windows
tactics:
- credential_access
- discovery
relevantTechniques:
- t1552
query: 'DeviceProcessEvents

  | where ((ProcessCommandLine contains "-InstanceId 4624" or ProcessCommandLine contains
  "System[EventID=4624]" or (ProcessCommandLine contains "EventCode=" and ProcessCommandLine
  contains "4624") or (ProcessCommandLine contains "EventIdentifier=" and ProcessCommandLine
  contains "4624") or ProcessCommandLine contains "-InstanceId 4778" or ProcessCommandLine
  contains "System[EventID=4778]" or (ProcessCommandLine contains "EventCode=" and
  ProcessCommandLine contains "4778") or (ProcessCommandLine contains "EventIdentifier="
  and ProcessCommandLine contains "4778") or ProcessCommandLine contains "-InstanceId
  25" or ProcessCommandLine contains "System[EventID=25]" or (ProcessCommandLine contains
  "EventCode=" and ProcessCommandLine contains "25") or (ProcessCommandLine contains
  "EventIdentifier=" and ProcessCommandLine contains "25")) or (ProcessCommandLine
  contains "Microsoft-Windows-TerminalServices-LocalSessionManager/Operational" or
  ProcessCommandLine contains "Microsoft-Windows-Terminal-Services-RemoteConnectionManager/Operational"
  or ProcessCommandLine contains "Security")) and ((ProcessCommandLine contains "Select"
  and ProcessCommandLine contains "Win32_NTLogEvent") or ((ProcessCommandLine contains
  " qe " or ProcessCommandLine contains " query-events ") and (FolderPath endswith
  "\\wevtutil.exe" or ProcessVersionInfoOriginalFileName =~ "wevtutil.exe")) or (ProcessCommandLine
  contains " ntevent" and (FolderPath endswith "\\wmic.exe" or ProcessVersionInfoOriginalFileName
  =~ "wmic.exe")) or (ProcessCommandLine contains "Get-WinEvent " or ProcessCommandLine
  contains "get-eventlog "))'
