name: Potential SentinelOne Shell Context Menu Scan Command Tampering
id: 6c304b02-06e6-402d-8be4-d5833cdf8198
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-03-06
severity: medium
description: Detects potentially suspicious changes to the SentinelOne context menu
  scan command by a process other than SentinelOne.
status: experimental
modified: ''
logsource:
  category: registry_set
  product: windows
tactics:
- Persistence
relevantTechniques: []
query: 'DeviceRegistryEvents

  | where RegistryKey contains "\\shell\\SentinelOneScan\\command" and (not(((InitiatingProcessFolderPath
  endswith "C:\\Program Files\\SentinelOne\\" or InitiatingProcessFolderPath endswith
  "C:\\Program Files (x86)\\SentinelOne\\") or (RegistryValueData contains "\\SentinelScanFromContextMenu.exe"
  and (RegistryValueData startswith "C:\\Program Files\\SentinelOne\\Sentinel Agent"
  or RegistryValueData startswith "C:\\Program Files (x86)\\SentinelOne\\Sentinel
  Agent")))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
