name: Potential Arbitrary File Download Via Cmdl32.EXE
id: f37aba28-a9e6-4045-882c-d5004043b337
author: frack113
date: 2021/11/03
level: medium
description: 'Detects execution of Cmdl32 with the "/vpn" and "/lan" flags.

  Attackers can abuse this utility in order to download arbitrary files via a configuration
  file.

  Inspect the location and the content of the file passed as an argument in order
  to determine if it is suspicious.

  '
status: test
modified: 2024/04/22
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
- execution
relevantTechniques:
- t1202
- t1218
query: 'DeviceProcessEvents

  | where (ProcessCommandLine contains "/vpn" and ProcessCommandLine contains "/lan")
  and (FolderPath endswith "\\cmdl32.exe" or ProcessVersionInfoOriginalFileName =~
  "CMDL32.EXE")'
