name: Potential Suspicious Registry File Imported Via Reg.EXE
id: 62e0298b-e994-4189-bc87-bc699aa62d97
author: frack113, Nasreddine Bencherchali
date: 2022/08/01
level: medium
description: Detects the import of '.reg' files from suspicious paths using the 'reg.exe'
  utility
status: test
modified: 2023/02/05
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1112
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains " import " and (FolderPath endswith "\\reg.exe"
  or ProcessVersionInfoOriginalFileName =~ "reg.exe") and (ProcessCommandLine contains
  "C:\\Users\\" or ProcessCommandLine contains "%temp%" or ProcessCommandLine contains
  "%tmp%" or ProcessCommandLine contains "%appdata%" or ProcessCommandLine contains
  "\\AppData\\Local\\Temp\\" or ProcessCommandLine contains "C:\\Windows\\Temp\\"
  or ProcessCommandLine contains "C:\\ProgramData\\")'
