name: Potential CobaltStrike Service Installations - Registry
id: 61a7697c-cb79-42a8-a2ff-5f0cdfae0130
author: Wojciech Lesicki
date: 2021/06/29
severity: high
description: 'Detects known malicious service installs that appear in cases in which
  a Cobalt Strike beacon elevates privileges or lateral movement.

  '
status: test
modified: 2024/03/25
logsource:
  category: registry_set
  product: windows
tactics:
- Execution
- Lateral Movement
- Privilege Escalation
relevantTechniques:
- T1021
- T1543
- T1569
query: 'DeviceRegistryEvents

  | where ((RegistryValueData contains "ADMIN$" and RegistryValueData contains ".exe")
  or (RegistryValueData contains "%COMSPEC%" and RegistryValueData contains "start"
  and RegistryValueData contains "powershell")) and (RegistryKey contains "\\System\\CurrentControlSet\\Services"
  or (RegistryKey contains "\\System\\ControlSet" and RegistryKey contains "\\Services"))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
