name: Potentially Suspicious Event Viewer Child Process
id: be344333-921d-4c4d-8bb8-e584cf584780
author: Florian Roth (Nextron Systems)
date: 2017/03/19
severity: high
description: Detects uncommon or suspicious child processes of "eventvwr.exe" which
  might indicate a UAC bypass attempt
status: test
modified: 2023/09/28
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
- privilege_escalation
relevantTechniques:
- t1548.002
query: 'DeviceProcessEvents

  | where InitiatingProcessFolderPath endswith "\\eventvwr.exe" and (not((FolderPath
  endswith ":\\Windows\\System32\\mmc.exe" or FolderPath endswith ":\\Windows\\System32\\WerFault.exe"
  or FolderPath endswith ":\\Windows\\SysWOW64\\WerFault.exe")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
