{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a4824fca-976f-4964-b334-0621379e84c4')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a4824fca-976f-4964-b334-0621379e84c4')]",
      "properties": {
        "alertRuleTemplateName": "a4824fca-976f-4964-b334-0621379e84c4",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/06/03",
        "description": "Detects the use of SDelete to erase a file not the free space",
        "displayName": "Potential File Overwrite Via Sysinternals SDelete",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/28",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoOriginalFileName =~ \"sdelete.exe\" and (not((ProcessCommandLine contains \" -h\" or ProcessCommandLine contains \" -c\" or ProcessCommandLine contains \" -z\" or ProcessCommandLine contains \" /?\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "impact"
        ],
        "techniques": [
          "t1485"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
