name: Potential Persistence Via AppCompat RegisterAppRestart Layer
id: b86852fb-4c77-48f9-8519-eb1b2c308b59
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/01/01
severity: medium
description: 'Detects the setting of the REGISTERAPPRESTART compatibility layer on
  an application.

  This compatibility layer allows an application to register for restart using the
  "RegisterApplicationRestart" API.

  This can be potentially abused as a persistence mechanism.

  '
status: experimental
modified: ''
logsource:
  category: registry_set
  product: windows
tactics:
- Persistence
relevantTechniques:
- T1546
query: 'DeviceRegistryEvents

  | where RegistryValueData contains "REGISTERAPPRESTART" and RegistryKey contains
  "\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\AppCompatFlags\\Layers"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
