{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/edd3ddc3-386f-4ba5-9ada-4376b2cfa7b5')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/edd3ddc3-386f-4ba5-9ada-4376b2cfa7b5')]",
      "properties": {
        "alertRuleTemplateName": "edd3ddc3-386f-4ba5-9ada-4376b2cfa7b5",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/08/03",
        "description": "Detects potential DLL sideloading of \"EACore.dll\"",
        "displayName": "Potential EACore.DLL Sideloading",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\EACore.dll\" and (not((FolderPath startswith \"C:\\\\Program Files\\\\Electronic Arts\\\\EA Desktop\\\\\" and (InitiatingProcessFolderPath contains \"C:\\\\Program Files\\\\Electronic Arts\\\\EA Desktop\\\\\" and InitiatingProcessFolderPath contains \"\\\\EACoreServer.exe\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
