name: Potentially Suspicious Network Connection To Notion API
id: 7e9cf7b6-e827-11ed-a05b-15959c120003
author: Gavin Knapp
date: 2023/05/03
severity: low
description: Detects a non-browser process communicating with the Notion API. This
  could indicate potential use of a covert C2 channel such as "OffensiveNotion C2"
status: test
modified: ''
logsource:
  category: network_connection
  product: windows
tactics:
- command_and_control
relevantTechniques:
- t1102
query: 'DeviceNetworkEvents

  | where RemoteUrl contains "api.notion.com" and (not((InitiatingProcessFolderPath
  endswith "\\brave.exe" or (InitiatingProcessFolderPath in~ ("C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe",
  "C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe")) or (InitiatingProcessFolderPath
  startswith "C:\\Program Files (x86)\\Microsoft\\EdgeWebView\\Application\\" or InitiatingProcessFolderPath
  endswith "\\WindowsApps\\MicrosoftEdge.exe" or (InitiatingProcessFolderPath in~
  ("C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe", "C:\\Program
  Files\\Microsoft\\Edge\\Application\\msedge.exe"))) or ((InitiatingProcessFolderPath
  endswith "\\msedge.exe" or InitiatingProcessFolderPath endswith "\\msedgewebview2.exe")
  and (InitiatingProcessFolderPath startswith "C:\\Program Files (x86)\\Microsoft\\EdgeCore\\"
  or InitiatingProcessFolderPath startswith "C:\\Program Files\\Microsoft\\EdgeCore\\"))
  or (InitiatingProcessFolderPath in~ ("C:\\Program Files\\Mozilla Firefox\\firefox.exe",
  "C:\\Program Files (x86)\\Mozilla Firefox\\firefox.exe")) or (InitiatingProcessFolderPath
  in~ ("C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe", "C:\\Program Files\\Internet
  Explorer\\iexplore.exe")) or InitiatingProcessFolderPath endswith "\\maxthon.exe"
  or InitiatingProcessFolderPath endswith "\\AppData\\Local\\Programs\\Notion\\Notion.exe"
  or InitiatingProcessFolderPath endswith "\\opera.exe" or InitiatingProcessFolderPath
  endswith "\\safari.exe" or InitiatingProcessFolderPath endswith "\\seamonkey.exe"
  or InitiatingProcessFolderPath endswith "\\vivaldi.exe" or InitiatingProcessFolderPath
  endswith "\\whale.exe")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
