name: Potential 7za.DLL Sideloading
id: 4f6edb78-5c21-42ab-a558-fd2a6fc1fd57
author: X__Junior
date: 2023/06/09
level: low
description: Detects potential DLL sideloading of "7za.dll"
status: test
modified: ''
logsource:
  category: image_load
  product: windows
tactics:
- defense_evasion
- persistence
- privilege_escalation
relevantTechniques:
- t1574.001
- t1574.002
query: 'DeviceImageLoadEvents

  | where FolderPath endswith "\\7za.dll" and (not(((FolderPath startswith "C:\\Program
  Files (x86)\\" or FolderPath startswith "C:\\Program Files\\") and (InitiatingProcessFolderPath
  startswith "C:\\Program Files (x86)\\" or InitiatingProcessFolderPath startswith
  "C:\\Program Files\\"))))'
