name: Potential Suspicious Mofcomp Execution
id: 1dd05363-104e-4b4a-b963-196a534b03a1
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/12
level: high
description: 'Detects execution of the "mofcomp" utility as a child of a suspicious
  shell or script running utility or by having a suspicious path in the commandline.

  The "mofcomp" utility parses a file containing MOF statements and adds the classes
  and class instances defined in the file to the WMI repository.

  Attackers abuse this utility to install malicious MOF scripts

  '
status: test
modified: 2023/04/11
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1218
query: 'DeviceProcessEvents

  | where (((InitiatingProcessFolderPath endswith "\\cmd.exe" or InitiatingProcessFolderPath
  endswith "\\powershell.exe" or InitiatingProcessFolderPath endswith "\\pwsh.exe"
  or InitiatingProcessFolderPath endswith "\\wsl.exe" or InitiatingProcessFolderPath
  endswith "\\wscript.exe" or InitiatingProcessFolderPath endswith "\\cscript.exe")
  or (ProcessCommandLine contains "\\AppData\\Local\\Temp" or ProcessCommandLine contains
  "\\Users\\Public\\" or ProcessCommandLine contains "\\WINDOWS\\Temp\\" or ProcessCommandLine
  contains "%temp%" or ProcessCommandLine contains "%tmp%" or ProcessCommandLine contains
  "%appdata%")) and (FolderPath endswith "\\mofcomp.exe" or ProcessVersionInfoOriginalFileName
  =~ "mofcomp.exe")) and (not((ProcessCommandLine contains "C:\\Windows\\TEMP\\" and
  ProcessCommandLine endswith ".mof" and InitiatingProcessFolderPath =~ "C:\\Windows\\System32\\wbem\\WmiPrvSE.exe")))
  and (not((ProcessCommandLine contains "C:\\Windows\\TEMP\\" and ProcessCommandLine
  endswith ".mof")))'
