{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/3735d5ac-d770-4da0-99ff-156b180bc600')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/3735d5ac-d770-4da0-99ff-156b180bc600')]",
      "properties": {
        "alertRuleTemplateName": "3735d5ac-d770-4da0-99ff-156b180bc600",
        "author": "X__Junior",
        "customDetails": null,
        "date": "2023/07/13",
        "description": "Detects potential DLL sideloading of \"CCleanerReactivator.dll\"",
        "displayName": "Potential CCleanerReactivator.DLL Sideloading",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\CCleanerReactivator.dll\" and (not((InitiatingProcessFolderPath endswith \"\\\\CCleanerReactivator.exe\" and (InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\CCleaner\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Program Files (x86)\\\\CCleaner\\\\\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
