name: Potential Antivirus Software DLL Sideloading
id: 552b6b65-df37-4d3e-a258-f2fc4771ae54
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
date: 2022/08/17
severity: medium
description: Detects potential DLL sideloading of DLLs that are part of antivirus
  software suchas McAfee, Symantec...etc
status: test
modified: 2023/03/13
logsource:
  category: image_load
  product: windows
tactics:
- defense_evasion
- persistence
- privilege_escalation
relevantTechniques:
- t1574.001
- t1574.002
query: 'DeviceImageLoadEvents

  | where (FolderPath endswith "\\log.dll" and (not(((FolderPath startswith "C:\\Program
  Files\\Bitdefender Antivirus Free\\" or FolderPath startswith "C:\\Program Files
  (x86)\\Bitdefender Antivirus Free\\") or FolderPath startswith "C:\\Program Files\\Canon\\MyPrinter\\"
  or (InitiatingProcessFolderPath =~ "C:\\Program Files\\Dell\\SARemediation\\audit\\TelemetryUtility.exe"
  and (FolderPath in~ ("C:\\Program Files\\Dell\\SARemediation\\plugin\\log.dll",
  "C:\\Program Files\\Dell\\SARemediation\\audit\\log.dll"))))))) or (FolderPath endswith
  "\\qrt.dll" and (not((FolderPath startswith "C:\\Program Files\\F-Secure\\Anti-Virus\\"
  or FolderPath startswith "C:\\Program Files (x86)\\F-Secure\\Anti-Virus\\")))) or
  ((FolderPath endswith "\\ashldres.dll" or FolderPath endswith "\\lockdown.dll" or
  FolderPath endswith "\\vsodscpl.dll") and (not((FolderPath startswith "C:\\Program
  Files\\McAfee\\" or FolderPath startswith "C:\\Program Files (x86)\\McAfee\\"))))
  or (FolderPath endswith "\\vftrace.dll" and (not((FolderPath startswith "C:\\Program
  Files\\CyberArk\\Endpoint Privilege Manager\\Agent\\x32\\" or FolderPath startswith
  "C:\\Program Files (x86)\\CyberArk\\Endpoint Privilege Manager\\Agent\\x32\\"))))
  or (FolderPath endswith "\\wsc.dll" and (not((FolderPath startswith "C:\\program
  Files\\AVAST Software\\Avast\\" or FolderPath startswith "C:\\program Files (x86)\\AVAST
  Software\\Avast\\")))) or (FolderPath endswith "\\tmdbglog.dll" and (not((FolderPath
  startswith "C:\\program Files\\Trend Micro\\Titanium\\" or FolderPath startswith
  "C:\\program Files (x86)\\Trend Micro\\Titanium\\")))) or (FolderPath endswith "\\DLPPREM32.dll"
  and (not((FolderPath startswith "C:\\program Files\\ESET" or FolderPath startswith
  "C:\\program Files (x86)\\ESET"))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
