{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/47147b5b-9e17-4d76-b8d2-7bac24c5ce1b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/47147b5b-9e17-4d76-b8d2-7bac24c5ce1b')]",
      "properties": {
        "alertRuleTemplateName": "47147b5b-9e17-4d76-b8d2-7bac24c5ce1b",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/12/23",
        "description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser.\nWeb browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future.\nWeb browsers typically store the credentials in an encrypted format within a credential store.\n",
        "displayName": "Potential Browser Data Stealing",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/08/29",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"copy-item\" or ProcessCommandLine contains \"copy \" or ProcessCommandLine contains \"cpi \" or ProcessCommandLine contains \" cp \" or ProcessCommandLine contains \"move \" or ProcessCommandLine contains \"move-item\" or ProcessCommandLine contains \" mi \" or ProcessCommandLine contains \" mv \") or (FolderPath endswith \"\\\\xcopy.exe\" or FolderPath endswith \"\\\\robocopy.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"XCOPY.EXE\", \"robocopy.exe\"))) and (ProcessCommandLine contains \"\\\\Amigo\\\\User Data\" or ProcessCommandLine contains \"\\\\BraveSoftware\\\\Brave-Browser\\\\User Data\" or ProcessCommandLine contains \"\\\\CentBrowser\\\\User Data\" or ProcessCommandLine contains \"\\\\Chromium\\\\User Data\" or ProcessCommandLine contains \"\\\\CocCoc\\\\Browser\\\\User Data\" or ProcessCommandLine contains \"\\\\Comodo\\\\Dragon\\\\User Data\" or ProcessCommandLine contains \"\\\\Elements Browser\\\\User Data\" or ProcessCommandLine contains \"\\\\Epic Privacy Browser\\\\User Data\" or ProcessCommandLine contains \"\\\\Google\\\\Chrome Beta\\\\User Data\" or ProcessCommandLine contains \"\\\\Google\\\\Chrome SxS\\\\User Data\" or ProcessCommandLine contains \"\\\\Google\\\\Chrome\\\\User Data\\\\\" or ProcessCommandLine contains \"\\\\Kometa\\\\User Data\" or ProcessCommandLine contains \"\\\\Maxthon5\\\\Users\" or ProcessCommandLine contains \"\\\\Microsoft\\\\Edge\\\\User Data\" or ProcessCommandLine contains \"\\\\Mozilla\\\\Firefox\\\\Profiles\" or ProcessCommandLine contains \"\\\\Nichrome\\\\User Data\" or ProcessCommandLine contains \"\\\\Opera Software\\\\Opera GX Stable\\\\\" or ProcessCommandLine contains \"\\\\Opera Software\\\\Opera Neon\\\\User Data\" or ProcessCommandLine contains \"\\\\Opera Software\\\\Opera Stable\\\\\" or ProcessCommandLine contains \"\\\\Orbitum\\\\User Data\" or ProcessCommandLine contains \"\\\\QIP Surf\\\\User Data\" or ProcessCommandLine contains \"\\\\Sputnik\\\\User Data\" or ProcessCommandLine contains \"\\\\Torch\\\\User Data\" or ProcessCommandLine contains \"\\\\uCozMedia\\\\Uran\\\\User Data\" or ProcessCommandLine contains \"\\\\Vivaldi\\\\User Data\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1555"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
