name: Potential DLL File Download Via PowerShell Invoke-WebRequest
id: 0f0450f3-8b47-441e-a31b-15a91dc243e2
author: Florian Roth (Nextron Systems), Hieu Tran
date: 2023-03-13
severity: medium
description: Detects potential DLL files being downloaded using the PowerShell Invoke-WebRequest
  cmdlet
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- Command-and-control
- Execution
relevantTechniques:
- T1059
- T1105
query: 'DeviceProcessEvents

  | where (ProcessCommandLine contains "Invoke-WebRequest " or ProcessCommandLine
  contains "IWR ") and (ProcessCommandLine contains "http" and ProcessCommandLine
  contains "OutFile" and ProcessCommandLine contains ".dll")'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
