{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d2eb17db-1d39-41dc-b57f-301f6512fa75')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d2eb17db-1d39-41dc-b57f-301f6512fa75')]",
      "properties": {
        "alertRuleTemplateName": "d2eb17db-1d39-41dc-b57f-301f6512fa75",
        "author": "@SerkinValery",
        "customDetails": null,
        "date": "2022/09/16",
        "description": "Detects a commandline containing references to the Microsoft Teams database or cookies files from a process other than Teams.\nThe database might contain authentication tokens and other sensitive information about the logged in accounts.\n",
        "displayName": "Potentially Suspicious Command Targeting Teams Sensitive Files",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/18",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"\\\\Microsoft\\\\Teams\\\\Cookies\" or ProcessCommandLine contains \"\\\\Microsoft\\\\Teams\\\\Local Storage\\\\leveldb\") and (not(FolderPath endswith \"\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1528"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
