name: Potential PsExec Remote Execution
id: ea011323-7045-460b-b2d7-0f7442ea6b38
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/28
severity: high
description: Detects potential psexec command that initiate execution on a remote
  systems via common commandline flags used by the utility
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- resource_development
relevantTechniques:
- t1587.001
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains "accepteula" and ProcessCommandLine contains
  " -u " and ProcessCommandLine contains " -p " and ProcessCommandLine contains "
  \\\\"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
