name: Potential SolidPDFCreator.DLL Sideloading
id: a2edbce1-95c8-4291-8676-0d45146862b3
author: X__Junior (Nextron Systems)
date: 2023/05/07
level: medium
description: Detects potential DLL sideloading of "SolidPDFCreator.dll"
status: test
modified: ''
logsource:
  category: image_load
  product: windows
tactics:
- defense_evasion
- privilege_escalation
relevantTechniques:
- t1574.001
- t1574.002
query: 'DeviceImageLoadEvents

  | where FolderPath endswith "\\SolidPDFCreator.dll" and (not(((FolderPath startswith
  "C:\\Program Files (x86)\\SolidDocuments\\SolidPDFCreator\\" or FolderPath startswith
  "C:\\Program Files\\SolidDocuments\\SolidPDFCreator\\") and InitiatingProcessFolderPath
  endswith "\\SolidPDFCreator.exe")))'
