{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1af57a4b-460a-4738-9034-db68b880c665')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1af57a4b-460a-4738-9034-db68b880c665')]",
      "properties": {
        "alertRuleTemplateName": "1af57a4b-460a-4738-9034-db68b880c665",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/07/29",
        "description": "Detects suspicious PowerShell scripts accessing SAM hives",
        "displayName": "PowerShell SAM Copy",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/06",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"\\\\HarddiskVolumeShadowCopy\" and ProcessCommandLine contains \"System32\\\\config\\\\sam\") and (ProcessCommandLine contains \"Copy-Item\" or ProcessCommandLine contains \"cp $_.\" or ProcessCommandLine contains \"cpi $_.\" or ProcessCommandLine contains \"copy $_.\" or ProcessCommandLine contains \".File]::Copy(\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
