name: Powershell Token Obfuscation - Process Creation
id: deb9b646-a508-44ee-b7c9-d8965921c6b6
author: frack113
date: 2022-12-27
severity: high
description: Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation
status: test
modified: 2024-08-11
logsource:
  category: process_creation
  product: windows
tactics:
- Defense-evasion
relevantTechniques:
- T1027
query: 'DeviceProcessEvents

  | where (ProcessCommandLine matches regex "\\w+`(\\w+|-|.)`[\\w+|\\s]" or ProcessCommandLine
  matches regex ""(\\{\\d\\})+"\\s*-f" or ProcessCommandLine matches regex "(?i)\\$\\{`?e`?n`?v`?:`?p`?a`?t`?h`?\\}")
  and (not(ProcessCommandLine contains "${env:path}"))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
