{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c')]",
      "properties": {
        "alertRuleTemplateName": "fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2019/08/24",
        "description": "Detects usage of a base64 encoded \"FromBase64String\" cmdlet in a process command line",
        "displayName": "PowerShell Base64 Encoded FromBase64String Cmdlet",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/04/06",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"OjpGcm9tQmFzZTY0U3RyaW5n\" or ProcessCommandLine contains \"o6RnJvbUJhc2U2NFN0cmluZ\" or ProcessCommandLine contains \"6OkZyb21CYXNlNjRTdHJpbm\" or (ProcessCommandLine contains \"OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA\" or ProcessCommandLine contains \"oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA\" or ProcessCommandLine contains \"6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059",
          "t1140"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
