{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9bd04a79-dabe-4f1f-a5ff-92430265c96b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9bd04a79-dabe-4f1f-a5ff-92430265c96b')]",
      "properties": {
        "alertRuleTemplateName": "9bd04a79-dabe-4f1f-a5ff-92430265c96b",
        "author": "Tim Rauch, Elastic (idea)",
        "customDetails": null,
        "date": "2022/09/27",
        "description": "Detects a remote file copy attempt to a hidden network share. This may indicate lateral movement or data staging activity.",
        "displayName": "Privilege Escalation via Named Pipe Impersonation",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/30",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"echo\" and ProcessCommandLine contains \">\" and ProcessCommandLine contains \"\\\\\\\\.\\\\pipe\\\\\") and ((FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\powershell.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"Cmd.Exe\", \"PowerShell.EXE\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1021"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
