{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4c0aaedc-154c-4427-ada0-d80ef9c9deb6')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4c0aaedc-154c-4427-ada0-d80ef9c9deb6')]",
      "properties": {
        "alertRuleTemplateName": "4c0aaedc-154c-4427-ada0-d80ef9c9deb6",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/02/10",
        "description": "Detects a possible process memory dump that uses the white-listed Citrix TrolleyExpress.exe filename as a way to dump the lsass process memory",
        "displayName": "Process Access via TrolleyExpress Exclusion",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/05/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"\\\\TrolleyExpress 7\" or ProcessCommandLine contains \"\\\\TrolleyExpress 8\" or ProcessCommandLine contains \"\\\\TrolleyExpress 9\" or ProcessCommandLine contains \"\\\\TrolleyExpress.exe 7\" or ProcessCommandLine contains \"\\\\TrolleyExpress.exe 8\" or ProcessCommandLine contains \"\\\\TrolleyExpress.exe 9\" or ProcessCommandLine contains \"\\\\TrolleyExpress.exe -ma \") or (FolderPath endswith \"\\\\TrolleyExpress.exe\" and (not((isnull(ProcessVersionInfoOriginalFileName) or ProcessVersionInfoOriginalFileName contains \"CtxInstall\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003",
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
