{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/edadb1e5-5919-4e4c-8462-a9e643b02c4b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/edadb1e5-5919-4e4c-8462-a9e643b02c4b')]",
      "properties": {
        "alertRuleTemplateName": "edadb1e5-5919-4e4c-8462-a9e643b02c4b",
        "author": "Cedric MAURUGEON, Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2021/09/24",
        "description": "Detects the use of the Microsoft Windows Resource Leak Diagnostic tool \"rdrleakdiag.exe\" to dump process memory",
        "displayName": "Process Memory Dump via RdrLeakDiag.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/04/24",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"fullmemdmp\" or ProcessCommandLine contains \"/memdmp\" or ProcessCommandLine contains \"-memdmp\") and (ProcessCommandLine contains \" -o \" or ProcessCommandLine contains \" /o \") and (ProcessCommandLine contains \" -p \" or ProcessCommandLine contains \" /p \")) or ((FolderPath endswith \"\\\\rdrleakdiag.exe\" or ProcessVersionInfoOriginalFileName =~ \"RdrLeakDiag.exe\") and (ProcessCommandLine contains \"fullmemdmp\" or ProcessCommandLine contains \"/memdmp\" or ProcessCommandLine contains \"-memdmp\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
