{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/3c1b5fb0-c72f-45ba-abd1-4d4c353144ab')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/3c1b5fb0-c72f-45ba-abd1-4d4c353144ab')]",
      "properties": {
        "alertRuleTemplateName": "3c1b5fb0-c72f-45ba-abd1-4d4c353144ab",
        "author": "Max Altgelt (Nextron Systems)",
        "customDetails": null,
        "date": "2022/08/23",
        "description": "Detects process creation events that use the Sysnative folder (common for CobaltStrike spawns)",
        "displayName": "Process Creation Using Sysnative Folder",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/14",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \":\\\\Windows\\\\Sysnative\\\\\" or FolderPath contains \":\\\\Windows\\\\Sysnative\\\\\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1055"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
