{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8b0e12da-d3c3-49db-bb4f-256703f380e5')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8b0e12da-d3c3-49db-bb4f-256703f380e5')]",
      "properties": {
        "alertRuleTemplateName": "8b0e12da-d3c3-49db-bb4f-256703f380e5",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/13",
        "description": "Detects usage of the Chisel tunneling tool via the commandline arguments",
        "displayName": "PUA - Chisel Tunneling Tool Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/13",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\chisel.exe\" or ((ProcessCommandLine contains \"exe client \" or ProcessCommandLine contains \"exe server \") and (ProcessCommandLine contains \"-socks5\" or ProcessCommandLine contains \"-reverse\" or ProcessCommandLine contains \" r:\" or ProcessCommandLine contains \":127.0.0.1:\" or ProcessCommandLine contains \"-tls-skip-verify \" or ProcessCommandLine contains \":socks\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1090"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
