name: PUA - CsExec Execution
id: d08a2711-ee8b-4323-bdec-b7d85e892b31
author: Florian Roth (Nextron Systems)
date: 2022/08/22
severity: high
description: Detects the use of the lesser known remote execution tool named CsExec
  a PsExec alternative
status: test
modified: 2023/02/21
logsource:
  category: process_creation
  product: windows
tactics:
- Execution
- Resource Development
relevantTechniques:
- T1569
- T1587
query: 'DeviceProcessEvents

  | where FolderPath endswith "\\csexec.exe" or ProcessVersionInfoFileDescription
  =~ "csexec"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
