name: Pubprn.vbs Proxy Execution
id: 1fb76ab8-fa60-4b01-bddd-71e89bf555da
author: frack113
date: 2022/05/28
level: medium
description: Detects the use of the 'Pubprn.vbs' Microsoft signed script to execute
  commands.
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1216.001
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains "\\pubprn.vbs" and ProcessCommandLine contains
  "script:"'
