{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/faa48cae-6b25-4f00-a094-08947fef582f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/faa48cae-6b25-4f00-a094-08947fef582f')]",
      "properties": {
        "alertRuleTemplateName": "faa48cae-6b25-4f00-a094-08947fef582f",
        "author": "@ROxPinTeddy",
        "customDetails": null,
        "date": "2020/05/12",
        "description": "Detects the use of rar.exe, on the command line, to create an archive with password protection or with a specific compression level. This is pretty indicative of malicious actions.",
        "displayName": "Rar Usage with Password and Compression Level",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/03/16",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" -hp\" and (ProcessCommandLine contains \" -m\" or ProcessCommandLine contains \" a \")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "collection"
        ],
        "techniques": [
          "t1560"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
