name: Rar Usage with Password and Compression Level
id: faa48cae-6b25-4f00-a094-08947fef582f
author: '@ROxPinTeddy'
date: 2020/05/12
level: high
description: Detects the use of rar.exe, on the command line, to create an archive
  with password protection or with a specific compression level. This is pretty indicative
  of malicious actions.
status: test
modified: 2022/03/16
logsource:
  category: process_creation
  product: windows
tactics:
- collection
relevantTechniques:
- t1560.001
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains " -hp" and (ProcessCommandLine contains " -m"
  or ProcessCommandLine contains " a ")'
