name: Recon Command Output Piped To Findstr.EXE
id: ccb5742c-c248-4982-8c5c-5571b9275ad3
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2023/07/06
severity: medium
description: 'Detects the execution of a potential recon command where the results
  are piped to "findstr". This is meant to trigger on inline calls of "cmd.exe" via
  the "/c" or "/k" for example.

  Attackers often time use this technique to extract specific information they require
  in their reconnaissance phase.

  '
status: experimental
modified: 2024/06/27
logsource:
  category: process_creation
  product: windows
tactics:
- Discovery
relevantTechniques:
- T1057
query: 'DeviceProcessEvents

  | where (ProcessCommandLine contains "ipconfig" and ProcessCommandLine contains
  "|" and ProcessCommandLine contains "find") or (ProcessCommandLine contains "net"
  and ProcessCommandLine contains "|" and ProcessCommandLine contains "find") or (ProcessCommandLine
  contains "netstat" and ProcessCommandLine contains "|" and ProcessCommandLine contains
  "find") or (ProcessCommandLine contains "ping" and ProcessCommandLine contains "|"
  and ProcessCommandLine contains "find") or (ProcessCommandLine contains "systeminfo"
  and ProcessCommandLine contains "|" and ProcessCommandLine contains "find") or (ProcessCommandLine
  contains "tasklist" and ProcessCommandLine contains "|" and ProcessCommandLine contains
  "find") or (ProcessCommandLine contains "whoami" and ProcessCommandLine contains
  "|" and ProcessCommandLine contains "find")'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
