name: Regsvr32 Execution From Highly Suspicious Location
id: 327ff235-94eb-4f06-b9de-aaee571324be
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/26
severity: high
description: Detects execution of regsvr32 where the DLL is located in a highly suspicious
  locations
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1218.010
query: 'DeviceProcessEvents

  | where (FolderPath endswith "\\regsvr32.exe" or ProcessVersionInfoOriginalFileName
  =~ "REGSVR32.EXE") and ((ProcessCommandLine contains ":\\PerfLogs\\" or ProcessCommandLine
  contains ":\\Temp\\" or ProcessCommandLine contains "\\Windows\\Registration\\CRMLog"
  or ProcessCommandLine contains "\\Windows\\System32\\com\\dmp\\" or ProcessCommandLine
  contains "\\Windows\\System32\\FxsTmp\\" or ProcessCommandLine contains "\\Windows\\System32\\Microsoft\\Crypto\\RSA\\MachineKeys\\"
  or ProcessCommandLine contains "\\Windows\\System32\\spool\\drivers\\color\\" or
  ProcessCommandLine contains "\\Windows\\System32\\spool\\PRINTERS\\" or ProcessCommandLine
  contains "\\Windows\\System32\\spool\\SERVERS\\" or ProcessCommandLine contains
  "\\Windows\\System32\\Tasks_Migrated\\" or ProcessCommandLine contains "\\Windows\\System32\\Tasks\\Microsoft\\Windows\\SyncCenter\\"
  or ProcessCommandLine contains "\\Windows\\SysWOW64\\com\\dmp\\" or ProcessCommandLine
  contains "\\Windows\\SysWOW64\\FxsTmp\\" or ProcessCommandLine contains "\\Windows\\SysWOW64\\Tasks\\Microsoft\\Windows\\PLA\\System\\"
  or ProcessCommandLine contains "\\Windows\\SysWOW64\\Tasks\\Microsoft\\Windows\\SyncCenter\\"
  or ProcessCommandLine contains "\\Windows\\Tasks\\" or ProcessCommandLine contains
  "\\Windows\\Tracing\\") or ((ProcessCommandLine contains " \"C:\\" or ProcessCommandLine
  contains " C:\\" or ProcessCommandLine contains " ''C:\\" or ProcessCommandLine
  contains "D:\\") and (not((ProcessCommandLine contains "C:\\Program Files (x86)\\"
  or ProcessCommandLine contains "C:\\Program Files\\" or ProcessCommandLine contains
  "C:\\ProgramData\\" or ProcessCommandLine contains "C:\\Users\\" or ProcessCommandLine
  contains " C:\\Windows\\" or ProcessCommandLine contains " \"C:\\Windows\\" or ProcessCommandLine
  contains " ''C:\\Windows\\"))))) and (not((ProcessCommandLine =~ "" or isnull(ProcessCommandLine))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
