name: Remote Access Tool - NetSupport Execution
id: 758ff488-18d5-4cbe-8ec4-02b6285a434f
author: frack113
date: 2022/09/25
level: medium
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)

  '
status: test
modified: 2023/03/06
logsource:
  category: process_creation
  product: windows
tactics:
- command_and_control
relevantTechniques:
- t1219
query: 'DeviceProcessEvents

  | where ProcessVersionInfoFileDescription =~ "NetSupport Client Configurator" or
  ProcessVersionInfoProductName =~ "NetSupport Remote Control" or ProcessVersionInfoCompanyName
  =~ "NetSupport Ltd" or ProcessVersionInfoOriginalFileName =~ "PCICFGUI.EXE"'
