name: Remote Access Tool - AnyDesk Incoming Connection
id: d58ba5c6-0ed7-4b9d-a433-6878379efda9
author: '@d4ns4n_ (Wuerth-Phoenix)'
date: 2024-09-02
severity: medium
description: 'Detects incoming connections to AnyDesk. This could indicate a potential
  remote attacker trying to connect to a listening instance of AnyDesk and use it
  as potential command and control channel.

  '
status: experimental
modified: ''
logsource:
  category: network_connection
  product: windows
tactics:
- Command-and-control
- Persistence
relevantTechniques:
- T1219
query: 'DeviceNetworkEvents

  | where InitiatingProcessFolderPath endswith "\\AnyDesk.exe"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
