name: Remote Access Tool - Simple Help Execution
id: 95e60a2b-4705-444b-b7da-ba0ea81a3ee2
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/02/23
level: medium
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)

  '
status: experimental
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- command_and_control
relevantTechniques:
- t1219
query: 'DeviceProcessEvents

  | where (FolderPath contains "\\JWrapper-Remote Access\\" or FolderPath contains
  "\\JWrapper-Remote Support\\") and FolderPath endswith "\\SimpleService.exe"'
