name: Remote Access Tool - AnyDesk Piped Password Via CLI
id: b1377339-fda6-477a-b455-ac0923f9ec2c
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/28
level: medium
description: Detects piping the password to an anydesk instance via CMD and the '--set-password'
  flag.
status: test
modified: 2023/03/05
logsource:
  category: process_creation
  product: windows
tactics:
- command_and_control
relevantTechniques:
- t1219
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains "/c " and ProcessCommandLine contains "echo
  " and ProcessCommandLine contains ".exe --set-password"'
