{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0f16d9cf-0616-45c8-8fad-becc11b5a41c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0f16d9cf-0616-45c8-8fad-becc11b5a41c')]",
      "properties": {
        "alertRuleTemplateName": "0f16d9cf-0616-45c8-8fad-becc11b5a41c",
        "author": "Nasreddine Bencherchali",
        "customDetails": null,
        "date": "2023/02/07",
        "description": "Detects execution of a renamed autohotkey.exe binary based on PE metadata fields",
        "displayName": "Renamed AutoHotkey.EXE Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessVersionInfoProductName contains \"AutoHotkey\" or ProcessVersionInfoFileDescription contains \"AutoHotkey\" or (ProcessVersionInfoOriginalFileName in~ (\"AutoHotkey.exe\", \"AutoHotkey.rc\"))) and (not(((FolderPath endswith \"\\\\AutoHotkey.exe\" or FolderPath endswith \"\\\\AutoHotkey32.exe\" or FolderPath endswith \"\\\\AutoHotkey32_UIA.exe\" or FolderPath endswith \"\\\\AutoHotkey64.exe\" or FolderPath endswith \"\\\\AutoHotkey64_UIA.exe\" or FolderPath endswith \"\\\\AutoHotkeyA32.exe\" or FolderPath endswith \"\\\\AutoHotkeyA32_UIA.exe\" or FolderPath endswith \"\\\\AutoHotkeyU32.exe\" or FolderPath endswith \"\\\\AutoHotkeyU32_UIA.exe\" or FolderPath endswith \"\\\\AutoHotkeyU64.exe\" or FolderPath endswith \"\\\\AutoHotkeyU64_UIA.exe\") or FolderPath contains \"\\\\AutoHotkey\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
