name: Scheduled Task Executing Encoded Payload from Registry
id: c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78
author: pH-T (Nextron Systems), @Kostastsale, @TheDFIRReport, X__Junior (Nextron Systems),
  Nasreddine Bencherchali (Nextron Systems)
date: 2022/02/12
severity: high
description: Detects the creation of a schtask that potentially executes a base64
  encoded payload stored in the Windows Registry using PowerShell.
status: test
modified: 2023/02/04
logsource:
  category: process_creation
  product: windows
tactics:
- execution
- persistence
relevantTechniques:
- t1053.005
- t1059.001
query: 'DeviceProcessEvents

  | where ProcessCommandLine contains "/Create" and (ProcessCommandLine contains "FromBase64String"
  or ProcessCommandLine contains "encodedcommand") and (ProcessCommandLine contains
  "Get-ItemProperty" or ProcessCommandLine contains " gp ") and (ProcessCommandLine
  contains "HKCU:" or ProcessCommandLine contains "HKLM:" or ProcessCommandLine contains
  "registry::" or ProcessCommandLine contains "HKEY_") and (FolderPath endswith "\\schtasks.exe"
  or ProcessVersionInfoOriginalFileName =~ "schtasks.exe")'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
