name: Scheduled TaskCache Change by Uncommon Program
id: 4720b7df-40c3-48fd-bbdf-fd4b3c464f0d
author: Syed Hasan (@syedhasan009)
date: 2021/06/18
severity: high
description: Monitor the creation of a new key under 'TaskCache' when a new scheduled
  task is registered by a process that is not svchost.exe, which is suspicious
status: experimental
modified: 2023/08/17
logsource:
  category: registry_set
  product: windows
tactics:
- Persistence
relevantTechniques:
- T1053
query: 'DeviceRegistryEvents

  | where RegistryKey contains "SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Schedule\\TaskCache"
  and (not(((RegistryKey contains "Microsoft\\Windows\\UpdateOrchestrator" or RegistryKey
  contains "Microsoft\\Windows\\SoftwareProtectionPlatform\\SvcRestartTask\\Index"
  or RegistryKey contains "Microsoft\\Windows\\Flighting\\OneSettings\\RefreshCache\\Index")
  or (InitiatingProcessFolderPath in~ ("C:\\Program Files (x86)\\Dropbox\\Update\\DropboxUpdate.exe",
  "C:\\Program Files\\Dropbox\\Update\\DropboxUpdate.exe")) or (InitiatingProcessFolderPath
  =~ "C:\\Windows\\explorer.exe" and RegistryKey contains "\\Microsoft\\Windows NT\\CurrentVersion\\Schedule\\TaskCache\\Tree\\Microsoft\\Windows\\PLA\\Server
  Manager Performance Monitor") or InitiatingProcessFolderPath =~ "C:\\Windows\\System32\\msiexec.exe"
  or (InitiatingProcessFolderPath endswith "\\ngen.exe" and InitiatingProcessFolderPath
  startswith "C:\\Windows\\Microsoft.NET\\Framework" and (RegistryKey contains "\\Microsoft\\Windows
  NT\\CurrentVersion\\Schedule\\TaskCache\\Tasks\\{B66B135D-DA06-4FC4-95F8-7458E1D10129}"
  or RegistryKey contains "\\Microsoft\\Windows NT\\CurrentVersion\\Schedule\\TaskCache\\Tree\\Microsoft\\Windows\\.NET
  Framework\\.NET Framework NGEN")) or (InitiatingProcessFolderPath in~ ("C:\\Program
  Files\\Microsoft Office\\root\\Integration\\Integrator.exe", "C:\\Program Files
  (x86)\\Microsoft Office\\root\\Integration\\Integrator.exe")) or InitiatingProcessFolderPath
  =~ "C:\\WINDOWS\\system32\\svchost.exe" or InitiatingProcessFolderPath =~ "System"
  or (InitiatingProcessFolderPath endswith "\\TiWorker.exe" and InitiatingProcessFolderPath
  startswith "C:\\Windows\\"))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
