{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b0524451-19af-4efa-a46f-562a977f792e')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b0524451-19af-4efa-a46f-562a977f792e')]",
      "properties": {
        "alertRuleTemplateName": "b0524451-19af-4efa-a46f-562a977f792e",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/02/01",
        "description": "Detects actions that clear the local ShimCache and remove forensic evidence",
        "displayName": "ShimCache Flush",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"rundll32\" and ProcessCommandLine contains \"apphelp.dll\") and (ProcessCommandLine contains \"ShimFlushCache\" or ProcessCommandLine contains \"#250\")) or ((ProcessCommandLine contains \"rundll32\" and ProcessCommandLine contains \"kernel32.dll\") and (ProcessCommandLine contains \"BaseFlushAppcompatCache\" or ProcessCommandLine contains \"#46\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "stable",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1112"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
