name: Suspicious IIS URL GlobalRules Rewrite Via AppCmd
id: 7c8af9b2-dcae-41a2-a9db-b28c288b5f08
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/22
level: medium
description: Detects usage of "appcmd" to create new global URL rewrite rules. This
  behaviour has been observed being used by threat actors to add new rules so they
  can access their webshells.
status: test
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques: []
query: 'DeviceProcessEvents

  | where (ProcessCommandLine contains "set" and ProcessCommandLine contains "config"
  and ProcessCommandLine contains "section:system.webServer/rewrite/globalRules" and
  ProcessCommandLine contains "commit:") and (FolderPath endswith "\\appcmd.exe" or
  ProcessVersionInfoOriginalFileName =~ "appcmd.exe")'
