{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8202070f-edeb-4d31-a010-a26c72ac5600')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8202070f-edeb-4d31-a010-a26c72ac5600')]",
      "properties": {
        "alertRuleTemplateName": "8202070f-edeb-4d31-a010-a26c72ac5600",
        "author": "Thomas Patzke, Florian Roth (Nextron Systems), Zach Stanford @svch0st, Tim Shelton, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2019/01/16",
        "description": "Detects potentially suspicious processes being spawned by a web server process which could be the result of a successfully placed web shell or exploitation\n",
        "displayName": "Suspicious Process By Web Server Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/11",
        "query": "DeviceProcessEvents\n| where (((InitiatingProcessFolderPath contains \"-tomcat-\" or InitiatingProcessFolderPath contains \"\\\\tomcat\") and (InitiatingProcessFolderPath endswith \"\\\\java.exe\" or InitiatingProcessFolderPath endswith \"\\\\javaw.exe\")) or ((InitiatingProcessCommandLine contains \"CATALINA_HOME\" or InitiatingProcessCommandLine contains \"catalina.home\" or InitiatingProcessCommandLine contains \"catalina.jar\") and (InitiatingProcessFolderPath endswith \"\\\\java.exe\" or InitiatingProcessFolderPath endswith \"\\\\javaw.exe\")) or (InitiatingProcessFolderPath endswith \"\\\\caddy.exe\" or InitiatingProcessFolderPath endswith \"\\\\httpd.exe\" or InitiatingProcessFolderPath endswith \"\\\\nginx.exe\" or InitiatingProcessFolderPath endswith \"\\\\php-cgi.exe\" or InitiatingProcessFolderPath endswith \"\\\\php.exe\" or InitiatingProcessFolderPath endswith \"\\\\tomcat.exe\" or InitiatingProcessFolderPath endswith \"\\\\UMWorkerProcess.exe\" or InitiatingProcessFolderPath endswith \"\\\\w3wp.exe\" or InitiatingProcessFolderPath endswith \"\\\\ws_TomcatService.exe\")) and (FolderPath endswith \"\\\\arp.exe\" or FolderPath endswith \"\\\\at.exe\" or FolderPath endswith \"\\\\bash.exe\" or FolderPath endswith \"\\\\bitsadmin.exe\" or FolderPath endswith \"\\\\certutil.exe\" or FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\dsget.exe\" or FolderPath endswith \"\\\\hostname.exe\" or FolderPath endswith \"\\\\nbtstat.exe\" or FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\net1.exe\" or FolderPath endswith \"\\\\netdom.exe\" or FolderPath endswith \"\\\\netsh.exe\" or FolderPath endswith \"\\\\nltest.exe\" or FolderPath endswith \"\\\\ntdutil.exe\" or FolderPath endswith \"\\\\powershell_ise.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\qprocess.exe\" or FolderPath endswith \"\\\\query.exe\" or FolderPath endswith \"\\\\qwinsta.exe\" or FolderPath endswith \"\\\\reg.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\sc.exe\" or FolderPath endswith \"\\\\sh.exe\" or FolderPath endswith \"\\\\wmic.exe\" or FolderPath endswith \"\\\\wscript.exe\" or FolderPath endswith \"\\\\wusa.exe\") and (not(((ProcessCommandLine endswith \"Windows\\\\system32\\\\cmd.exe /c C:\\\\ManageEngine\\\\ADManager \\\"Plus\\\\ES\\\\bin\\\\elasticsearch.bat -Enode.name=RMP-NODE1 -pelasticsearch-pid.txt\" and InitiatingProcessFolderPath endswith \"\\\\java.exe\") or ((ProcessCommandLine contains \"sc query\" and ProcessCommandLine contains \"ADManager Plus\") and InitiatingProcessFolderPath endswith \"\\\\java.exe\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1190",
          "t1505"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
