name: Suspicious File Creation Activity From Fake Recycle.Bin Folder
id: cd8b36ac-8e4a-4c2f-a402-a29b8fbd5bca
author: X__Junior (Nextron Systems)
date: 2023/07/12
severity: high
description: Detects file write event from/to a fake recycle bin folder that is often
  used as a staging directory for malware
status: experimental
modified: 2023/12/11
logsource:
  category: file_event
  product: windows
tactics:
- Defense Evasion
- Persistence
relevantTechniques: []
query: 'DeviceFileEvents

  | where (InitiatingProcessFolderPath contains "RECYCLERS.BIN\\" or InitiatingProcessFolderPath
  contains "RECYCLER.BIN\\") or (FolderPath contains "RECYCLERS.BIN\\" or FolderPath
  contains "RECYCLER.BIN\\")'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
