{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/043c4b8b-3a54-4780-9682-081cb6b8185c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/043c4b8b-3a54-4780-9682-081cb6b8185c')]",
      "properties": {
        "alertRuleTemplateName": "043c4b8b-3a54-4780-9682-081cb6b8185c",
        "author": "Florian Roth (Nextron Systems), Microsoft (idea)",
        "customDetails": null,
        "date": "2022/08/04",
        "description": "Detects a suspicious IIS module registration as described in Microsoft threat report on IIS backdoors",
        "displayName": "Suspicious IIS Module Registration",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/23",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\w3wp.exe\" and (ProcessCommandLine contains \"appcmd.exe add module\" or (ProcessCommandLine contains \" system.enterpriseservices.internal.publish\" and FolderPath endswith \"\\\\powershell.exe\") or (ProcessCommandLine contains \"gacutil\" and ProcessCommandLine contains \" /I\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1505"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
