name: Suspicious Outlook Child Process
id: 208748f7-881d-47ac-a29c-07ea84bf691d
author: Michael Haag, Florian Roth (Nextron Systems), Markus Neis, Elastic, FPT.EagleEye
  Team
date: 2022/02/28
severity: high
description: Detects a suspicious process spawning from an Outlook process.
status: test
modified: 2023/02/04
logsource:
  category: process_creation
  product: windows
tactics:
- execution
relevantTechniques:
- t1204.002
query: 'DeviceProcessEvents

  | where (FolderPath endswith "\\AppVLP.exe" or FolderPath endswith "\\bash.exe"
  or FolderPath endswith "\\cmd.exe" or FolderPath endswith "\\cscript.exe" or FolderPath
  endswith "\\forfiles.exe" or FolderPath endswith "\\hh.exe" or FolderPath endswith
  "\\mftrace.exe" or FolderPath endswith "\\msbuild.exe" or FolderPath endswith "\\msdt.exe"
  or FolderPath endswith "\\mshta.exe" or FolderPath endswith "\\msiexec.exe" or FolderPath
  endswith "\\powershell.exe" or FolderPath endswith "\\pwsh.exe" or FolderPath endswith
  "\\regsvr32.exe" or FolderPath endswith "\\schtasks.exe" or FolderPath endswith
  "\\scrcons.exe" or FolderPath endswith "\\scriptrunner.exe" or FolderPath endswith
  "\\sh.exe" or FolderPath endswith "\\svchost.exe" or FolderPath endswith "\\wmic.exe"
  or FolderPath endswith "\\wscript.exe") and InitiatingProcessFolderPath endswith
  "\\OUTLOOK.EXE"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
