name: Suspicious Program Location Whitelisted In Firewall Via Netsh.EXE
id: a35f5a72-f347-4e36-8895-9869b0d5fc6d
author: Sander Wiebing, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2020/05/25
level: high
description: Detects Netsh command execution that whitelists a program located in
  a suspicious location in the Windows Firewall
status: test
modified: 2023/12/11
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1562.004
query: 'DeviceProcessEvents

  | where ((ProcessCommandLine contains "firewall" and ProcessCommandLine contains
  "add" and ProcessCommandLine contains "allowedprogram") or (ProcessCommandLine contains
  "advfirewall" and ProcessCommandLine contains "firewall" and ProcessCommandLine
  contains "add" and ProcessCommandLine contains "rule" and ProcessCommandLine contains
  "action=allow" and ProcessCommandLine contains "program=")) and (FolderPath endswith
  "\\netsh.exe" or ProcessVersionInfoOriginalFileName =~ "netsh.exe") and (ProcessCommandLine
  contains ":\\$Recycle.bin\\" or ProcessCommandLine contains ":\\RECYCLER.BIN\\"
  or ProcessCommandLine contains ":\\RECYCLERS.BIN\\" or ProcessCommandLine contains
  ":\\SystemVolumeInformation\\" or ProcessCommandLine contains ":\\Temp\\" or ProcessCommandLine
  contains ":\\Users\\Default\\" or ProcessCommandLine contains ":\\Users\\Desktop\\"
  or ProcessCommandLine contains ":\\Users\\Public\\" or ProcessCommandLine contains
  ":\\Windows\\addins\\" or ProcessCommandLine contains ":\\Windows\\cursors\\" or
  ProcessCommandLine contains ":\\Windows\\debug\\" or ProcessCommandLine contains
  ":\\Windows\\drivers\\" or ProcessCommandLine contains ":\\Windows\\fonts\\" or
  ProcessCommandLine contains ":\\Windows\\help\\" or ProcessCommandLine contains
  ":\\Windows\\system32\\tasks\\" or ProcessCommandLine contains ":\\Windows\\Tasks\\"
  or ProcessCommandLine contains ":\\Windows\\Temp\\" or ProcessCommandLine contains
  "\\Downloads\\" or ProcessCommandLine contains "\\Local Settings\\Temporary Internet
  Files\\" or ProcessCommandLine contains "\\Temporary Internet Files\\Content.Outlook\\"
  or ProcessCommandLine contains "%Public%\\" or ProcessCommandLine contains "%TEMP%"
  or ProcessCommandLine contains "%TMP%")'
