name: Suspicious File Download From IP Via Wget.EXE - Paths
id: 40aa399c-7b02-4715-8e5f-73572b493f33
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/02/23
severity: high
description: Detects potentially suspicious file downloads directly from IP addresses
  and stored in suspicious locations using Wget.exe
status: experimental
modified: ''
logsource:
  category: process_creation
  product: windows
tactics:
- execution
relevantTechniques: []
query: 'DeviceProcessEvents

  | where (ProcessCommandLine matches regex "\\s-O\\s" or ProcessCommandLine contains
  "--output-document") and ProcessCommandLine contains "http" and (FolderPath endswith
  "\\wget.exe" or ProcessVersionInfoOriginalFileName =~ "wget.exe") and ProcessCommandLine
  matches regex "://[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}" and ((ProcessCommandLine
  contains ":\\PerfLogs\\" or ProcessCommandLine contains ":\\Temp\\" or ProcessCommandLine
  contains ":\\Users\\Public\\" or ProcessCommandLine contains ":\\Windows\\Help\\"
  or ProcessCommandLine contains ":\\Windows\\Temp\\" or ProcessCommandLine contains
  "\\Temporary Internet") or (ProcessCommandLine contains ":\\Users\\" and ProcessCommandLine
  contains "\\Favorites\\") or (ProcessCommandLine contains ":\\Users\\" and ProcessCommandLine
  contains "\\Favourites\\") or (ProcessCommandLine contains ":\\Users\\" and ProcessCommandLine
  contains "\\Contacts\\") or (ProcessCommandLine contains ":\\Users\\" and ProcessCommandLine
  contains "\\Pictures\\"))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
