name: Suspicious Response File Execution Via Odbcconf.EXE
id: 2d32dd6f-3196-4093-b9eb-1ad8ab088ca5
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/22
level: high
description: Detects execution of "odbcconf" with the "-f" flag in order to load a
  response file with a non-".rsp" extension.
status: experimental
modified: 2024/03/13
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1218.008
query: 'DeviceProcessEvents

  | where ((ProcessCommandLine contains " -f " or ProcessCommandLine contains " /f
  ") and (FolderPath endswith "\\odbcconf.exe" or ProcessVersionInfoOriginalFileName
  =~ "odbcconf.exe")) and (not((ProcessCommandLine contains ".rsp" or (ProcessCommandLine
  contains ".exe /E /F \"C:\\WINDOWS\\system32\\odbcconf.tmp\"" and FolderPath =~
  "C:\\Windows\\System32\\odbcconf.exe" and InitiatingProcessFolderPath =~ "C:\\Windows\\System32\\runonce.exe"))))'
