{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fff9d2b7-e11c-4a69-93d3-40ef66189767')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fff9d2b7-e11c-4a69-93d3-40ef66189767')]",
      "properties": {
        "alertRuleTemplateName": "fff9d2b7-e11c-4a69-93d3-40ef66189767",
        "author": "Florian Roth (Nextron Systems), Markus Neis, Tim Shelton (HAWK.IO), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2020/07/03",
        "description": "Detects a suspicious copy operation that tries to copy a program from system (System32, SysWOW64, WinSxS) directories to another on disk.\nOften used to move LOLBINs such as 'certutil' or 'desktopimgdownldr' to a different location with a different name in order to bypass detections based on locations.\n",
        "displayName": "Suspicious Copy From or To System Directory",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/08/29",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"copy \" and FolderPath endswith \"\\\\cmd.exe\") or ((FolderPath endswith \"\\\\robocopy.exe\" or FolderPath endswith \"\\\\xcopy.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"robocopy.exe\", \"XCOPY.EXE\"))) or ((ProcessCommandLine contains \"copy-item\" or ProcessCommandLine contains \" copy \" or ProcessCommandLine contains \"cpi \" or ProcessCommandLine contains \" cp \") and (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\"))) and (ProcessCommandLine contains \"\\\\System32\" or ProcessCommandLine contains \"\\\\SysWOW64\" or ProcessCommandLine contains \"\\\\WinSxS\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1036"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
