{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8150732a-0c9d-4a99-82b9-9efb9b90c40c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8150732a-0c9d-4a99-82b9-9efb9b90c40c')]",
      "properties": {
        "alertRuleTemplateName": "8150732a-0c9d-4a99-82b9-9efb9b90c40c",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/10/28",
        "description": "Detects usage of Msiexec.exe to install packages hosted remotely quietly",
        "displayName": "Suspicious Msiexec Quiet Install From Remote Location",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-i\" or ProcessCommandLine contains \"/i\" or ProcessCommandLine contains \"-package\" or ProcessCommandLine contains \"/package\" or ProcessCommandLine contains \"-a\" or ProcessCommandLine contains \"/a\" or ProcessCommandLine contains \"-j\" or ProcessCommandLine contains \"/j\") and (FolderPath endswith \"\\\\msiexec.exe\" or ProcessVersionInfoOriginalFileName =~ \"msiexec.exe\") and (ProcessCommandLine contains \"-q\" or ProcessCommandLine contains \"/q\") and (ProcessCommandLine contains \"http\" or ProcessCommandLine contains \"\\\\\\\\\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
