{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e218595b-bbe7-4ee5-8a96-f32a24ad3468')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e218595b-bbe7-4ee5-8a96-f32a24ad3468')]",
      "properties": {
        "alertRuleTemplateName": "e218595b-bbe7-4ee5-8a96-f32a24ad3468",
        "author": "Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2020/07/03",
        "description": "Detects a suspicious curl process start on Windows and outputs the requested document to a local file",
        "displayName": "Suspicious Curl.EXE Download",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\curl.exe\" or ProcessVersionInfoProductName =~ \"The curl executable\") and ((ProcessCommandLine endswith \".dll\" or ProcessCommandLine endswith \".gif\" or ProcessCommandLine endswith \".jpeg\" or ProcessCommandLine endswith \".jpg\" or ProcessCommandLine endswith \".png\" or ProcessCommandLine endswith \".temp\" or ProcessCommandLine endswith \".tmp\" or ProcessCommandLine endswith \".txt\" or ProcessCommandLine endswith \".vbe\" or ProcessCommandLine endswith \".vbs\") or (ProcessCommandLine contains \"%AppData%\" or ProcessCommandLine contains \"%Public%\" or ProcessCommandLine contains \"%Temp%\" or ProcessCommandLine contains \"%tmp%\" or ProcessCommandLine contains \"\\\\AppData\\\\\" or ProcessCommandLine contains \"\\\\Desktop\\\\\" or ProcessCommandLine contains \"\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"C:\\\\PerfLogs\\\\\" or ProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or ProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\")) and (not(((ProcessCommandLine contains \"--silent --show-error --output \" and ProcessCommandLine contains \"gfw-httpget-\" and ProcessCommandLine contains \"AppData\") and FolderPath =~ \"C:\\\\Program Files\\\\Git\\\\mingw64\\\\bin\\\\curl.exe\" and InitiatingProcessFolderPath =~ \"C:\\\\Program Files\\\\Git\\\\usr\\\\bin\\\\sh.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1105"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
