name: Suspicious Curl.EXE Download
id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2020/07/03
severity: high
description: Detects a suspicious curl process start on Windows and outputs the requested
  document to a local file
status: test
modified: 2023/02/21
logsource:
  category: process_creation
  product: windows
tactics:
- command_and_control
relevantTechniques:
- t1105
query: 'DeviceProcessEvents

  | where (FolderPath endswith "\\curl.exe" or ProcessVersionInfoProductName =~ "The
  curl executable") and ((ProcessCommandLine endswith ".dll" or ProcessCommandLine
  endswith ".gif" or ProcessCommandLine endswith ".jpeg" or ProcessCommandLine endswith
  ".jpg" or ProcessCommandLine endswith ".png" or ProcessCommandLine endswith ".temp"
  or ProcessCommandLine endswith ".tmp" or ProcessCommandLine endswith ".txt" or ProcessCommandLine
  endswith ".vbe" or ProcessCommandLine endswith ".vbs") or (ProcessCommandLine contains
  "%AppData%" or ProcessCommandLine contains "%Public%" or ProcessCommandLine contains
  "%Temp%" or ProcessCommandLine contains "%tmp%" or ProcessCommandLine contains "\\AppData\\"
  or ProcessCommandLine contains "\\Desktop\\" or ProcessCommandLine contains "\\Temp\\"
  or ProcessCommandLine contains "\\Users\\Public\\" or ProcessCommandLine contains
  "C:\\PerfLogs\\" or ProcessCommandLine contains "C:\\ProgramData\\" or ProcessCommandLine
  contains "C:\\Windows\\Temp\\")) and (not(((ProcessCommandLine contains "--silent
  --show-error --output " and ProcessCommandLine contains "gfw-httpget-" and ProcessCommandLine
  contains "AppData") and FolderPath =~ "C:\\Program Files\\Git\\mingw64\\bin\\curl.exe"
  and InitiatingProcessFolderPath =~ "C:\\Program Files\\Git\\usr\\bin\\sh.exe")))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
