name: Suspicious WSMAN Provider Image Loads
id: ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/06/24
severity: medium
description: Detects signs of potential use of the WSMAN provider from uncommon processes
  locally and remote execution.
status: test
modified: 2022/10/07
logsource:
  category: image_load
  product: windows
tactics:
- execution
- lateral_movement
relevantTechniques:
- t1021.003
- t1059.001
query: 'DeviceImageLoadEvents

  | where (((FolderPath endswith "\\WsmSvc.dll" or FolderPath endswith "\\WsmAuto.dll"
  or FolderPath endswith "\\Microsoft.WSMan.Management.ni.dll") or (InitiatingProcessVersionInfoOriginalFileName
  in~ ("WsmSvc.dll", "WSMANAUTOMATION.DLL", "Microsoft.WSMan.Management.dll"))) or
  (InitiatingProcessFolderPath endswith "\\svchost.exe" and InitiatingProcessVersionInfoOriginalFileName
  =~ "WsmWmiPl.dll")) and (not((InitiatingProcessFolderPath startswith "C:\\Program
  Files\\Citrix\\" or (InitiatingProcessFolderPath endswith "\\powershell.exe" or
  InitiatingProcessFolderPath endswith "C:\\Windows\\System32\\sdiagnhost.exe" or
  InitiatingProcessFolderPath endswith "C:\\Windows\\System32\\services.exe") or (InitiatingProcessFolderPath
  endswith "\\mscorsvw.exe" and (InitiatingProcessFolderPath startswith "C:\\Windows\\Microsoft.NET\\Framework64\\v"
  or InitiatingProcessFolderPath startswith "C:\\Windows\\Microsoft.NET\\Framework\\v"))
  or InitiatingProcessFolderPath startswith "C:\\Windows\\Temp\\asgard2-agent\\" or
  InitiatingProcessFolderPath endswith "\\powershell_ise.exe" or (InitiatingProcessCommandLine
  contains "svchost.exe -k netsvcs -p -s BITS" or InitiatingProcessCommandLine contains
  "svchost.exe -k GraphicsPerfSvcGroup -s GraphicsPerfSvc" or InitiatingProcessCommandLine
  contains "svchost.exe -k NetworkService -p -s Wecsvc" or InitiatingProcessCommandLine
  contains "svchost.exe -k netsvcs") or (InitiatingProcessFolderPath in~ ("C:\\Windows\\System32\\Configure-SMRemoting.exe",
  "C:\\Windows\\System32\\ServerManager.exe")) or InitiatingProcessFolderPath startswith
  "C:\\$WINDOWS.~BT\\Sources\\"))) and (not((InitiatingProcessFolderPath endswith
  "\\svchost.exe" and isnull(InitiatingProcessCommandLine))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
