name: System Control Panel Item Loaded From Uncommon Location
id: 2b140a5c-dc02-4bb8-b6b1-8bdb45714cde
author: Anish Bogati
date: 2024/01/09
level: medium
description: Detects image load events of system control panel items (.cpl) from uncommon
  or non-system locations which might be the result of sideloading.
status: experimental
modified: ''
logsource:
  category: image_load
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1036
query: 'DeviceImageLoadEvents

  | where (FolderPath endswith "\\hdwwiz.cpl" or FolderPath endswith "\\appwiz.cpl")
  and (not((FolderPath contains ":\\Windows\\System32\\" or FolderPath contains ":\\Windows\\SysWOW64\\"
  or FolderPath contains ":\\Windows\\WinSxS\\")))'
