name: Third Party Software DLL Sideloading
id: f9df325d-d7bc-4a32-8a1a-2cc61dcefc63
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
date: 2022/08/17
severity: medium
description: Detects DLL sideloading of DLLs that are part of third party software
  (zoom, discord....etc)
status: test
modified: ''
logsource:
  category: image_load
  product: windows
tactics:
- defense_evasion
- persistence
- privilege_escalation
relevantTechniques:
- t1574.001
- t1574.002
query: 'DeviceImageLoadEvents

  | where (FolderPath endswith "\\commfunc.dll" and (not((FolderPath contains "\\AppData\\local\\Google\\Chrome\\Application\\"
  or (FolderPath startswith "C:\\Program Files\\Lenovo\\Communications Utility\\"
  or FolderPath startswith "C:\\Program Files (x86)\\Lenovo\\Communications Utility\\")))))
  or (FolderPath endswith "\\tosbtkbd.dll" and (not((FolderPath startswith "C:\\Program
  Files\\Toshiba\\Bluetooth Toshiba Stack\\" or FolderPath startswith "C:\\Program
  Files (x86)\\Toshiba\\Bluetooth Toshiba Stack\\"))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
