name: UAC Bypass Using .NET Code Profiler on MMC
id: 93a19907-d4f9-4deb-9f91-aac4692776a6
author: Christian Burkard (Nextron Systems)
date: 2021/08/30
severity: high
description: Detects the pattern of UAC Bypass using .NET Code Profiler and mmc.exe
  DLL hijacking (UACMe 39)
status: test
modified: 2022/10/09
logsource:
  category: file_event
  product: windows
tactics:
- Defense Evasion
- Privilege Escalation
relevantTechniques:
- T1548
query: 'DeviceFileEvents

  | where FolderPath endswith "\\AppData\\Local\\Temp\\pe386.dll" and FolderPath startswith
  "C:\\Users\\"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
