name: UAC Bypass Abusing Winsat Path Parsing - File
id: 155dbf56-e0a4-4dd0-8905-8a98705045e8
author: Christian Burkard (Nextron Systems)
date: 2021-08-30
severity: high
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
  (UACMe 52)
status: test
modified: 2022-10-09
logsource:
  category: file_event
  product: windows
tactics:
- Defense-evasion
- Privilege-escalation
relevantTechniques:
- T1548
query: 'DeviceFileEvents

  | where (FolderPath endswith "\\AppData\\Local\\Temp\\system32\\winsat.exe" or FolderPath
  endswith "\\AppData\\Local\\Temp\\system32\\winmm.dll") and FolderPath startswith
  "C:\\Users\\"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
