{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60')]",
      "properties": {
        "alertRuleTemplateName": "9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/01/04",
        "description": "Detects the execution of format.com with an uncommon filesystem selection that could indicate a defense evasion activity in which \"format.com\" is used to load malicious DLL files or other programs.\n",
        "displayName": "Uncommon FileSystem Load Attempt By Format.com",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/05/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/fs:\" and FolderPath endswith \"\\\\format.com\") and (not((ProcessCommandLine contains \"/fs:exFAT\" or ProcessCommandLine contains \"/fs:FAT\" or ProcessCommandLine contains \"/fs:NTFS\" or ProcessCommandLine contains \"/fs:ReFS\" or ProcessCommandLine contains \"/fs:UDF\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
