name: Uninstall Sysinternals Sysmon
id: 6a5f68d1-c4b5-46b9-94ee-5324892ea939
author: frack113
date: 2022/01/12
severity: high
description: Detects the removal of Sysmon, which could be a potential attempt at
  defense evasion
status: test
modified: 2024/03/13
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1562.001
query: 'DeviceProcessEvents

  | where (ProcessCommandLine contains "-u" or ProcessCommandLine contains "/u") and
  ((FolderPath endswith "\\Sysmon64.exe" or FolderPath endswith "\\Sysmon.exe") or
  ProcessVersionInfoFileDescription =~ "System activity monitor")'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
