{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a96970af-f126-420d-90e1-d37bf25e50e1')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a96970af-f126-420d-90e1-d37bf25e50e1')]",
      "properties": {
        "alertRuleTemplateName": "a96970af-f126-420d-90e1-d37bf25e50e1",
        "author": "frack113, Nasreddine Bencherchali",
        "customDetails": null,
        "date": "2022/08/07",
        "description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image detection",
        "displayName": "Use Short Name Path in Image",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/21",
        "query": "DeviceProcessEvents\n| where (FolderPath contains \"~1\\\\\" or FolderPath contains \"~2\\\\\") and (not((((InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\System32\\\\Dism.exe\", \"C:\\\\Windows\\\\System32\\\\cleanmgr.exe\")) or (InitiatingProcessFolderPath endswith \"\\\\WebEx\\\\WebexHost.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor\\\\thor64.exe\") or ProcessVersionInfoProductName =~ \"InstallShield (R)\" or ProcessVersionInfoFileDescription =~ \"InstallShield (R) Setup Engine\" or ProcessVersionInfoCompanyName =~ \"InstallShield Software Corporation\") or ((FolderPath contains \"\\\\AppData\\\\\" and FolderPath contains \"\\\\Temp\\\\\") or (FolderPath endswith \"~1\\\\unzip.exe\" or FolderPath endswith \"~1\\\\7zG.exe\")))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1564"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
