name: Use Short Name Path in Image
id: a96970af-f126-420d-90e1-d37bf25e50e1
author: frack113, Nasreddine Bencherchali
date: 2022/08/07
severity: medium
description: Detect use of the Windows 8.3 short name. Which could be used as a method
  to avoid Image detection
status: test
modified: 2023/03/21
logsource:
  category: process_creation
  product: windows
tactics:
- defense_evasion
relevantTechniques:
- t1564.004
query: 'DeviceProcessEvents

  | where (FolderPath contains "~1\\" or FolderPath contains "~2\\") and (not((((InitiatingProcessFolderPath
  in~ ("C:\\Windows\\System32\\Dism.exe", "C:\\Windows\\System32\\cleanmgr.exe"))
  or (InitiatingProcessFolderPath endswith "\\WebEx\\WebexHost.exe" or InitiatingProcessFolderPath
  endswith "\\thor\\thor64.exe") or ProcessVersionInfoProductName =~ "InstallShield
  (R)" or ProcessVersionInfoFileDescription =~ "InstallShield (R) Setup Engine" or
  ProcessVersionInfoCompanyName =~ "InstallShield Software Corporation") or ((FolderPath
  contains "\\AppData\\" and FolderPath contains "\\Temp\\") or (FolderPath endswith
  "~1\\unzip.exe" or FolderPath endswith "~1\\7zG.exe")))))'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
kind: Scheduled
