{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/10fb649c-3600-4d37-b1e6-56ea90bb7e09')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/10fb649c-3600-4d37-b1e6-56ea90bb7e09')]",
      "properties": {
        "alertRuleTemplateName": "10fb649c-3600-4d37-b1e6-56ea90bb7e09",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2024/02/23",
        "description": "Detects addition of users to highly privileged groups via \"Net\" or \"Add-LocalGroupMember\".",
        "displayName": "User Added To Highly Privileged Group",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Group Policy Creator Owners\" or ProcessCommandLine contains \"Schema Admins\") and ((ProcessCommandLine contains \"localgroup \" and ProcessCommandLine contains \" /add\") or (ProcessCommandLine contains \"Add-LocalGroupMember \" and ProcessCommandLine contains \" -Group \"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1098"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
