{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ffa28e60-bdb1-46e0-9f82-05f7a61cc06e')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ffa28e60-bdb1-46e0-9f82-05f7a61cc06e')]",
      "properties": {
        "alertRuleTemplateName": "ffa28e60-bdb1-46e0-9f82-05f7a61cc06e",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/12/06",
        "description": "Detects addition of users to the local Remote Desktop Users group via \"Net\" or \"Add-LocalGroupMember\".",
        "displayName": "User Added to Remote Desktop Users Group",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/09/09",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Remote Desktop Users\" or ProcessCommandLine contains \"Utilisateurs du Bureau à distance\" or ProcessCommandLine contains \"Usuarios de escritorio remoto\") and ((ProcessCommandLine contains \"localgroup \" and ProcessCommandLine contains \" /add\") or (ProcessCommandLine contains \"Add-LocalGroupMember \" and ProcessCommandLine contains \" -Group \"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1021",
          "t1133",
          "t1136"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
