{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/30bf1789-379d-4fdc-900f-55cd0a90a801')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/30bf1789-379d-4fdc-900f-55cd0a90a801')]",
      "properties": {
        "alertRuleTemplateName": "30bf1789-379d-4fdc-900f-55cd0a90a801",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/10/25",
        "description": "Detects the installation of VsCode tunnel (code-tunnel) as a service.",
        "displayName": "Visual Studio Code Tunnel Service Installation",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"tunnel \" and ProcessCommandLine contains \"service\" and ProcessCommandLine contains \"internal-run\" and ProcessCommandLine contains \"tunnel-service.log\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1071"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
