name: Wdigest CredGuard Registry Modification
id: 1a2d6c47-75b0-45bd-b133-2c0be75349fd
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2019-08-25
severity: high
description: 'Detects potential malicious modification of the property value of IsCredGuardEnabled
  from

  HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to disable Cred
  Guard on a system.

  This is usually used with UseLogonCredential to manipulate the caching credentials.

  '
status: test
modified: 2021-11-27
logsource:
  category: registry_event
  product: windows
tactics:
- Defense-evasion
relevantTechniques:
- T1112
query: 'DeviceRegistryEvents

  | where RegistryKey endswith "\\IsCredGuardEnabled"'
eventGroupingSettings:
  aggregationKind: SingleAlert
queryFrequency: P1D
queryPeriod: P1D
enabled: true
entityMappings: null
sentinelEntitiesMappings: null
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
triggerOperator: GreaterThan
kind: Scheduled
