{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/79ce34ca-af29-4d0e-b832-fc1b377020db')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/79ce34ca-af29-4d0e-b832-fc1b377020db')]",
      "properties": {
        "alertRuleTemplateName": "79ce34ca-af29-4d0e-b832-fc1b377020db",
        "author": "Florian Roth (Nextron Systems), Teymur Kheirkhabarov",
        "customDetails": null,
        "date": "2022/01/28",
        "description": "Detects the execution of \"whoami.exe\" by privileged accounts that are often abused by threat actors",
        "displayName": "Whoami.EXE Execution From Privileged Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/04",
        "query": "DeviceProcessEvents\n| where (ProcessVersionInfoOriginalFileName =~ \"whoami.exe\" or FolderPath endswith \"\\\\whoami.exe\") and (AccountName contains \"AUTHORI\" or AccountName contains \"AUTORI\" or AccountName contains \"TrustedInstaller\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "t1033"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
