{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6120ac2a-a34b-42c0-a9bd-1fb9f459f348')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6120ac2a-a34b-42c0-a9bd-1fb9f459f348')]",
      "properties": {
        "alertRuleTemplateName": "6120ac2a-a34b-42c0-a9bd-1fb9f459f348",
        "author": "Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)",
        "customDetails": null,
        "date": "2023/09/18",
        "description": "Detects execution of the Add-In deployment cache updating utility (AddInutil.exe) from a non-standard directory.",
        "displayName": "AddinUtil.EXE Execution From Uncommon Directory",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\addinutil.exe\" or ProcessVersionInfoOriginalFileName =~ \"AddInUtil.exe\") and (not((FolderPath contains \":\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\\" or FolderPath contains \":\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\\" or FolderPath contains \":\\\\Windows\\\\WinSxS\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
