{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1e53dd56-8d83-4eb4-a43e-b790a05510aa')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1e53dd56-8d83-4eb4-a43e-b790a05510aa')]",
      "properties": {
        "alertRuleTemplateName": "1e53dd56-8d83-4eb4-a43e-b790a05510aa",
        "author": "Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community",
        "customDetails": null,
        "date": "2020/10/13",
        "description": "Detects Windows Installer service (msiexec.exe) spawning \"cmd\" or \"powershell\"",
        "displayName": "Always Install Elevated MSI Spawned Cmd And Powershell",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/20",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"Cmd.Exe\", \"PowerShell.EXE\", \"pwsh.dll\"))) and ((InitiatingProcessFolderPath contains \"\\\\Windows\\\\Installer\\\\\" and InitiatingProcessFolderPath contains \"msi\") and InitiatingProcessFolderPath endswith \"tmp\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1548"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
