{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/60f16a96-db70-42eb-8f76-16763e333590')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/60f16a96-db70-42eb-8f76-16763e333590')]",
      "properties": {
        "alertRuleTemplateName": "60f16a96-db70-42eb-8f76-16763e333590",
        "author": "Beyu Denis, oscd.community, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2019/10/26",
        "description": "Detects execution of of Dxcap.exe",
        "displayName": "Application Whitelisting Bypass via Dxcap.exe",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/06/09",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" -c \" and (FolderPath endswith \"\\\\DXCap.exe\" or ProcessVersionInfoOriginalFileName =~ \"DXCap.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
