{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/dec44ca7-61ad-493c-bfd7-8819c5faa09b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/dec44ca7-61ad-493c-bfd7-8819c5faa09b')]",
      "properties": {
        "alertRuleTemplateName": "dec44ca7-61ad-493c-bfd7-8819c5faa09b",
        "author": "oscd.community, Zach Stanford @svch0st, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2020/10/05",
        "description": "Detects potential abuse of Windows Subsystem for Linux (WSL) binary as a LOLBIN to execute arbitrary Linux or Windows commands",
        "displayName": "Arbitrary Command Execution Using WSL",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/04/12",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -e \" or ProcessCommandLine contains \" --exec\" or ProcessCommandLine contains \" --system\" or ProcessCommandLine contains \" --shell-type \" or ProcessCommandLine contains \" /mnt/c\" or ProcessCommandLine contains \" --user root\" or ProcessCommandLine contains \" -u root\" or ProcessCommandLine contains \"--debug-shell\") and (FolderPath endswith \"\\\\wsl.exe\" or ProcessVersionInfoOriginalFileName =~ \"wsl.exe\")) and (not(((ProcessCommandLine contains \" -d \" and ProcessCommandLine contains \" -e kill \") and InitiatingProcessFolderPath endswith \"\\\\cmd.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1202",
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
