{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d80d5c81-04ba-45b4-84e4-92eba40e0ad3')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d80d5c81-04ba-45b4-84e4-92eba40e0ad3')]",
      "properties": {
        "alertRuleTemplateName": "d80d5c81-04ba-45b4-84e4-92eba40e0ad3",
        "author": "Beyu Denis, oscd.community",
        "customDetails": null,
        "date": "2020/10/18",
        "description": "Detects execution of arbitrary DLLs or unsigned code via a \".csproj\" files via Dotnet.EXE.",
        "displayName": "Arbitrary DLL or Csproj Code Execution Via Dotnet.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/04/24",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \".csproj\" or ProcessCommandLine endswith \".csproj\\\"\" or ProcessCommandLine endswith \".dll\" or ProcessCommandLine endswith \".dll\\\"\" or ProcessCommandLine endswith \".csproj'\" or ProcessCommandLine endswith \".dll'\") and (FolderPath endswith \"\\\\dotnet.exe\" or ProcessVersionInfoOriginalFileName =~ \".NET Host\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
