{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d65aee4d-2292-4cea-b832-83accd6cfa43')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d65aee4d-2292-4cea-b832-83accd6cfa43')]",
      "properties": {
        "alertRuleTemplateName": "d65aee4d-2292-4cea-b832-83accd6cfa43",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/06/10",
        "description": "Detects execution of the Notepad++ updater (gup) to launch other commands or executables",
        "displayName": "Arbitrary Binary Execution Using GUP Utility",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/02",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\explorer.exe\" and InitiatingProcessFolderPath endswith \"\\\\gup.exe\") and (not(((ProcessCommandLine contains \"\\\\Notepad++\\\\notepad++.exe\" and FolderPath endswith \"\\\\explorer.exe\") or isnull(ProcessCommandLine) or InitiatingProcessFolderPath contains \"\\\\Notepad++\\\\updater\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
