{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1e75c1cc-c5d4-42aa-ac3d-91b0b68b3b4c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1e75c1cc-c5d4-42aa-ac3d-91b0b68b3b4c')]",
      "properties": {
        "alertRuleTemplateName": "1e75c1cc-c5d4-42aa-ac3d-91b0b68b3b4c",
        "author": "Nasreddine Bencherchali (Nextron Systems), Karneades / Markus Neis, Jonhnathan Ribeiro, oscd.community",
        "customDetails": null,
        "date": "2022/06/09",
        "description": "Detects the usage of the \"Squirrel.exe\" to download arbitrary files. This binary is part of multiple Electron based software installations (Slack, Teams, Discord, etc.)\n",
        "displayName": "Arbitrary File Download Via Squirrel.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/09",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" --download \" or ProcessCommandLine contains \" --update \" or ProcessCommandLine contains \" --updateRollback=\") and ProcessCommandLine contains \"http\" and (FolderPath endswith \"\\\\squirrel.exe\" or FolderPath endswith \"\\\\update.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
