{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/932fb0d8-692b-4b0f-a26e-5643a50fe7d6')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/932fb0d8-692b-4b0f-a26e-5643a50fe7d6')]",
      "properties": {
        "alertRuleTemplateName": "932fb0d8-692b-4b0f-a26e-5643a50fe7d6",
        "author": "E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2019/10/24",
        "description": "Detects audio capture via PowerShell Cmdlet.",
        "displayName": "Audio Capture via PowerShell",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/04/06",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"WindowsAudioDevice-Powershell-Cmdlet\" or ProcessCommandLine contains \"Toggle-AudioDevice\" or ProcessCommandLine contains \"Get-AudioDevice \" or ProcessCommandLine contains \"Set-AudioDevice \" or ProcessCommandLine contains \"Write-AudioDevice \"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Collection"
        ],
        "techniques": [
          "T1123"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
