{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0a13e132-651d-11eb-ae93-0242ac130002')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0a13e132-651d-11eb-ae93-0242ac130002')]",
      "properties": {
        "alertRuleTemplateName": "0a13e132-651d-11eb-ae93-0242ac130002",
        "author": "Janantha Marasinghe (https://github.com/blueteam0ps)",
        "customDetails": null,
        "date": "2021/02/02",
        "description": "Threat actors can use auditpol binary to change audit policy configuration to impair detection capability.\nThis can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor.\n",
        "displayName": "Audit Policy Tampering Via Auditpol",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/22",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"disable\" or ProcessCommandLine contains \"clear\" or ProcessCommandLine contains \"remove\" or ProcessCommandLine contains \"restore\") and (FolderPath endswith \"\\\\auditpol.exe\" or ProcessVersionInfoOriginalFileName =~ \"AUDITPOL.EXE\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1562"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
