{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f576a613-2392-4067-9d1a-9345fb58d8d1')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f576a613-2392-4067-9d1a-9345fb58d8d1')]",
      "properties": {
        "alertRuleTemplateName": "f576a613-2392-4067-9d1a-9345fb58d8d1",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/07/28",
        "description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data.",
        "displayName": "Automated Collection Command Prompt",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/11/11",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \".doc\" or ProcessCommandLine contains \".docx\" or ProcessCommandLine contains \".xls\" or ProcessCommandLine contains \".xlsx\" or ProcessCommandLine contains \".ppt\" or ProcessCommandLine contains \".pptx\" or ProcessCommandLine contains \".rtf\" or ProcessCommandLine contains \".pdf\" or ProcessCommandLine contains \".txt\") and ((ProcessCommandLine contains \"dir \" and ProcessCommandLine contains \" /b \" and ProcessCommandLine contains \" /s \") or ((ProcessCommandLine contains \" /e \" or ProcessCommandLine contains \" /si \") and ProcessVersionInfoOriginalFileName =~ \"FINDSTR.EXE\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Collection"
        ],
        "techniques": [
          "T1119",
          "T1552"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
