{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/22e58743-4ac8-4a9f-bf19-00a0428d8c5f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/22e58743-4ac8-4a9f-bf19-00a0428d8c5f')]",
      "properties": {
        "alertRuleTemplateName": "22e58743-4ac8-4a9f-bf19-00a0428d8c5f",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/07/12",
        "description": "Detects encoded base64 MZ header in the commandline",
        "displayName": "Base64 MZ Header In CommandLine",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"TVqQAAMAAAAEAAAA\" or ProcessCommandLine contains \"TVpQAAIAAAAEAA8A\" or ProcessCommandLine contains \"TVqAAAEAAAAEABAA\" or ProcessCommandLine contains \"TVoAAAAAAAAAAAAA\" or ProcessCommandLine contains \"TVpTAQEAAAAEAAAA\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
