{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9257c05b-4a4a-48e5-a670-b7b073cf401b')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9257c05b-4a4a-48e5-a670-b7b073cf401b')]",
      "properties": {
        "alertRuleTemplateName": "9257c05b-4a4a-48e5-a670-b7b073cf401b",
        "author": "Jimmy Bayne (@bohops)",
        "customDetails": null,
        "date": "2024/01/02",
        "description": "Detects commandline arguments for executing a child process via dotnet-trace.exe",
        "displayName": "Binary Proxy Execution Via Dotnet-Trace.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-- \" and ProcessCommandLine contains \"collect\") and (FolderPath endswith \"\\\\dotnet-trace.exe\" or ProcessVersionInfoOriginalFileName =~ \"dotnet-trace.dll\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
