{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9a019ffc-3580-4c9d-8d87-079f7e8d3fd4')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9a019ffc-3580-4c9d-8d87-079f7e8d3fd4')]",
      "properties": {
        "alertRuleTemplateName": "9a019ffc-3580-4c9d-8d87-079f7e8d3fd4",
        "author": "Janantha Marasinghe, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/05/17",
        "description": "Detects execution of the \"cloudflared\" tool to connect back to a tunnel. This was seen used by threat actors to maintain persistence and remote access to compromised networks.",
        "displayName": "Cloudflared Tunnel Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/20",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-config \" or ProcessCommandLine contains \"-credentials-contents \" or ProcessCommandLine contains \"-credentials-file \" or ProcessCommandLine contains \"-token \") and (ProcessCommandLine contains \" tunnel \" and ProcessCommandLine contains \" run \")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1090",
          "t1102",
          "t1572"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
