{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4b60e6f2-bf39-47b4-b4ea-398e33cfe253')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4b60e6f2-bf39-47b4-b4ea-398e33cfe253')]",
      "properties": {
        "alertRuleTemplateName": "4b60e6f2-bf39-47b4-b4ea-398e33cfe253",
        "author": "Nik Seetharaman, Christian Burkard (Nextron Systems)",
        "customDetails": null,
        "date": "2019/07/31",
        "description": "Detects UAC Bypass Attempt Using Microsoft Connection Manager Profile Installer Autoelevate-capable COM Objects (e.g. UACMe ID of 41, 43, 58 or 65)",
        "displayName": "CMSTP UAC Bypass via COM Object Access",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/09/21",
        "query": "DeviceProcessEvents\n| where (ProcessIntegrityLevel in~ (\"High\", \"System\")) and (InitiatingProcessCommandLine contains \" /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or InitiatingProcessCommandLine contains \" /Processid:{3E000D72-A845-4CD9-BD83-80C07C3B881F}\" or InitiatingProcessCommandLine contains \" /Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}\" or InitiatingProcessCommandLine contains \" /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\" or InitiatingProcessCommandLine contains \" /Processid:{E9495B87-D950-4AB5-87A5-FF6D70BF3E90}\") and InitiatingProcessFolderPath endswith \"\\\\DllHost.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "stable",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1218",
          "t1548"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
