{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1ac8666b-046f-4201-8aba-1951aaec03a3')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1ac8666b-046f-4201-8aba-1951aaec03a3')]",
      "properties": {
        "alertRuleTemplateName": "1ac8666b-046f-4201-8aba-1951aaec03a3",
        "author": "Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community",
        "customDetails": null,
        "date": "2019/01/16",
        "description": "Detects a suspicious command line execution that includes an URL and AppData string in the command line parameters as used by several droppers (js/vbs > powershell)",
        "displayName": "Command Line Execution with Suspicious URL and AppData Strings",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2021/11/27",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"http\" and ProcessCommandLine contains \"://\" and ProcessCommandLine contains \"%AppData%\") and FolderPath endswith \"\\\\cmd.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059",
          "t1105"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
