{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7090adee-82e2-4269-bd59-80691e7c6338')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7090adee-82e2-4269-bd59-80691e7c6338')]",
      "properties": {
        "alertRuleTemplateName": "7090adee-82e2-4269-bd59-80691e7c6338",
        "author": "_pete_0, TheDFIRReport",
        "customDetails": null,
        "date": "2022/02/21",
        "description": "Detects use of chcp to look up the system locale value as part of host discovery",
        "displayName": "Console CodePage Lookup Via CHCP",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/05",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \"chcp\" or ProcessCommandLine endswith \"chcp \" or ProcessCommandLine endswith \"chcp  \") and FolderPath endswith \"\\\\chcp.com\" and (InitiatingProcessCommandLine contains \" -c \" or InitiatingProcessCommandLine contains \" /c \" or InitiatingProcessCommandLine contains \" -r \" or InitiatingProcessCommandLine contains \" /r \" or InitiatingProcessCommandLine contains \" -k \" or InitiatingProcessCommandLine contains \" /k \") and InitiatingProcessFolderPath endswith \"\\\\cmd.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "t1614"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
