{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/855bc8b5-2ae8-402e-a9ed-b889e6df1900')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/855bc8b5-2ae8-402e-a9ed-b889e6df1900')]",
      "properties": {
        "alertRuleTemplateName": "855bc8b5-2ae8-402e-a9ed-b889e6df1900",
        "author": "Florian Roth (Nextron Systems), oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st, Nasreddine Bencherchali",
        "customDetails": null,
        "date": "2019/12/30",
        "description": "Detects a copy command or a copy utility execution to or from an Admin share or remote",
        "displayName": "Copy From Or To Admin Share Or Sysvol Folder",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/15",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"\\\\\" and ProcessCommandLine contains \"$\") or ProcessCommandLine contains \"\\\\Sysvol\\\\\") and (((FolderPath endswith \"\\\\robocopy.exe\" or FolderPath endswith \"\\\\xcopy.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"robocopy.exe\", \"XCOPY.EXE\"))) or (ProcessCommandLine contains \"copy\" and (FolderPath endswith \"\\\\cmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"Cmd.Exe\")) or ((ProcessCommandLine contains \"copy-item\" or ProcessCommandLine contains \"copy \" or ProcessCommandLine contains \"cpi \" or ProcessCommandLine contains \" cp \" or ProcessCommandLine contains \"move \" or ProcessCommandLine contains \"move-item\" or ProcessCommandLine contains \" mi \" or ProcessCommandLine contains \" mv \") and ((FolderPath contains \"\\\\powershell.exe\" or FolderPath contains \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "collection",
          "exfiltration"
        ],
        "techniques": [
          "T1021",
          "T1039",
          "T1048"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
