{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9ae01559-cf7e-4f8e-8e14-4c290a1b4784')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9ae01559-cf7e-4f8e-8e14-4c290a1b4784')]",
      "properties": {
        "alertRuleTemplateName": "9ae01559-cf7e-4f8e-8e14-4c290a1b4784",
        "author": "Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)",
        "customDetails": null,
        "date": "2020/10/20",
        "description": "Detects loading of \"credui.dll\" and related DLLs by an uncommon process. Attackers might leverage this DLL for potential use of \"CredUIPromptForCredentials\" or \"CredUnPackAuthenticationBufferW\".",
        "displayName": "CredUI.DLL Loaded By Uncommon Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "2023/07/28",
        "query": "DeviceImageLoadEvents\n| where ((FolderPath endswith \"\\\\credui.dll\" or FolderPath endswith \"\\\\wincredui.dll\") or (InitiatingProcessVersionInfoOriginalFileName in~ (\"credui.dll\", \"wincredui.dll\"))) and (not(((InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\explorer.exe\", \"C:\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe\", \"C:\\\\Windows\\\\regedit.exe\")) or (InitiatingProcessFolderPath startswith \"C:\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\System32\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\SysWOW64\\\\\")))) and (not(((InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\\" and InitiatingProcessFolderPath startswith \"C:\\\\Users\\\\\") or InitiatingProcessFolderPath endswith \"\\\\opera_autoupdate.exe\" or (InitiatingProcessFolderPath endswith \"\\\\procexp64.exe\" or InitiatingProcessFolderPath endswith \"\\\\procexp.exe\") or (InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\\" and InitiatingProcessFolderPath endswith \"\\\\Teams.exe\" and InitiatingProcessFolderPath startswith \"C:\\\\Users\\\\\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "collection"
        ],
        "techniques": [
          "t1056"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
