{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/dbc1f800-0fe0-4bc0-9c66-292c2abe3f78')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/dbc1f800-0fe0-4bc0-9c66-292c2abe3f78')]",
      "properties": {
        "alertRuleTemplateName": "dbc1f800-0fe0-4bc0-9c66-292c2abe3f78",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/09",
        "description": "Detects when adversaries stop services or processes by deleting their respective scheduled tasks in order to conduct data destructive activities",
        "displayName": "Delete Important Scheduled Task",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"\\\\Windows\\\\BitLocker\" or ProcessCommandLine contains \"\\\\Windows\\\\ExploitGuard\" or ProcessCommandLine contains \"\\\\Windows\\\\SystemRestore\\\\SR\" or ProcessCommandLine contains \"\\\\Windows\\\\UpdateOrchestrator\\\\\" or ProcessCommandLine contains \"\\\\Windows\\\\Windows Defender\\\\\" or ProcessCommandLine contains \"\\\\Windows\\\\WindowsBackup\\\\\" or ProcessCommandLine contains \"\\\\Windows\\\\WindowsUpdate\\\\\") and (ProcessCommandLine contains \"/delete\" and ProcessCommandLine contains \"/tn\") and FolderPath endswith \"\\\\schtasks.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "impact"
        ],
        "techniques": [
          "t1489"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
