{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fb50eb7a-5ab1-43ae-bcc9-091818cb8424')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fb50eb7a-5ab1-43ae-bcc9-091818cb8424')]",
      "properties": {
        "alertRuleTemplateName": "fb50eb7a-5ab1-43ae-bcc9-091818cb8424",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2020/06/19",
        "description": "Detects command lines that indicate unwanted modifications to registry keys that disable important Internet Explorer security features",
        "displayName": "Disabled IE Security Features",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2021/11/27",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -name IEHarden \" and ProcessCommandLine contains \" -value 0 \") or (ProcessCommandLine contains \" -name DEPOff \" and ProcessCommandLine contains \" -value 1 \") or (ProcessCommandLine contains \" -name DisableFirstRunCustomize \" and ProcessCommandLine contains \" -value 2 \")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1562"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
