{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b243b280-65fe-48df-ba07-6ddea7646427')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b243b280-65fe-48df-ba07-6ddea7646427')]",
      "properties": {
        "alertRuleTemplateName": "b243b280-65fe-48df-ba07-6ddea7646427",
        "author": "E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community",
        "customDetails": null,
        "date": "2019/10/24",
        "description": "Identifies use of various commands to query a systems time. This technique may be used before executing a scheduled task or to discover the time zone of a target system.",
        "displayName": "Discovery of a System Time",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/06/28",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"time\" and (FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\net1.exe\")) or (ProcessCommandLine contains \"tz\" and FolderPath endswith \"\\\\w32tm.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "low",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "T1124"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
