{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/84f52741-8834-4a8c-a413-2eb2269aa6c8')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/84f52741-8834-4a8c-a413-2eb2269aa6c8')]",
      "properties": {
        "alertRuleTemplateName": "84f52741-8834-4a8c-a413-2eb2269aa6c8",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/04/24",
        "description": "Detects MsiExec loading a DLL and calling its DllUnregisterServer function",
        "displayName": "DllUnregisterServer Function Call Via Msiexec.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/13",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \".dll\" and (ProcessCommandLine contains \" -z \" or ProcessCommandLine contains \" /z \") and (FolderPath endswith \"\\\\msiexec.exe\" or ProcessVersionInfoOriginalFileName =~ \"\\\\msiexec.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
