{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/312d0384-401c-4b8b-abdf-685ffba9a332')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/312d0384-401c-4b8b-abdf-685ffba9a332')]",
      "properties": {
        "alertRuleTemplateName": "312d0384-401c-4b8b-abdf-685ffba9a332",
        "author": "Nasreddine Bencherchali (Nextron Systems),  Azure-Sentinel (idea)",
        "customDetails": null,
        "date": "2022/09/09",
        "description": "Detects email exfiltration via powershell cmdlets",
        "displayName": "Email Exifiltration Via Powershell",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Add-PSSnapin\" and ProcessCommandLine contains \"Get-Recipient\" and ProcessCommandLine contains \"-ExpandProperty\" and ProcessCommandLine contains \"EmailAddresses\" and ProcessCommandLine contains \"SmtpAddress\" and ProcessCommandLine contains \"-hidetableheaders\") and (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "exfiltration"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
