{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6a69f62d-ce75-4b57-8dce-6351eb55b362')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6a69f62d-ce75-4b57-8dce-6351eb55b362')]",
      "properties": {
        "alertRuleTemplateName": "6a69f62d-ce75-4b57-8dce-6351eb55b362",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/02/13",
        "description": "One way Qbot steals sensitive information is by extracting browser data from Internet Explorer and Microsoft Edge by using the built-in utility esentutl.exe",
        "displayName": "Esentutl Steals Browser Information",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/05",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-r\" or ProcessCommandLine contains \"/r\") and (FolderPath endswith \"\\\\esentutl.exe\" or ProcessVersionInfoOriginalFileName =~ \"esentutl.exe\") and ProcessCommandLine contains \"\\\\Windows\\\\WebCache\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Collection"
        ],
        "techniques": [
          "T1005"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
