{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/71158e3f-df67-472b-930e-7d287acaa3e1')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/71158e3f-df67-472b-930e-7d287acaa3e1')]",
      "properties": {
        "alertRuleTemplateName": "71158e3f-df67-472b-930e-7d287acaa3e1",
        "author": "Max Altgelt (Nextron Systems)",
        "customDetails": null,
        "date": "2021/12/09",
        "description": "Checks whether the image specified in a process creation event is not a full, absolute path (caused by process ghosting or other unorthodox methods to start a process)",
        "displayName": "Execution Of Non-Existing File",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/14",
        "query": "DeviceProcessEvents\n| where (not(FolderPath contains \"\\\\\")) and (not((((FolderPath in~ (\"System\", \"Registry\", \"MemCompression\", \"vmmem\")) or (ProcessCommandLine in~ (\"Registry\", \"MemCompression\", \"vmmem\"))) or (FolderPath in~ (\"-\", \"\")) or isnull(FolderPath))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
