{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fb9d3ff7-7348-46ab-af8c-b55f5fbf39b4')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fb9d3ff7-7348-46ab-af8c-b55f5fbf39b4')]",
      "properties": {
        "alertRuleTemplateName": "fb9d3ff7-7348-46ab-af8c-b55f5fbf39b4",
        "author": "Max Altgelt (Nextron Systems)",
        "customDetails": null,
        "date": "2022/04/06",
        "description": "This rule detects execution of PowerShell scripts located in the \"C:\\Users\\Public\" folder",
        "displayName": "Execution of Powershell Script in Public Folder",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/07/14",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-f C:\\\\Users\\\\Public\" or ProcessCommandLine contains \"-f \\\"C:\\\\Users\\\\Public\" or ProcessCommandLine contains \"-f %Public%\" or ProcessCommandLine contains \"-fi C:\\\\Users\\\\Public\" or ProcessCommandLine contains \"-fi \\\"C:\\\\Users\\\\Public\" or ProcessCommandLine contains \"-fi %Public%\" or ProcessCommandLine contains \"-fil C:\\\\Users\\\\Public\" or ProcessCommandLine contains \"-fil \\\"C:\\\\Users\\\\Public\" or ProcessCommandLine contains \"-fil %Public%\" or ProcessCommandLine contains \"-file C:\\\\Users\\\\Public\" or ProcessCommandLine contains \"-file \\\"C:\\\\Users\\\\Public\" or ProcessCommandLine contains \"-file %Public%\") and (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
