{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/646bc99f-6682-4b47-a73a-17b1b64c9d34')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/646bc99f-6682-4b47-a73a-17b1b64c9d34')]",
      "properties": {
        "alertRuleTemplateName": "646bc99f-6682-4b47-a73a-17b1b64c9d34",
        "author": "Beyu Denis, oscd.community",
        "customDetails": null,
        "date": "2020/10/18",
        "description": "Detects file execution using the msdeploy.exe lolbin",
        "displayName": "Execute Files with Msdeploy.exe",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2021/11/27",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"verb:sync\" and ProcessCommandLine contains \"-source:RunCommand\" and ProcessCommandLine contains \"-dest:runCommand\") and FolderPath endswith \"\\\\msdeploy.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
