{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7f43c430-5001-4f8b-aaa9-c3b88f18fa5c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7f43c430-5001-4f8b-aaa9-c3b88f18fa5c')]",
      "properties": {
        "alertRuleTemplateName": "7f43c430-5001-4f8b-aaa9-c3b88f18fa5c",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/09/01",
        "description": "Detects execution from an Alternate Data Stream (ADS). Adversaries may use NTFS file attributes to hide their malicious data in order to evade detection",
        "displayName": "Execute From Alternate Data Streams",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"txt:\" and ((ProcessCommandLine contains \"esentutl \" and ProcessCommandLine contains \" /y \" and ProcessCommandLine contains \" /d \" and ProcessCommandLine contains \" /o \") or (ProcessCommandLine contains \"makecab \" and ProcessCommandLine contains \".cab\") or (ProcessCommandLine contains \"reg \" and ProcessCommandLine contains \" export \") or (ProcessCommandLine contains \"regedit \" and ProcessCommandLine contains \" /E \") or (ProcessCommandLine contains \"type \" and ProcessCommandLine contains \" > \"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1564"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
