{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/961e0abb-1b1e-4c84-a453-aafe56ad0d34')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/961e0abb-1b1e-4c84-a453-aafe56ad0d34')]",
      "properties": {
        "alertRuleTemplateName": "961e0abb-1b1e-4c84-a453-aafe56ad0d34",
        "author": "Austin Songer (@austinsonger)",
        "customDetails": null,
        "date": "2021/10/21",
        "description": "Detects the use of stordiag.exe to execute schtasks.exe systeminfo.exe and fltmc.exe",
        "displayName": "Execution via stordiag.exe",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/25",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\systeminfo.exe\" or FolderPath endswith \"\\\\fltmc.exe\") and InitiatingProcessFolderPath endswith \"\\\\stordiag.exe\") and (not((InitiatingProcessFolderPath startswith \"c:\\\\windows\\\\system32\\\\\" or InitiatingProcessFolderPath startswith \"c:\\\\windows\\\\syswow64\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
