{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f0e53e89-8d22-46ea-9db5-9d4796ee2f8a')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f0e53e89-8d22-46ea-9db5-9d4796ee2f8a')]",
      "properties": {
        "alertRuleTemplateName": "f0e53e89-8d22-46ea-9db5-9d4796ee2f8a",
        "author": "Oddvar Moe, Sander Wiebing, oscd.community",
        "customDetails": null,
        "date": "2020/10/07",
        "description": "Detects the export of the target Registry key to a file.",
        "displayName": "Exports Registry Key To a File",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/13",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -E \" or ProcessCommandLine contains \" /E \") and (FolderPath endswith \"\\\\regedit.exe\" or ProcessVersionInfoOriginalFileName =~ \"REGEDIT.EXE\")) and (not(((ProcessCommandLine contains \"hklm\" or ProcessCommandLine contains \"hkey_local_machine\") and (ProcessCommandLine endswith \"\\\\system\" or ProcessCommandLine endswith \"\\\\sam\" or ProcessCommandLine endswith \"\\\\security\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "low",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "exfiltration"
        ],
        "techniques": [
          "t1012"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
