{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/828af599-4c53-4ed2-ba4a-a9f835c434ea')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/828af599-4c53-4ed2-ba4a-a9f835c434ea')]",
      "properties": {
        "alertRuleTemplateName": "828af599-4c53-4ed2-ba4a-a9f835c434ea",
        "author": "NVISO",
        "customDetails": null,
        "date": "2020/05/04",
        "description": "The Fax service attempts to load ualapi.dll, which is non-existent. An attacker can then (side)load their own malicious DLL using this service.",
        "displayName": "Fax Service DLL Search Order Hijack",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "2022/06/02",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"ualapi.dll\" and InitiatingProcessFolderPath endswith \"\\\\fxssvc.exe\") and (not(FolderPath startswith \"C:\\\\Windows\\\\WinSxS\\\\\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
