{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/46123129-1024-423e-9fae-43af4a0fa9a5')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/46123129-1024-423e-9fae-43af4a0fa9a5')]",
      "properties": {
        "alertRuleTemplateName": "46123129-1024-423e-9fae-43af4a0fa9a5",
        "author": "Matthew Matchen",
        "customDetails": null,
        "date": "2020/09/04",
        "description": "Detects the use of Windows Defender MpCmdRun.EXE to download files",
        "displayName": "File Download Via Windows Defender MpCmpRun.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/09",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"DownloadFile\" and ProcessCommandLine contains \"url\") and (ProcessVersionInfoOriginalFileName =~ \"MpCmdRun.exe\" or FolderPath endswith \"\\\\MpCmdRun.exe\" or ProcessCommandLine contains \"MpCmdRun.exe\" or ProcessVersionInfoFileDescription =~ \"Microsoft Malware Protection Command Line Utility\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1105",
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
