{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4931188c-178e-4ee7-a348-39e8a7a56821')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4931188c-178e-4ee7-a348-39e8a7a56821')]",
      "properties": {
        "alertRuleTemplateName": "4931188c-178e-4ee7-a348-39e8a7a56821",
        "author": "Nasreddine Bencherchali",
        "customDetails": null,
        "date": "2023/02/13",
        "description": "Detect filter driver unloading activity via fltmc.exe",
        "displayName": "Filter Driver Unloaded Via Fltmc.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/14",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"unload\" and (FolderPath endswith \"\\\\fltMC.exe\" or ProcessVersionInfoOriginalFileName =~ \"fltMC.exe\")) and (not(ProcessCommandLine endswith \"unload rtp_filesystem_filter\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1070",
          "T1562"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
