{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98')]",
      "properties": {
        "alertRuleTemplateName": "85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98",
        "author": "Nasreddine Bencherchali (Nextron Systems), frack113",
        "customDetails": null,
        "date": "2021/07/20",
        "description": "Detects PowerShell scripts that make use of the \"Compress-Archive\" Cmdlet in order to compress folders and files where the output is stored in a potentially suspicious location that is used often by malware for exfiltration.\nAn adversary might compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network.\n",
        "displayName": "Folder Compress To Potentially Suspicious Output Via Compress-Archive Cmdlet",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Compress-Archive -Path\" and ProcessCommandLine contains \"-DestinationPath $env:TEMP\") or (ProcessCommandLine contains \"Compress-Archive -Path\" and ProcessCommandLine contains \"-DestinationPath\" and ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\") or (ProcessCommandLine contains \"Compress-Archive -Path\" and ProcessCommandLine contains \"-DestinationPath\" and ProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "collection"
        ],
        "techniques": [
          "T1074"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
