{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f53714ec-5077-420e-ad20-907ff9bb2958')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f53714ec-5077-420e-ad20-907ff9bb2958')]",
      "properties": {
        "alertRuleTemplateName": "f53714ec-5077-420e-ad20-907ff9bb2958",
        "author": "Nasreddine Bencherchali (Nextron Systems), Anish Bogati",
        "customDetails": null,
        "date": "2024/01/05",
        "description": "Detects the execution of \"forfiles\" from a non-default location, in order to potentially spawn a custom \"cmd.exe\" from the current working directory.\n",
        "displayName": "Forfiles.EXE Child Process Masquerading",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine startswith \"/c echo \\\"\" and FolderPath endswith \"\\\\cmd.exe\" and (InitiatingProcessCommandLine endswith \".exe\" or InitiatingProcessCommandLine endswith \".exe\\\"\")) and (not(((FolderPath contains \":\\\\Windows\\\\System32\\\\\" or FolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\") and FolderPath endswith \"\\\\cmd.exe\" and (InitiatingProcessFolderPath contains \":\\\\Windows\\\\System32\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\") and InitiatingProcessFolderPath endswith \"\\\\forfiles.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1036"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
