{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/add64136-62e5-48ea-807e-88638d02df1e')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/add64136-62e5-48ea-807e-88638d02df1e')]",
      "properties": {
        "alertRuleTemplateName": "add64136-62e5-48ea-807e-88638d02df1e",
        "author": "Ecco, E.M. Anhaus, oscd.community",
        "customDetails": null,
        "date": "2019/09/26",
        "description": "Detects suspicious parameters of fsutil (deleting USN journal, configuring it with small size, etc).\nMight be used by ransomwares during the attack (seen by NotPetya and others).\n",
        "displayName": "Fsutil Suspicious Invocation",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/09/09",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"deletejournal\" or ProcessCommandLine contains \"createjournal\" or ProcessCommandLine contains \"setZeroData\") and (FolderPath endswith \"\\\\fsutil.exe\" or ProcessVersionInfoOriginalFileName =~ \"fsutil.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "stable",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Impact"
        ],
        "techniques": [
          "T1070",
          "T1485"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
