{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/204b17ae-4007-471b-917b-b917b315c5db')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/204b17ae-4007-471b-917b-b917b315c5db')]",
      "properties": {
        "alertRuleTemplateName": "204b17ae-4007-471b-917b-b917b315c5db",
        "author": "frack113 , X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2021/12/02",
        "description": "Detects execution of the \"del\" builtin command to remove files using greedy/wildcard expression. This is often used by malware to delete content of folders that perhaps contains the initial malware infection or to delete evidence.",
        "displayName": "Greedy File Deletion Using Del",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/09/11",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"del \" or ProcessCommandLine contains \"erase \") and (ProcessCommandLine contains \"\\\\*.au3\" or ProcessCommandLine contains \"\\\\*.dll\" or ProcessCommandLine contains \"\\\\*.exe\" or ProcessCommandLine contains \"\\\\*.js\") and (FolderPath endswith \"\\\\cmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"Cmd.Exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1070"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
