{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/055fb54c-a8f4-4aee-bd44-f74cf30a0d9d')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/055fb54c-a8f4-4aee-bd44-f74cf30a0d9d')]",
      "properties": {
        "alertRuleTemplateName": "055fb54c-a8f4-4aee-bd44-f74cf30a0d9d",
        "author": "Luca Di Bartolomeo (CrimpSec)",
        "customDetails": null,
        "date": "2024/01/29",
        "description": "Detects the execution of SharpMove, a .NET utility performing multiple tasks such as \"Task Creation\", \"SCM\" query, VBScript execution using WMI via its PE metadata and command line options.\n",
        "displayName": "HackTool - SharpMove Tool Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\SharpMove.exe\" or ProcessVersionInfoOriginalFileName =~ \"SharpMove.exe\") or ((ProcessCommandLine contains \"action=create\" or ProcessCommandLine contains \"action=dcom\" or ProcessCommandLine contains \"action=executevbs\" or ProcessCommandLine contains \"action=hijackdcom\" or ProcessCommandLine contains \"action=modschtask\" or ProcessCommandLine contains \"action=modsvc\" or ProcessCommandLine contains \"action=query\" or ProcessCommandLine contains \"action=scm\" or ProcessCommandLine contains \"action=startservice\" or ProcessCommandLine contains \"action=taskscheduler\") and ProcessCommandLine contains \"computername=\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1021"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
