{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/66e563f9-1cbd-4a22-a957-d8b7c0f44372')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/66e563f9-1cbd-4a22-a957-d8b7c0f44372')]",
      "properties": {
        "alertRuleTemplateName": "66e563f9-1cbd-4a22-a957-d8b7c0f44372",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/01/28",
        "description": "Detects suspicious use of XORDump process memory dumping utility",
        "displayName": "HackTool - XORDump Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/08",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\xordump.exe\" or (ProcessCommandLine contains \" -process lsass.exe \" or ProcessCommandLine contains \" -m comsvcs \" or ProcessCommandLine contains \" -m dbghelp \" or ProcessCommandLine contains \" -m dbgcore \")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003",
          "t1036"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
