{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a642964e-bead-4bed-8910-1bb4d63e3b4d')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a642964e-bead-4bed-8910-1bb4d63e3b4d')]",
      "properties": {
        "alertRuleTemplateName": "a642964e-bead-4bed-8910-1bb4d63e3b4d",
        "author": "Teymur Kheirkhabarov, oscd.community, David ANDRE (additional keywords), Tim Shelton",
        "customDetails": null,
        "date": "2019/10/22",
        "description": "Detection well-known mimikatz command line arguments",
        "displayName": "HackTool - Mimikatz Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"::aadcookie\" or ProcessCommandLine contains \"::detours\" or ProcessCommandLine contains \"::memssp\" or ProcessCommandLine contains \"::mflt\" or ProcessCommandLine contains \"::ncroutemon\" or ProcessCommandLine contains \"::ngcsign\" or ProcessCommandLine contains \"::printnightmare\" or ProcessCommandLine contains \"::skeleton\" or ProcessCommandLine contains \"::preshutdown\" or ProcessCommandLine contains \"::mstsc\" or ProcessCommandLine contains \"::multirdp\") or (ProcessCommandLine contains \"rpc::\" or ProcessCommandLine contains \"token::\" or ProcessCommandLine contains \"crypto::\" or ProcessCommandLine contains \"dpapi::\" or ProcessCommandLine contains \"sekurlsa::\" or ProcessCommandLine contains \"kerberos::\" or ProcessCommandLine contains \"lsadump::\" or ProcessCommandLine contains \"privilege::\" or ProcessCommandLine contains \"process::\" or ProcessCommandLine contains \"vault::\") or (ProcessCommandLine contains \"DumpCreds\" or ProcessCommandLine contains \"mimikatz\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
