{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7a4d9232-92fc-404d-8ce1-4c92e7caf539')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7a4d9232-92fc-404d-8ce1-4c92e7caf539')]",
      "properties": {
        "alertRuleTemplateName": "7a4d9232-92fc-404d-8ce1-4c92e7caf539",
        "author": "pH-T (Nextron Systems)",
        "customDetails": null,
        "date": "2023/04/17",
        "description": "Detects Stracciatella which executes a Powershell runspace from within C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled based on PE metadata characteristics.",
        "displayName": "HackTool - Stracciatella Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\Stracciatella.exe\" or ProcessVersionInfoOriginalFileName =~ \"Stracciatella.exe\" or ProcessVersionInfoFileDescription =~ \"Stracciatella\" or (SHA256 startswith \"9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\" or SHA256 startswith \"fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\") or (SHA256 in~ (\"9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\", \"fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059",
          "T1562"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
