{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6f8b3439-a203-45dc-a88b-abf57ea15ccf')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6f8b3439-a203-45dc-a88b-abf57ea15ccf')]",
      "properties": {
        "alertRuleTemplateName": "6f8b3439-a203-45dc-a88b-abf57ea15ccf",
        "author": "Thomas Patzke",
        "customDetails": null,
        "date": "2020/05/22",
        "description": "The CrachMapExec pentesting framework implements a PowerShell obfuscation with some static strings detected by this rule.",
        "displayName": "HackTool - CrackMapExec PowerShell Obfuscation",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"join\" and ProcessCommandLine contains \"split\") or ProcessCommandLine contains \"( $ShellId[1]+$ShellId[13]+'x')\" or (ProcessCommandLine contains \"( $PSHome[\" and ProcessCommandLine contains \"]+$PSHOME[\" and ProcessCommandLine contains \"]+\") or ProcessCommandLine contains \"( $env:Public[13]+$env:Public[5]+'x')\" or (ProcessCommandLine contains \"( $env:ComSpec[4,\" and ProcessCommandLine contains \",25]-Join'')\") or ProcessCommandLine contains \"[1,3]+'x'-Join'')\") and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1027",
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
