{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c484e533-ee16-4a93-b6ac-f0ea4868b2f1')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c484e533-ee16-4a93-b6ac-f0ea4868b2f1')]",
      "properties": {
        "alertRuleTemplateName": "c484e533-ee16-4a93-b6ac-f0ea4868b2f1",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/08/20",
        "description": "Detects the use of SharpUp, a tool for local privilege escalation",
        "displayName": "HackTool - SharpUp PrivEsc Tool Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/13",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\SharpUp.exe\" or ProcessVersionInfoFileDescription =~ \"SharpUp\" or (ProcessCommandLine contains \"HijackablePaths\" or ProcessCommandLine contains \"UnquotedServicePath\" or ProcessCommandLine contains \"ProcessDLLHijack\" or ProcessCommandLine contains \"ModifiableServiceBinaries\" or ProcessCommandLine contains \"ModifiableScheduledTask\" or ProcessCommandLine contains \"DomainGPPPassword\" or ProcessCommandLine contains \"CachedGPPPassword\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "critical",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1569",
          "T1574",
          "T1615"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
