{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/79f4ede3-402e-41c8-bc3e-ebbf5f162581')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/79f4ede3-402e-41c8-bc3e-ebbf5f162581')]",
      "properties": {
        "alertRuleTemplateName": "79f4ede3-402e-41c8-bc3e-ebbf5f162581",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2019/04/20",
        "description": "Detects suspicious powershell command line parameters used in Empire",
        "displayName": "HackTool - Empire PowerShell Launch Parameters",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" -NoP -sta -NonI -W Hidden -Enc \" or ProcessCommandLine contains \" -noP -sta -w 1 -enc \" or ProcessCommandLine contains \" -NoP -NonI -W Hidden -enc \" or ProcessCommandLine contains \" -noP -sta -w 1 -enc\" or ProcessCommandLine contains \" -enc  SQB\" or ProcessCommandLine contains \" -nop -exec bypass -EncodedCommand \"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
