{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/39b31e81-5f5f-4898-9c0e-2160cfc0f9bf')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/39b31e81-5f5f-4898-9c0e-2160cfc0f9bf')]",
      "properties": {
        "alertRuleTemplateName": "39b31e81-5f5f-4898-9c0e-2160cfc0f9bf",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/12/27",
        "description": "Execute Hashcat.exe with provided SAM file from registry of Windows and Password list to crack against",
        "displayName": "HackTool - Hashcat Password Cracker Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/04",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-a \" and ProcessCommandLine contains \"-m 1000 \" and ProcessCommandLine contains \"-r \") or FolderPath endswith \"\\\\hashcat.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1110"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
