{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f89b08d0-77ad-4728-817b-9b16c5a69c7a')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f89b08d0-77ad-4728-817b-9b16c5a69c7a')]",
      "properties": {
        "alertRuleTemplateName": "f89b08d0-77ad-4728-817b-9b16c5a69c7a",
        "author": "Sai Prashanth Pulisetti @pulisettis, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/12/27",
        "description": "Detects execution of the SharpImpersonation tool. Which can be used to manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively",
        "displayName": "HackTool - SharpImpersonation Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/13",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" user:\" and ProcessCommandLine contains \" binary:\") or (ProcessCommandLine contains \" user:\" and ProcessCommandLine contains \" shellcode:\") or (ProcessCommandLine contains \" technique:CreateProcessAsUserW\" or ProcessCommandLine contains \" technique:ImpersonateLoggedOnuser\")) or (FolderPath endswith \"\\\\SharpImpersonation.exe\" or ProcessVersionInfoOriginalFileName =~ \"SharpImpersonation.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1134"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
