{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/058f4380-962d-40a5-afce-50207d36d7e2')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/058f4380-962d-40a5-afce-50207d36d7e2')]",
      "properties": {
        "alertRuleTemplateName": "058f4380-962d-40a5-afce-50207d36d7e2",
        "author": "Thomas Patzke",
        "customDetails": null,
        "date": "2020/05/22",
        "description": "Detects various execution patterns of the CrackMapExec pentesting framework",
        "displayName": "HackTool - CrackMapExec Execution Patterns",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/06",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"cmd.exe /Q /c \" and ProcessCommandLine contains \" 1> \\\\\" and ProcessCommandLine contains \"\\\\\" and ProcessCommandLine contains \"\\\\\" and ProcessCommandLine contains \" 2>&1\") or (ProcessCommandLine contains \"cmd.exe /C \" and ProcessCommandLine contains \" > \\\\\" and ProcessCommandLine contains \"\\\\\" and ProcessCommandLine contains \"\\\\\" and ProcessCommandLine contains \" 2>&1\") or (ProcessCommandLine contains \"cmd.exe /C \" and ProcessCommandLine contains \" > \" and ProcessCommandLine contains \"\\\\Temp\\\\\" and ProcessCommandLine contains \" 2>&1\") or ProcessCommandLine contains \"powershell.exe -exec bypass -noni -nop -w 1 -C \\\"\" or ProcessCommandLine contains \"powershell.exe -noni -nop -w 1 -enc \"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "stable",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1047",
          "t1053",
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
