{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6938366d-8954-4ddc-baff-c830b3ba8fcd')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6938366d-8954-4ddc-baff-c830b3ba8fcd')]",
      "properties": {
        "alertRuleTemplateName": "6938366d-8954-4ddc-baff-c830b3ba8fcd",
        "author": "pH-T (Nextron Systems)",
        "customDetails": null,
        "date": "2023/04/17",
        "description": "Detects Certipy a tool for Active Directory Certificate Services enumeration and abuse based on PE metadata characteristics and common command line arguments.",
        "displayName": "HackTool - Certipy Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\Certipy.exe\" or ProcessVersionInfoOriginalFileName =~ \"Certipy.exe\" or ProcessVersionInfoFileDescription contains \"Certipy\") or ((ProcessCommandLine contains \" auth \" or ProcessCommandLine contains \" find \" or ProcessCommandLine contains \" forge \" or ProcessCommandLine contains \" relay \" or ProcessCommandLine contains \" req \" or ProcessCommandLine contains \" shadow \") and (ProcessCommandLine contains \" -bloodhound\" or ProcessCommandLine contains \" -ca-pfx \" or ProcessCommandLine contains \" -dc-ip \" or ProcessCommandLine contains \" -kirbi\" or ProcessCommandLine contains \" -old-bloodhound\" or ProcessCommandLine contains \" -pfx \" or ProcessCommandLine contains \" -target\" or ProcessCommandLine contains \" -username \" or ProcessCommandLine contains \" -vulnerable\" or ProcessCommandLine contains \"auth -pfx\" or ProcessCommandLine contains \"shadow auto\" or ProcessCommandLine contains \"shadow list\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "T1649"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
