{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d557dc06-62e8-4468-a8e8-7984124908ce')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d557dc06-62e8-4468-a8e8-7984124908ce')]",
      "properties": {
        "alertRuleTemplateName": "d557dc06-62e8-4468-a8e8-7984124908ce",
        "author": "Swachchhanda Shrawan Poudel",
        "customDetails": null,
        "date": "2023/12/04",
        "description": "Detects commandline keywords indicative of potential usge of the tool WinPwn. A tool for Windows and Active Directory reconnaissance and exploitation.\n",
        "displayName": "HackTool - WinPwn Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"Offline_Winpwn\" or ProcessCommandLine contains \"WinPwn \" or ProcessCommandLine contains \"WinPwn.exe\" or ProcessCommandLine contains \"WinPwn.ps1\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery",
          "execution"
        ],
        "techniques": [
          "T1046",
          "T1082",
          "T1106",
          "T1518",
          "T1548",
          "T1552",
          "T1555"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
