{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0a99eb3e-1617-41bd-b095-13dc767f3def')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0a99eb3e-1617-41bd-b095-13dc767f3def')]",
      "properties": {
        "alertRuleTemplateName": "0a99eb3e-1617-41bd-b095-13dc767f3def",
        "author": "Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)",
        "customDetails": null,
        "date": "2022/05/24",
        "description": "Detects the use of Jlaive to execute assemblies in a copied PowerShell",
        "displayName": "HackTool - Jlaive In-Memory Assembly Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/22",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessCommandLine endswith \".bat\" and InitiatingProcessFolderPath endswith \"\\\\cmd.exe\") and (((ProcessCommandLine contains \"powershell.exe\" and ProcessCommandLine contains \".bat.exe\") and FolderPath endswith \"\\\\xcopy.exe\") or ((ProcessCommandLine contains \"pwsh.exe\" and ProcessCommandLine contains \".bat.exe\") and FolderPath endswith \"\\\\xcopy.exe\") or ((ProcessCommandLine contains \"+s\" and ProcessCommandLine contains \"+h\" and ProcessCommandLine contains \".bat.exe\") and FolderPath endswith \"\\\\attrib.exe\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
