{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/42b1a5b8-353f-4f10-b256-39de4467faff')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/42b1a5b8-353f-4f10-b256-39de4467faff')]",
      "properties": {
        "alertRuleTemplateName": "42b1a5b8-353f-4f10-b256-39de4467faff",
        "author": "Andreas Hunkeler (@Karneades), oscd.community",
        "customDetails": null,
        "date": "2020/04/20",
        "description": "Detect the harvesting of wifi credentials using netsh.exe",
        "displayName": "Harvesting Of Wifi Credentials Via Netsh.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"wlan\" and ProcessCommandLine contains \" s\" and ProcessCommandLine contains \" p\" and ProcessCommandLine contains \" k\" and ProcessCommandLine contains \"=clear\") and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "t1040"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
