{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/30e92f50-bb5a-4884-98b5-d20aa80f3d7a')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/30e92f50-bb5a-4884-98b5-d20aa80f3d7a')]",
      "properties": {
        "alertRuleTemplateName": "30e92f50-bb5a-4884-98b5-d20aa80f3d7a",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/02/06",
        "description": "Detects events that appear when a user click on a link file with a powershell command in it",
        "displayName": "Hidden Powershell in Link File Pattern",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"powershell\" and ProcessCommandLine contains \".lnk\") and FolderPath =~ \"C:\\\\Windows\\\\System32\\\\cmd.exe\" and InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\explorer.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
