{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cb9cc1d1-e84e-4bdc-b7ad-c31b1b7908ec')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cb9cc1d1-e84e-4bdc-b7ad-c31b1b7908ec')]",
      "properties": {
        "alertRuleTemplateName": "cb9cc1d1-e84e-4bdc-b7ad-c31b1b7908ec",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/06/30",
        "description": "Detects execution of \"curl.exe\" with the \"--insecure\" flag.",
        "displayName": "Insecure Transfer Via Curl.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine matches regex \"\\\\s-k\\\\s\" or ProcessCommandLine contains \"--insecure\") and (FolderPath endswith \"\\\\curl.exe\" or ProcessVersionInfoOriginalFileName =~ \"curl.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
