{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b222df08-0e07-11eb-adc1-0242ac120002')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b222df08-0e07-11eb-adc1-0242ac120002')]",
      "properties": {
        "alertRuleTemplateName": "b222df08-0e07-11eb-adc1-0242ac120002",
        "author": "Jonathan Cheong, oscd.community",
        "customDetails": null,
        "date": "2020/10/13",
        "description": "Detects Obfuscated use of Clip.exe to execute PowerShell",
        "displayName": "Invoke-Obfuscation CLIP+ Launcher",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/11/17",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/c\" or ProcessCommandLine contains \"/r\") and (ProcessCommandLine contains \"cmd\" and ProcessCommandLine contains \"&&\" and ProcessCommandLine contains \"clipboard]::\" and ProcessCommandLine contains \"-f\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1027",
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
