{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e9f55347-2928-4c06-88e5-1a7f8169942e')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e9f55347-2928-4c06-88e5-1a7f8169942e')]",
      "properties": {
        "alertRuleTemplateName": "e9f55347-2928-4c06-88e5-1a7f8169942e",
        "author": "Timur Zinniatullin, oscd.community",
        "customDetails": null,
        "date": "2020/10/13",
        "description": "Detects Obfuscated Powershell via VAR++ LAUNCHER",
        "displayName": "Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/11/16",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"{0}\" or ProcessCommandLine contains \"{1}\" or ProcessCommandLine contains \"{2}\" or ProcessCommandLine contains \"{3}\" or ProcessCommandLine contains \"{4}\" or ProcessCommandLine contains \"{5}\") and (ProcessCommandLine contains \"&&set\" and ProcessCommandLine contains \"cmd\" and ProcessCommandLine contains \"/c\" and ProcessCommandLine contains \"-f\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1027",
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
