{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e1561947-b4e3-4a74-9bdd-83baed21bdb5')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e1561947-b4e3-4a74-9bdd-83baed21bdb5')]",
      "properties": {
        "alertRuleTemplateName": "e1561947-b4e3-4a74-9bdd-83baed21bdb5",
        "author": "Nikita Nazarov, oscd.community",
        "customDetails": null,
        "date": "2020/10/09",
        "description": "Detects Obfuscated Powershell via use Clip.exe in Scripts",
        "displayName": "Invoke-Obfuscation Via Use Clip",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/04/15",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine matches regex \"(?i)echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?)\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1027",
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
