{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8f88e3f6-2a49-48f5-a5c4-2f7eedf78710')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8f88e3f6-2a49-48f5-a5c4-2f7eedf78710')]",
      "properties": {
        "alertRuleTemplateName": "8f88e3f6-2a49-48f5-a5c4-2f7eedf78710",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2019/01/16",
        "description": "Detects a JAVA process running with remote debugging allowing more than just localhost to connect",
        "displayName": "Java Running with Remote Debugging",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/01",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"transport=dt_socket,address=\" and (ProcessCommandLine contains \"jre1.\" or ProcessCommandLine contains \"jdk1.\")) and (not((ProcessCommandLine contains \"address=127.0.0.1\" or ProcessCommandLine contains \"address=localhost\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1203"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
