{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/34275eb8-fa19-436b-b959-3d9ecd53fa1f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/34275eb8-fa19-436b-b959-3d9ecd53fa1f')]",
      "properties": {
        "alertRuleTemplateName": "34275eb8-fa19-436b-b959-3d9ecd53fa1f",
        "author": "Swachchhanda Shrawan Poudel",
        "customDetails": null,
        "date": "2024/02/12",
        "description": "Detects the enumeration of a specific DLL or EXE being used by a binary via \"tasklist.exe\".\nThis is often used by attackers in order to find the specific process identifier (PID) that is using the DLL in question.\nIn order to dump the process memory or perform other nefarious actions.\n",
        "displayName": "Loaded Module Enumeration Via Tasklist.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-m\" or ProcessCommandLine contains \"/m\") and (FolderPath endswith \"\\\\tasklist.exe\" or ProcessVersionInfoOriginalFileName =~ \"tasklist.exe\") and ProcessCommandLine contains \"rdpcorets.dll\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [],
        "techniques": [
          "T1003"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
