{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fe63010f-8823-4864-a96b-a7b4a0f7b929')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fe63010f-8823-4864-a96b-a7b4a0f7b929')]",
      "properties": {
        "alertRuleTemplateName": "fe63010f-8823-4864-a96b-a7b4a0f7b929",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/08/12",
        "description": "Detects findstring commands that include the keyword lsass, which indicates recon actviity for the LSASS process PID",
        "displayName": "LSASS Process Reconnaissance Via Findstr.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/11",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"lsass\" and ((FolderPath endswith \"\\\\find.exe\" or FolderPath endswith \"\\\\findstr.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"FIND.EXE\", \"FINDSTR.EXE\")))) or (ProcessCommandLine contains \" /i \\\"lsass\" or ProcessCommandLine contains \" /i lsass.exe\" or ProcessCommandLine contains \"findstr \\\"lsass\" or ProcessCommandLine contains \"findstr lsass\" or ProcessCommandLine contains \"findstr.exe \\\"lsass\" or ProcessCommandLine contains \"findstr.exe lsass\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1552"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
