{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/15c7904e-6ad1-4a45-9b46-5fb25df37fd2')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/15c7904e-6ad1-4a45-9b46-5fb25df37fd2')]",
      "properties": {
        "alertRuleTemplateName": "15c7904e-6ad1-4a45-9b46-5fb25df37fd2",
        "author": "Agro (@agro_sev), Ensar Şamil (@sblmsrsn), oscd.community",
        "customDetails": null,
        "date": "2020/10/14",
        "description": "There is an option for a MS VS Just-In-Time Debugger \"vsjitdebugger.exe\" to launch specified executable and attach a debugger.\nThis option may be used adversaries to execute malicious code by signed verified binary.\nThe debugger is installed alongside with Microsoft Visual Studio package.\n",
        "displayName": "Malicious PE Execution by Microsoft Visual Studio Debugger",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\vsjitdebugger.exe\" and (not(((FolderPath contains \"\\\\vsimmersiveactivatehelper\" and FolderPath contains \".exe\") or FolderPath endswith \"\\\\devenv.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
