{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9f2cc74d-78af-4eb2-bb64-9cd1d292b87b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9f2cc74d-78af-4eb2-bb64-9cd1d292b87b')]",
      "properties": {
        "alertRuleTemplateName": "9f2cc74d-78af-4eb2-bb64-9cd1d292b87b",
        "author": "elhoim",
        "customDetails": null,
        "date": "2022/04/28",
        "description": "Detects suspicious connections from Microsoft Sync Center to non-private IPs.",
        "displayName": "Microsoft Sync Center Suspicious Network Connections",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "2024/03/12",
        "query": "DeviceNetworkEvents\n| where InitiatingProcessFolderPath endswith \"\\\\mobsync.exe\" and (not((ipv4_is_in_range(RemoteIP, \"127.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"10.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"172.16.0.0/12\") or ipv4_is_in_range(RemoteIP, \"192.168.0.0/16\") or ipv4_is_in_range(RemoteIP, \"169.254.0.0/16\") or ipv4_is_in_range(RemoteIP, \"::1/128\") or ipv4_is_in_range(RemoteIP, \"fe80::/10\") or ipv4_is_in_range(RemoteIP, \"fc00::/7\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1055",
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
