{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2d3cdeec-c0db-45b4-aa86-082f7eb75701')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2d3cdeec-c0db-45b4-aa86-082f7eb75701')]",
      "properties": {
        "alertRuleTemplateName": "2d3cdeec-c0db-45b4-aa86-082f7eb75701",
        "author": "Tim Rauch, Janantha Marasinghe, Elastic (original idea)",
        "customDetails": null,
        "date": "2022/11/08",
        "description": "Detects the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords",
        "displayName": "Microsoft IIS Service Account Password Dumped",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/22",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"list \" and (FolderPath endswith \"\\\\appcmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"appcmd.exe\")) and ((ProcessCommandLine contains \" /config\" or ProcessCommandLine contains \" /xml\" or ProcessCommandLine contains \" -config\" or ProcessCommandLine contains \" -xml\") or ((ProcessCommandLine contains \" /@t\" or ProcessCommandLine contains \" /text\" or ProcessCommandLine contains \" /show\" or ProcessCommandLine contains \" -@t\" or ProcessCommandLine contains \" -text\" or ProcessCommandLine contains \" -show\") and (ProcessCommandLine contains \":*\" or ProcessCommandLine contains \"password\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
