{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/419dbf2b-8a9b-4bea-bf99-7544b050ec8d')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/419dbf2b-8a9b-4bea-bf99-7544b050ec8d')]",
      "properties": {
        "alertRuleTemplateName": "419dbf2b-8a9b-4bea-bf99-7544b050ec8d",
        "author": "Nik Seetharaman, frack113",
        "customDetails": null,
        "date": "2019/01/16",
        "description": "Detects invocation of Microsoft Workflow Compiler, which may permit the execution of arbitrary unsigned code.",
        "displayName": "Microsoft Workflow Compiler Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/03",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\Microsoft.Workflow.Compiler.exe\" or ProcessVersionInfoOriginalFileName =~ \"Microsoft.Workflow.Compiler.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1127",
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
