{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ada4b0c4-758b-46ac-9033-9004613a150d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ada4b0c4-758b-46ac-9033-9004613a150d')]",
      "properties": {
        "alertRuleTemplateName": "ada4b0c4-758b-46ac-9033-9004613a150d",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/08/19",
        "description": "Detect malicious GPO modifications can be used to implement many other malicious behaviors.",
        "displayName": "Modify Group Policy Settings",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"GroupPolicyRefreshTimeDC\" or ProcessCommandLine contains \"GroupPolicyRefreshTimeOffsetDC\" or ProcessCommandLine contains \"GroupPolicyRefreshTime\" or ProcessCommandLine contains \"GroupPolicyRefreshTimeOffset\" or ProcessCommandLine contains \"EnableSmartScreen\" or ProcessCommandLine contains \"ShellSmartScreenLevel\") and ProcessCommandLine contains \"\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\System\" and (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1484"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
