{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/347906f3-e207-4d18-ae5b-a9403d6bcdef')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/347906f3-e207-4d18-ae5b-a9403d6bcdef')]",
      "properties": {
        "alertRuleTemplateName": "347906f3-e207-4d18-ae5b-a9403d6bcdef",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/01/09",
        "description": "Adversaries may modify system firewalls in order to bypass controls limiting network usage",
        "displayName": "Netsh Allow Group Policy on Microsoft Defender Firewall",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/14",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"advfirewall\" and ProcessCommandLine contains \"firewall\" and ProcessCommandLine contains \"set\" and ProcessCommandLine contains \"rule\" and ProcessCommandLine contains \"group=\" and ProcessCommandLine contains \"new\" and ProcessCommandLine contains \"enable=Yes\") and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1562"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
