{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e6313acd-208c-44fc-a0ff-db85d572e90e')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e6313acd-208c-44fc-a0ff-db85d572e90e')]",
      "properties": {
        "alertRuleTemplateName": "e6313acd-208c-44fc-a0ff-db85d572e90e",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/02/07",
        "description": "Detects a set of suspicious network related commands often used in recon stages",
        "displayName": "Network Reconnaissance Activity",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"nslookup\" and ProcessCommandLine contains \"_ldap._tcp.dc._msdcs.\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "t1082",
          "t1087"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
