{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4')]",
      "properties": {
        "alertRuleTemplateName": "9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4",
        "author": "Kamran Saifullah",
        "customDetails": null,
        "date": "2023/11/20",
        "description": "Detects network connections to Devtunnels domains initiated by a process on a system. Attackers can abuse that feature to establish a reverse shell or persistence on a machine.\n",
        "displayName": "Network Connection Initiated To DevTunnels Domain",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceNetworkEvents\n| where RemoteUrl endswith \".devtunnels.ms\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "exfiltration"
        ],
        "techniques": [
          "t1567"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
