{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7cd1dcdc-6edf-4896-86dc-d1f19ad64903')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7cd1dcdc-6edf-4896-86dc-d1f19ad64903')]",
      "properties": {
        "alertRuleTemplateName": "7cd1dcdc-6edf-4896-86dc-d1f19ad64903",
        "author": "Kamran Saifullah, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2024/05/27",
        "description": "Detects network connections to Cloudflared tunnels domains initiated by a process on the system.\nAttackers can abuse that feature to establish a reverse shell or persistence on a machine.\n",
        "displayName": "Network Connection Initiated To Cloudflared Tunnels Domains",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceNetworkEvents\n| where RemoteUrl endswith \".v2.argotunnel.com\" or RemoteUrl endswith \"protocol-v2.argotunnel.com\" or RemoteUrl endswith \"trycloudflare.com\" or RemoteUrl endswith \"update.argotunnel.com\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "exfiltration"
        ],
        "techniques": [
          "T1567"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
