{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c7e91a02-d771-4a6d-a700-42587e0b1095')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c7e91a02-d771-4a6d-a700-42587e0b1095')]",
      "properties": {
        "alertRuleTemplateName": "c7e91a02-d771-4a6d-a700-42587e0b1095",
        "author": "Dmitriy Lifanov, oscd.community",
        "customDetails": null,
        "date": "2019/10/25",
        "description": "Detects a network connection initiated by \"Regsvr32.exe\"",
        "displayName": "Network Connection Initiated By Regsvr32.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "2023/09/18",
        "query": "DeviceNetworkEvents\n| where InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1218",
          "T1559"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
