{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97')]",
      "properties": {
        "alertRuleTemplateName": "e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97",
        "author": "Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2018/08/30",
        "description": "Detects executables located in potentially suspicious directories initiating network connections towards file sharing domains.",
        "displayName": "Network Communication Initiated To File Sharing Domains From Process Located In Suspicious Folder",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "2024/05/31",
        "query": "DeviceNetworkEvents\n| where (RemoteUrl endswith \".githubusercontent.com\" or RemoteUrl endswith \"anonfiles.com\" or RemoteUrl endswith \"cdn.discordapp.com\" or RemoteUrl endswith \"cdn.discordapp.com/attachments/\" or RemoteUrl endswith \"ddns.net\" or RemoteUrl endswith \"dl.dropboxusercontent.com\" or RemoteUrl endswith \"ghostbin.co\" or RemoteUrl endswith \"glitch.me\" or RemoteUrl endswith \"gofile.io\" or RemoteUrl endswith \"hastebin.com\" or RemoteUrl endswith \"mediafire.com\" or RemoteUrl endswith \"mega.co.nz\" or RemoteUrl endswith \"mega.nz\" or RemoteUrl endswith \"onrender.com\" or RemoteUrl endswith \"paste.ee\" or RemoteUrl endswith \"pastebin.com\" or RemoteUrl endswith \"pastebin.pl\" or RemoteUrl endswith \"pastetext.net\" or RemoteUrl endswith \"privatlab.com\" or RemoteUrl endswith \"privatlab.net\" or RemoteUrl endswith \"send.exploit.in\" or RemoteUrl endswith \"sendspace.com\" or RemoteUrl endswith \"storage.googleapis.com\" or RemoteUrl endswith \"storjshare.io\" or RemoteUrl endswith \"supabase.co\" or RemoteUrl endswith \"temp.sh\" or RemoteUrl endswith \"transfer.sh\" or RemoteUrl endswith \"ufile.io\") and (InitiatingProcessFolderPath contains \":\\\\$Recycle.bin\" or InitiatingProcessFolderPath contains \":\\\\Perflogs\\\\\" or InitiatingProcessFolderPath contains \":\\\\Temp\\\\\" or InitiatingProcessFolderPath contains \":\\\\Users\\\\Default\\\\\" or InitiatingProcessFolderPath contains \":\\\\Users\\\\Public\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\Fonts\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\IME\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\Tasks\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\Temp\\\\\" or InitiatingProcessFolderPath contains \"\\\\AppData\\\\Temp\\\\\" or InitiatingProcessFolderPath contains \"\\\\config\\\\systemprofile\\\\\" or InitiatingProcessFolderPath contains \"\\\\Windows\\\\addins\\\\\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1105"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
