{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ebef4391-1a81-4761-a40a-1db446c0e625')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ebef4391-1a81-4761-a40a-1db446c0e625')]",
      "properties": {
        "alertRuleTemplateName": "ebef4391-1a81-4761-a40a-1db446c0e625",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/06/25",
        "description": "Detects WMIC executions in which an event consumer gets created. This could be used to establish persistence",
        "displayName": "New ActiveScriptEventConsumer Created Via Wmic.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/14",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"ActiveScriptEventConsumer\" and ProcessCommandLine contains \" CREATE \"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence"
        ],
        "techniques": [
          "T1546"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
