{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/431a1fdb-4799-4f3b-91c3-a683b003fc49')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/431a1fdb-4799-4f3b-91c3-a683b003fc49')]",
      "properties": {
        "alertRuleTemplateName": "431a1fdb-4799-4f3b-91c3-a683b003fc49",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/07/14",
        "description": "Detects creation of a new service (kernel driver) with the type \"kernel\"",
        "displayName": "New Kernel Driver Via SC.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/08/08",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"create\" or ProcessCommandLine contains \"config\") and (ProcessCommandLine contains \"binPath\" and ProcessCommandLine contains \"type\" and ProcessCommandLine contains \"kernel\") and FolderPath endswith \"\\\\sc.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1543"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
