{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c')]",
      "properties": {
        "alertRuleTemplateName": "cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c",
        "author": "Markus Neis, Sander Wiebing",
        "customDetails": null,
        "date": "2019/01/29",
        "description": "Detects the addition of a new rule to the Windows firewall via netsh",
        "displayName": "New Firewall Rule Added Via Netsh.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/10",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" firewall \" and ProcessCommandLine contains \" add \") and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")) and (not(((ProcessCommandLine contains \"advfirewall firewall add rule name=Dropbox dir=in action=allow \\\"program=\" and ProcessCommandLine contains \":\\\\Program Files (x86)\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\" enable=yes profile=Any\") or (ProcessCommandLine contains \"advfirewall firewall add rule name=Dropbox dir=in action=allow \\\"program=\" and ProcessCommandLine contains \":\\\\Program Files\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\" enable=yes profile=Any\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1562"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
