{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cd219ff3-fa99-45d4-8380-a7d15116c6dc')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cd219ff3-fa99-45d4-8380-a7d15116c6dc')]",
      "properties": {
        "alertRuleTemplateName": "cd219ff3-fa99-45d4-8380-a7d15116c6dc",
        "author": "Endgame, JHasenbusch (adapted to Sigma for oscd.community)",
        "customDetails": null,
        "date": "2018/10/30",
        "description": "Identifies the creation of local users via the net.exe command.",
        "displayName": "New User Created Via Net.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"user\" and ProcessCommandLine contains \"add\") and ((FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\net1.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"net.exe\", \"net1.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1136"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
