{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/df1f26d3-bea7-4700-9ea2-ad3e990cf90e')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/df1f26d3-bea7-4700-9ea2-ad3e990cf90e')]",
      "properties": {
        "alertRuleTemplateName": "df1f26d3-bea7-4700-9ea2-ad3e990cf90e",
        "author": "Max Altgelt (Nextron Systems)",
        "customDetails": null,
        "date": "2022/04/06",
        "description": "Detects the execution of other scripts using the Node executable packaged with Adobe Creative Cloud",
        "displayName": "Node Process Executions",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\Adobe Creative Cloud Experience\\\\libs\\\\node.exe\" and (not(ProcessCommandLine contains \"Adobe Creative Cloud Experience\\\\js\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1059",
          "t1127"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
