{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f4bbd493-b796-416e-bbf2-121235348529')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f4bbd493-b796-416e-bbf2-121235348529')]",
      "properties": {
        "alertRuleTemplateName": "f4bbd493-b796-416e-bbf2-121235348529",
        "author": "Roberto Rodriguez @Cyb3rWard0g (rule), oscd.community (improvements)",
        "customDetails": null,
        "date": "2019/09/12",
        "description": "Detects non-interactive PowerShell activity by looking at the \"powershell\" process with a non-user GUI process such as \"explorer.exe\" as a parent.",
        "displayName": "Non Interactive PowerShell Process Spawned",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/09/07",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and (not(((InitiatingProcessFolderPath endswith \":\\\\Windows\\\\explorer.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\CompatTelRunner.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\explorer.exe\") or InitiatingProcessFolderPath =~ \":\\\\$WINDOWS.~BT\\\\Sources\\\\SetupHost.exe\"))) and (not(((InitiatingProcessFolderPath contains \":\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal_\" and InitiatingProcessFolderPath endswith \"\\\\WindowsTerminal.exe\") or (InitiatingProcessCommandLine contains \" --ms-enable-electron-run-as-node \" and InitiatingProcessFolderPath endswith \"\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "low",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
