{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2')]",
      "properties": {
        "alertRuleTemplateName": "bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/03/05",
        "description": "Detects command that type the content of ntdll.dll to a different file or a pipe in order to evade AV / EDR detection. As seen being used in the POC NtdllPipe",
        "displayName": "NtdllPipe Like Activity Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/07",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"type %windir%\\\\system32\\\\ntdll.dll\" or ProcessCommandLine contains \"type %systemroot%\\\\system32\\\\ntdll.dll\" or ProcessCommandLine contains \"type c:\\\\windows\\\\system32\\\\ntdll.dll\" or ProcessCommandLine contains \"\\\\ntdll.dll > \\\\\\\\.\\\\pipe\\\\\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
