{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ed74fe75-7594-4b4b-ae38-e38e3fd2eb23')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ed74fe75-7594-4b4b-ae38-e38e3fd2eb23')]",
      "properties": {
        "alertRuleTemplateName": "ed74fe75-7594-4b4b-ae38-e38e3fd2eb23",
        "author": "Markus Neis",
        "customDetails": null,
        "date": "2019/05/15",
        "description": "Detects Non-Standard tools initiating a connection over port 3389 indicating possible lateral movement.\nAn initial baseline is required before using this utility to exclude third party RDP tooling that you might use.\n",
        "displayName": "Outbound RDP Connections Over Non-Standard Tools",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "2024/02/09",
        "query": "DeviceNetworkEvents\n| where RemotePort == 3389 and (not((InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\System32\\\\mstsc.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\mstsc.exe\")))) and (not(((InitiatingProcessFolderPath endswith \"\\\\Avast Software\\\\Avast\\\\AvastSvc.exe\" or InitiatingProcessFolderPath endswith \"\\\\Avast\\\\AvastSvc.exe\") or InitiatingProcessFolderPath =~ \"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\" or (InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\dns.exe\" and Protocol =~ \"udp\" and LocalPort == 53) or InitiatingProcessFolderPath =~ \"\" or InitiatingProcessFolderPath =~ \"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\" or isnull(InitiatingProcessFolderPath) or InitiatingProcessFolderPath endswith \"\\\\Ranger\\\\SentinelRanger.exe\" or InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\SplunkUniversalForwarder\\\\bin\\\\\" or InitiatingProcessFolderPath endswith \"\\\\RDCMan.exe\" or (InitiatingProcessFolderPath endswith \"\\\\FSAssessment.exe\" or InitiatingProcessFolderPath endswith \"\\\\FSDiscovery.exe\" or InitiatingProcessFolderPath endswith \"\\\\MobaRTE.exe\" or InitiatingProcessFolderPath endswith \"\\\\mRemote.exe\" or InitiatingProcessFolderPath endswith \"\\\\mRemoteNG.exe\" or InitiatingProcessFolderPath endswith \"\\\\Passwordstate.exe\" or InitiatingProcessFolderPath endswith \"\\\\RemoteDesktopManager.exe\" or InitiatingProcessFolderPath endswith \"\\\\RemoteDesktopManager64.exe\" or InitiatingProcessFolderPath endswith \"\\\\RemoteDesktopManagerFree.exe\" or InitiatingProcessFolderPath endswith \"\\\\RSSensor.exe\" or InitiatingProcessFolderPath endswith \"\\\\RTS2App.exe\" or InitiatingProcessFolderPath endswith \"\\\\RTSApp.exe\" or InitiatingProcessFolderPath endswith \"\\\\spiceworks-finder.exe\" or InitiatingProcessFolderPath endswith \"\\\\Terminals.exe\" or InitiatingProcessFolderPath endswith \"\\\\ws_TunnelService.exe\") or (InitiatingProcessFolderPath endswith \"\\\\thor.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor64.exe\") or (InitiatingProcessFolderPath in~ (\"C:\\\\Program Files\\\\TSplus\\\\Java\\\\bin\\\\HTML5service.exe\", \"C:\\\\Program Files (x86)\\\\TSplus\\\\Java\\\\bin\\\\HTML5service.exe\")) or InitiatingProcessFolderPath =~ \"<unknown process>\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1021"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
