{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/69bd9b97-2be2-41b6-9816-fb08757a4d1a')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/69bd9b97-2be2-41b6-9816-fb08757a4d1a')]",
      "properties": {
        "alertRuleTemplateName": "69bd9b97-2be2-41b6-9816-fb08757a4d1a",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/02/25",
        "description": "This rule detects suspicious processes with parent images located in the C:\\Users\\Public folder",
        "displayName": "Parent in Public Folder Suspicious Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/11/18",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"powershell\" or ProcessCommandLine contains \"cmd.exe /c \" or ProcessCommandLine contains \"cmd.exe /r \" or ProcessCommandLine contains \"cmd.exe /k \" or ProcessCommandLine contains \"cmd /c \" or ProcessCommandLine contains \"cmd /r \" or ProcessCommandLine contains \"cmd /k \" or ProcessCommandLine contains \"wscript.exe\" or ProcessCommandLine contains \"cscript.exe\" or ProcessCommandLine contains \"bitsadmin\" or ProcessCommandLine contains \"certutil\" or ProcessCommandLine contains \"mshta.exe\") and InitiatingProcessFolderPath startswith \"C:\\\\Users\\\\Public\\\\\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059",
          "t1564"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
