{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c625d754-6a3d-4f65-9c9a-536aea960d37')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c625d754-6a3d-4f65-9c9a-536aea960d37')]",
      "properties": {
        "alertRuleTemplateName": "c625d754-6a3d-4f65-9c9a-536aea960d37",
        "author": "Teymur Kheirkhabarov (idea), Mangatas Tondang, oscd.community, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2020/10/13",
        "description": "Detects the usage of the \"Accesschk\" utility, an access and privilege audit tool developed by SysInternal and often being abused by attacker to verify process privileges",
        "displayName": "Permission Check Via Accesschk.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/20",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"uwcqv \" or ProcessCommandLine contains \"kwsu \" or ProcessCommandLine contains \"qwsu \" or ProcessCommandLine contains \"uwdqs \") and (ProcessVersionInfoProductName endswith \"AccessChk\" or ProcessVersionInfoFileDescription contains \"Reports effective permissions\" or (FolderPath endswith \"\\\\accesschk.exe\" or FolderPath endswith \"\\\\accesschk64.exe\") or ProcessVersionInfoOriginalFileName =~ \"accesschk.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "T1069"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
