{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fcdf69e5-a3d3-452a-9724-26f2308bf2b1')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fcdf69e5-a3d3-452a-9724-26f2308bf2b1')]",
      "properties": {
        "alertRuleTemplateName": "fcdf69e5-a3d3-452a-9724-26f2308bf2b1",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/06/07",
        "description": "Detects cases in which an ISO files is opend within an archiver like 7Zip or Winrar, which is a sign of phishing as threat actors put small ISO files in archives as email attachments to bypass certain filters and protective measures (mark of web)",
        "displayName": "Phishing Pattern ISO in Archive",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\isoburn.exe\" or FolderPath endswith \"\\\\PowerISO.exe\" or FolderPath endswith \"\\\\ImgBurn.exe\") and (InitiatingProcessFolderPath endswith \"\\\\Winrar.exe\" or InitiatingProcessFolderPath endswith \"\\\\7zFM.exe\" or InitiatingProcessFolderPath endswith \"\\\\peazip.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1566"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
