{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f91ed517-a6ba-471d-9910-b3b4a398c0f3')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f91ed517-a6ba-471d-9910-b3b4a398c0f3')]",
      "properties": {
        "alertRuleTemplateName": "f91ed517-a6ba-471d-9910-b3b4a398c0f3",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/01/12",
        "description": "Detects potentially suspicious child process of applications launched from inside the WindowsApps directory. This could be a sign of a rogue \".appx\" package installation/execution",
        "displayName": "Potentially Suspicious Windows App Activity",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/08/31",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath contains \"C:\\\\Program Files\\\\WindowsApps\\\\\" and ((ProcessCommandLine contains \"cmd /c\" or ProcessCommandLine contains \"Invoke-\" or ProcessCommandLine contains \"Base64\") or (FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\wscript.exe\")) and (not(((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\pwsh.exe\") and InitiatingProcessFolderPath contains \":\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal\" and InitiatingProcessFolderPath endswith \"\\\\WindowsTerminal.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
