{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2f869d59-7f6a-4931-992c-cce556ff2d53')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2f869d59-7f6a-4931-992c-cce556ff2d53')]",
      "properties": {
        "alertRuleTemplateName": "2f869d59-7f6a-4931-992c-cce556ff2d53",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/06/09",
        "description": "Detects execution of \"AdPlus.exe\", a binary that is part of the Windows SDK that can be used as a LOLBIN in order to dump process memory and execute arbitrary commands.",
        "displayName": "Potential Adplus.EXE Abuse",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/06/23",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -hang \" or ProcessCommandLine contains \" -pn \" or ProcessCommandLine contains \" -pmn \" or ProcessCommandLine contains \" -p \" or ProcessCommandLine contains \" -po \" or ProcessCommandLine contains \" -c \" or ProcessCommandLine contains \" -sc \") and (FolderPath endswith \"\\\\adplus.exe\" or ProcessVersionInfoOriginalFileName =~ \"Adplus.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1003"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
