{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/beaa66d6-aa1b-4e3c-80f5-e0145369bfaf')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/beaa66d6-aa1b-4e3c-80f5-e0145369bfaf')]",
      "properties": {
        "alertRuleTemplateName": "beaa66d6-aa1b-4e3c-80f5-e0145369bfaf",
        "author": "Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/09",
        "description": "Detects execution of different log query utilities and commands to search and dump the content of specific event logs or look for specific event IDs.\nThis technique is used by threat actors in order to extract sensitive information from events logs such as usernames, IP addresses, hostnames, etc.\n",
        "displayName": "Potentially Suspicious EventLog Recon Activity Using Log Query Utilities",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/01/02",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"-InstanceId 4624\" or ProcessCommandLine contains \"System[EventID=4624]\" or (ProcessCommandLine contains \"EventCode=\" and ProcessCommandLine contains \"4624\") or (ProcessCommandLine contains \"EventIdentifier=\" and ProcessCommandLine contains \"4624\") or ProcessCommandLine contains \"-InstanceId 4778\" or ProcessCommandLine contains \"System[EventID=4778]\" or (ProcessCommandLine contains \"EventCode=\" and ProcessCommandLine contains \"4778\") or (ProcessCommandLine contains \"EventIdentifier=\" and ProcessCommandLine contains \"4778\") or ProcessCommandLine contains \"-InstanceId 25\" or ProcessCommandLine contains \"System[EventID=25]\" or (ProcessCommandLine contains \"EventCode=\" and ProcessCommandLine contains \"25\") or (ProcessCommandLine contains \"EventIdentifier=\" and ProcessCommandLine contains \"25\")) or (ProcessCommandLine contains \"Microsoft-Windows-TerminalServices-LocalSessionManager/Operational\" or ProcessCommandLine contains \"Microsoft-Windows-Terminal-Services-RemoteConnectionManager/Operational\" or ProcessCommandLine contains \"Security\")) and ((ProcessCommandLine contains \"Select\" and ProcessCommandLine contains \"Win32_NTLogEvent\") or ((ProcessCommandLine contains \" qe \" or ProcessCommandLine contains \" query-events \") and (FolderPath endswith \"\\\\wevtutil.exe\" or ProcessVersionInfoOriginalFileName =~ \"wevtutil.exe\")) or (ProcessCommandLine contains \" ntevent\" and (FolderPath endswith \"\\\\wmic.exe\" or ProcessVersionInfoOriginalFileName =~ \"wmic.exe\")) or (ProcessCommandLine contains \"Get-WinEvent \" or ProcessCommandLine contains \"get-eventlog \"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Discovery"
        ],
        "techniques": [
          "T1552"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
