{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d20ee2f4-822c-4827-9e15-41500b1fff10')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d20ee2f4-822c-4827-9e15-41500b1fff10')]",
      "properties": {
        "alertRuleTemplateName": "d20ee2f4-822c-4827-9e15-41500b1fff10",
        "author": "Muhammad Faisal",
        "customDetails": null,
        "date": "2023/08/02",
        "description": "Detects potential Amazon SSM agent hijack attempts as outlined in the Mitiga research report.",
        "displayName": "Potential Amazon SSM Agent Hijacking",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-register \" and ProcessCommandLine contains \"-code \" and ProcessCommandLine contains \"-id \" and ProcessCommandLine contains \"-region \") and FolderPath endswith \"\\\\amazon-ssm-agent.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence"
        ],
        "techniques": [
          "T1219"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
