{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/259dda31-b7a3-444f-b7d8-17f96e8a7d0d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/259dda31-b7a3-444f-b7d8-17f96e8a7d0d')]",
      "properties": {
        "alertRuleTemplateName": "259dda31-b7a3-444f-b7d8-17f96e8a7d0d",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/06/09",
        "description": "Detects loading of \"RjvPlatform.dll\" by the \"SystemResetPlatform.exe\" binary which can be abused as a method of DLL side loading since the \"$SysReset\" directory isn't created by default.",
        "displayName": "Potential RjvPlatform.DLL Sideloading From Default Location",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\SystemResetPlatform\\\\SystemResetPlatform.exe\" and FolderPath =~ \"C:\\\\$SysReset\\\\Framework\\\\Stack\\\\RjvPlatform.dll\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
