{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/be344333-921d-4c4d-8bb8-e584cf584780')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/be344333-921d-4c4d-8bb8-e584cf584780')]",
      "properties": {
        "alertRuleTemplateName": "be344333-921d-4c4d-8bb8-e584cf584780",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2017/03/19",
        "description": "Detects uncommon or suspicious child processes of \"eventvwr.exe\" which might indicate a UAC bypass attempt",
        "displayName": "Potentially Suspicious Event Viewer Child Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/09/28",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\eventvwr.exe\" and (not((FolderPath endswith \":\\\\Windows\\\\System32\\\\mmc.exe\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\WerFault.exe\" or FolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\WerFault.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1548"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
