{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25')]",
      "properties": {
        "alertRuleTemplateName": "2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25",
        "author": "Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel",
        "customDetails": null,
        "date": "2023/08/08",
        "description": "Detects potential abuse of the provisioning registry key for indirect command execution through \"Provlaunch.exe\".",
        "displayName": "Potential Provisioning Registry Key Abuse For Binary Proxy Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Provisioning\\\\Commands\\\\\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
