{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2dd2c217-bf68-437a-b57c-fe9fd01d5de8')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2dd2c217-bf68-437a-b57c-fe9fd01d5de8')]",
      "properties": {
        "alertRuleTemplateName": "2dd2c217-bf68-437a-b57c-fe9fd01d5de8",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/01/11",
        "description": "Detects regsvr32 execution to download and install DLLs located remotely where the address is an IP address.",
        "displayName": "Potentially Suspicious Regsvr32 HTTP IP Pattern",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/05/24",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\regsvr32.exe\" or ProcessVersionInfoOriginalFileName =~ \"REGSVR32.EXE\") and (ProcessCommandLine contains \" /i:http://1\" or ProcessCommandLine contains \" /i:http://2\" or ProcessCommandLine contains \" /i:http://3\" or ProcessCommandLine contains \" /i:http://4\" or ProcessCommandLine contains \" /i:http://5\" or ProcessCommandLine contains \" /i:http://6\" or ProcessCommandLine contains \" /i:http://7\" or ProcessCommandLine contains \" /i:http://8\" or ProcessCommandLine contains \" /i:http://9\" or ProcessCommandLine contains \" /i:https://1\" or ProcessCommandLine contains \" /i:https://2\" or ProcessCommandLine contains \" /i:https://3\" or ProcessCommandLine contains \" /i:https://4\" or ProcessCommandLine contains \" /i:https://5\" or ProcessCommandLine contains \" /i:https://6\" or ProcessCommandLine contains \" /i:https://7\" or ProcessCommandLine contains \" /i:https://8\" or ProcessCommandLine contains \" /i:https://9\" or ProcessCommandLine contains \" -i:http://1\" or ProcessCommandLine contains \" -i:http://2\" or ProcessCommandLine contains \" -i:http://3\" or ProcessCommandLine contains \" -i:http://4\" or ProcessCommandLine contains \" -i:http://5\" or ProcessCommandLine contains \" -i:http://6\" or ProcessCommandLine contains \" -i:http://7\" or ProcessCommandLine contains \" -i:http://8\" or ProcessCommandLine contains \" -i:http://9\" or ProcessCommandLine contains \" -i:https://1\" or ProcessCommandLine contains \" -i:https://2\" or ProcessCommandLine contains \" -i:https://3\" or ProcessCommandLine contains \" -i:https://4\" or ProcessCommandLine contains \" -i:https://5\" or ProcessCommandLine contains \" -i:https://6\" or ProcessCommandLine contains \" -i:https://7\" or ProcessCommandLine contains \" -i:https://8\" or ProcessCommandLine contains \" -i:https://9\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
