{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/68654bf0-4412-43d5-bfe8-5eaa393cd939')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/68654bf0-4412-43d5-bfe8-5eaa393cd939')]",
      "properties": {
        "alertRuleTemplateName": "68654bf0-4412-43d5-bfe8-5eaa393cd939",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/12/14",
        "description": "Detects potential DLL sideloading using JUSTSYSTEMS Japanese word processor",
        "displayName": "Potential DLL Sideloading Via JsSchHlp",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\JSESPR.dll\" and (not(FolderPath startswith \"C:\\\\Program Files\\\\Common Files\\\\Justsystem\\\\JsSchHlp\\\\\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence"
        ],
        "techniques": [
          "T1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
