{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c8da0dfd-4ed0-4b68-962d-13c9c884384e')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c8da0dfd-4ed0-4b68-962d-13c9c884384e')]",
      "properties": {
        "alertRuleTemplateName": "c8da0dfd-4ed0-4b68-962d-13c9c884384e",
        "author": "Florian Roth (Nextron Systems), Samir Bousseaden",
        "customDetails": null,
        "date": "2021/11/27",
        "description": "Detects a suspicious LSASS process process clone that could be a sign of credential dumping activity",
        "displayName": "Potential Credential Dumping Via LSASS Process Clone",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/02",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\Windows\\\\System32\\\\lsass.exe\" and InitiatingProcessFolderPath endswith \"\\\\Windows\\\\System32\\\\lsass.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "critical",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
