{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/744a188b-0415-4792-896f-11ddb0588dbc')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/744a188b-0415-4792-896f-11ddb0588dbc')]",
      "properties": {
        "alertRuleTemplateName": "744a188b-0415-4792-896f-11ddb0588dbc",
        "author": "Alexander McDonald",
        "customDetails": null,
        "date": "2022/06/24",
        "description": "Detects potential process injection via Microsoft Remote Asssistance (Msra.exe) by looking at suspicious child processes spawned from the aforementioned process. It has been a target used by many threat actors and used for discovery and persistence tactics",
        "displayName": "Potential Process Injection Via Msra.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/03",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\arp.exe\" or FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\netstat.exe\" or FolderPath endswith \"\\\\nslookup.exe\" or FolderPath endswith \"\\\\route.exe\" or FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\whoami.exe\") and InitiatingProcessCommandLine endswith \"msra.exe\" and InitiatingProcessFolderPath endswith \"\\\\msra.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1055"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
