{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/970007b7-ce32-49d0-a4a4-fbef016950bd')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/970007b7-ce32-49d0-a4a4-fbef016950bd')]",
      "properties": {
        "alertRuleTemplateName": "970007b7-ce32-49d0-a4a4-fbef016950bd",
        "author": "Timur Zinniatullin, oscd.community",
        "customDetails": null,
        "date": "2019/10/21",
        "description": "Detects the usage of \"reg.exe\" in order to query reconnaissance information from the registry. Adversaries may interact with the Windows registry to gather information about credentials, the system, configuration, and installed software.",
        "displayName": "Potential Configuration And Service Reconnaissance Via Reg.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/05",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"query\" and (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\") and (ProcessCommandLine contains \"currentVersion\\\\windows\" or ProcessCommandLine contains \"winlogon\\\\\" or ProcessCommandLine contains \"currentVersion\\\\shellServiceObjectDelayLoad\" or ProcessCommandLine contains \"currentVersion\\\\run\" or ProcessCommandLine contains \"currentVersion\\\\policies\\\\explorer\\\\run\" or ProcessCommandLine contains \"currentcontrolset\\\\services\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "t1007",
          "t1012"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
