{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0f9c21f1-6a73-4b0e-9809-cb562cb8d981')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0f9c21f1-6a73-4b0e-9809-cb562cb8d981')]",
      "properties": {
        "alertRuleTemplateName": "0f9c21f1-6a73-4b0e-9809-cb562cb8d981",
        "author": "Teymur Kheirkhabarov",
        "customDetails": null,
        "date": "2019/10/26",
        "description": "Detect modification of services configuration (ImagePath, FailureCommand and ServiceDLL) in registry by processes with Medium integrity level",
        "displayName": "Potential Privilege Escalation via Service Permissions Weakness",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/30",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"\\\\ImagePath\" or ProcessCommandLine contains \"\\\\FailureCommand\" or ProcessCommandLine contains \"\\\\ServiceDll\") and (ProcessCommandLine contains \"ControlSet\" and ProcessCommandLine contains \"services\") and ProcessIntegrityLevel =~ \"Medium\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
