{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b66474aa-bd92-4333-a16c-298155b120df')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b66474aa-bd92-4333-a16c-298155b120df')]",
      "properties": {
        "alertRuleTemplateName": "b66474aa-bd92-4333-a16c-298155b120df",
        "author": "pH-T (Nextron Systems), Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/04/08",
        "description": "Detects suspicious powershell execution via a schedule task where the command ends with an suspicious flags to hide the powershell instance instead of executeing scripts or commands. This could be a sign of persistence via PowerShell \"Get-Variable\" technique as seen being used in Colibri Loader",
        "displayName": "Potential Persistence Via Powershell Search Order Hijacking - Task",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/03",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \" -windowstyle hidden\" or ProcessCommandLine endswith \" -w hidden\" or ProcessCommandLine endswith \" -ep bypass\" or ProcessCommandLine endswith \" -noni\") and (InitiatingProcessCommandLine contains \"-k netsvcs\" and InitiatingProcessCommandLine contains \"-s Schedule\") and InitiatingProcessFolderPath =~ \"C:\\\\WINDOWS\\\\System32\\\\svchost.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution",
          "persistence"
        ],
        "techniques": [
          "T1053",
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
