{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0e0bc253-07ed-43f1-816d-e1b220fe8971')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0e0bc253-07ed-43f1-816d-e1b220fe8971')]",
      "properties": {
        "alertRuleTemplateName": "0e0bc253-07ed-43f1-816d-e1b220fe8971",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/06/09",
        "description": "Detects potential DLL sideloading of \"RjvPlatform.dll\" by \"SystemResetPlatform.exe\" located in a non-default location.",
        "displayName": "Potential RjvPlatform.DLL Sideloading From Non-Default Location",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where (InitiatingProcessFolderPath =~ \"\\\\SystemResetPlatform.exe\" and FolderPath endswith \"\\\\RjvPlatform.dll\") and (not(InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\System32\\\\SystemResetPlatform\\\\\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
