{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/79b06761-465f-4f88-9ef2-150e24d3d737')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/79b06761-465f-4f88-9ef2-150e24d3d737')]",
      "properties": {
        "alertRuleTemplateName": "79b06761-465f-4f88-9ef2-150e24d3d737",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/01/11",
        "description": "Detects uses of the SysInternals ProcDump utility in which ProcDump or its output get renamed, or a dump file is moved or copied to a different name",
        "displayName": "Potential SysInternals ProcDump Evasion",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/05/09",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"copy procdump\" or ProcessCommandLine contains \"move procdump\") or ((ProcessCommandLine contains \"2.dmp\" or ProcessCommandLine contains \"lsass\" or ProcessCommandLine contains \"out.dmp\") and (ProcessCommandLine contains \"copy \" and ProcessCommandLine contains \".dmp \")) or (ProcessCommandLine contains \"copy lsass.exe_\" or ProcessCommandLine contains \"move lsass.exe_\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003",
          "t1036"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
