{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f38ce0b9-5e97-4b47-a211-7dc8d8b871da')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f38ce0b9-5e97-4b47-a211-7dc8d8b871da')]",
      "properties": {
        "alertRuleTemplateName": "f38ce0b9-5e97-4b47-a211-7dc8d8b871da",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/08/04",
        "description": "Execution of plink to perform data exfiltration and tunneling",
        "displayName": "Potential RDP Tunneling Via Plink",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/27",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \":127.0.0.1:3389\" and FolderPath endswith \"\\\\plink.exe\") or ((ProcessCommandLine contains \":3389\" and FolderPath endswith \"\\\\plink.exe\") and (ProcessCommandLine contains \" -P 443\" or ProcessCommandLine contains \" -P 22\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1572"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
