{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/207b0396-3689-42d9-8399-4222658efc99')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/207b0396-3689-42d9-8399-4222658efc99')]",
      "properties": {
        "alertRuleTemplateName": "207b0396-3689-42d9-8399-4222658efc99",
        "author": "Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2021/05/22",
        "description": "Detects unknown program using commandline flags usually used by tools such as PsExec and PAExec to start programs with SYSTEM Privileges",
        "displayName": "Potential Privilege Escalation To LOCAL SYSTEM",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/05",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -s cmd\" or ProcessCommandLine contains \" /s cmd\" or ProcessCommandLine contains \" -s -i cmd\" or ProcessCommandLine contains \" -s /i cmd\" or ProcessCommandLine contains \" /s -i cmd\" or ProcessCommandLine contains \" /s /i cmd\" or ProcessCommandLine contains \" -i -s cmd\" or ProcessCommandLine contains \" -i /s cmd\" or ProcessCommandLine contains \" /i -s cmd\" or ProcessCommandLine contains \" /i /s cmd\" or ProcessCommandLine contains \" -s pwsh\" or ProcessCommandLine contains \" /s pwsh\" or ProcessCommandLine contains \" -s -i pwsh\" or ProcessCommandLine contains \" -s /i pwsh\" or ProcessCommandLine contains \" /s -i pwsh\" or ProcessCommandLine contains \" /s /i pwsh\" or ProcessCommandLine contains \" -i -s pwsh\" or ProcessCommandLine contains \" -i /s pwsh\" or ProcessCommandLine contains \" /i -s pwsh\" or ProcessCommandLine contains \" /i /s pwsh\" or ProcessCommandLine contains \" -s powershell\" or ProcessCommandLine contains \" /s powershell\" or ProcessCommandLine contains \" -s -i powershell\" or ProcessCommandLine contains \" -s /i powershell\" or ProcessCommandLine contains \" /s -i powershell\" or ProcessCommandLine contains \" /s /i powershell\" or ProcessCommandLine contains \" -i -s powershell\" or ProcessCommandLine contains \" -i /s powershell\" or ProcessCommandLine contains \" /i -s powershell\" or ProcessCommandLine contains \" /i /s powershell\") and (not((ProcessCommandLine contains \"paexec\" or ProcessCommandLine contains \"PsExec\" or ProcessCommandLine contains \"accepteula\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1587"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
