{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/07f8bdc2-c9b3-472a-9817-5a670b872f53')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/07f8bdc2-c9b3-472a-9817-5a670b872f53')]",
      "properties": {
        "alertRuleTemplateName": "07f8bdc2-c9b3-472a-9817-5a670b872f53",
        "author": "jmallette, Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2019/01/16",
        "description": "Detects usage of cmdkey to look for cached credentials on the system",
        "displayName": "Potential Reconnaissance For Cached Credentials Via Cmdkey.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/05",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -l\" or ProcessCommandLine contains \" /l\") and (FolderPath endswith \"\\\\cmdkey.exe\" or ProcessVersionInfoOriginalFileName =~ \"cmdkey.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1003"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
