{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/148431ce-4b70-403d-8525-fcc2993f29ea')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/148431ce-4b70-403d-8525-fcc2993f29ea')]",
      "properties": {
        "alertRuleTemplateName": "148431ce-4b70-403d-8525-fcc2993f29ea",
        "author": "Avneet Singh @v3t0_, oscd.community",
        "customDetails": null,
        "date": "2020/10/18",
        "description": "Detects potential DLL injection and execution using \"Tracker.exe\"",
        "displayName": "Potential DLL Injection Or Execution Using Tracker.exe",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/09",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" /d \" or ProcessCommandLine contains \" /c \") and (FolderPath endswith \"\\\\tracker.exe\" or ProcessVersionInfoFileDescription =~ \"Tracker\")) and (not((ProcessCommandLine contains \" /ERRORREPORT:PROMPT \" or (InitiatingProcessFolderPath endswith \"\\\\Msbuild\\\\Current\\\\Bin\\\\MSBuild.exe\" or InitiatingProcessFolderPath endswith \"\\\\Msbuild\\\\Current\\\\Bin\\\\amd64\\\\MSBuild.exe\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1055"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
