{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0d5675be-bc88-4172-86d3-1e96a4476536')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0d5675be-bc88-4172-86d3-1e96a4476536')]",
      "properties": {
        "alertRuleTemplateName": "0d5675be-bc88-4172-86d3-1e96a4476536",
        "author": "pH-T (Nextron Systems), @Kostastsale, @TheDFIRReport",
        "customDetails": null,
        "date": "2022/02/12",
        "description": "Detects the execution of \"reg.exe\" for enabling/disabling the RDP service on the host by tampering with the 'CurrentControlSet\\Control\\Terminal Server' values",
        "displayName": "Potential Tampering With RDP Related Registry Keys Via Reg.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/05",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" add \" and ProcessCommandLine contains \"\\\\CurrentControlSet\\\\Control\\\\Terminal Server\" and ProcessCommandLine contains \"REG_DWORD\" and ProcessCommandLine contains \" /f\") and (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\")) and ((ProcessCommandLine contains \"Licensing Core\" and ProcessCommandLine contains \"EnableConcurrentSessions\") or (ProcessCommandLine contains \"WinStations\\\\RDP-Tcp\" or ProcessCommandLine contains \"MaxInstanceCount\" or ProcessCommandLine contains \"fEnableWinStation\" or ProcessCommandLine contains \"TSUserEnabled\" or ProcessCommandLine contains \"TSEnabled\" or ProcessCommandLine contains \"TSAppCompat\" or ProcessCommandLine contains \"IdleWinStationPoolCount\" or ProcessCommandLine contains \"TSAdvertise\" or ProcessCommandLine contains \"AllowTSConnections\" or ProcessCommandLine contains \"fSingleSessionPerUser\" or ProcessCommandLine contains \"fDenyTSConnections\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1021",
          "t1112"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
