{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f35c5d71-b489-4e22-a115-f003df287317')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f35c5d71-b489-4e22-a115-f003df287317')]",
      "properties": {
        "alertRuleTemplateName": "f35c5d71-b489-4e22-a115-f003df287317",
        "author": "Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2021/07/27",
        "description": "Detects potential process patterns related to Cobalt Strike beacon activity",
        "displayName": "Potential CobaltStrike Process Patterns",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/29",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \"conhost.exe 0xffffffff -ForceV1\" and (InitiatingProcessCommandLine contains \"cmd.exe /C echo\" and InitiatingProcessCommandLine contains \" > \\\\\\\\.\\\\pipe\")) or (ProcessCommandLine endswith \"conhost.exe 0xffffffff -ForceV1\" and InitiatingProcessCommandLine endswith \"/C whoami\") or (ProcessCommandLine endswith \"cmd.exe /C whoami\" and InitiatingProcessFolderPath startswith \"C:\\\\Temp\\\\\") or ((ProcessCommandLine contains \"cmd.exe /c echo\" and ProcessCommandLine contains \"> \\\\\\\\.\\\\pipe\") and (InitiatingProcessFolderPath endswith \"\\\\runonce.exe\" or InitiatingProcessFolderPath endswith \"\\\\dllhost.exe\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
