{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f64c9b2d-b0ad-481d-9d03-7fc75020892a')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f64c9b2d-b0ad-481d-9d03-7fc75020892a')]",
      "properties": {
        "alertRuleTemplateName": "f64c9b2d-b0ad-481d-9d03-7fc75020892a",
        "author": "X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/05/14",
        "description": "Detects potential DLL sideloading of \"roboform.dll\", a DLL used by RoboForm Password Manager",
        "displayName": "Potential RoboForm.DLL Sideloading",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\roboform.dll\" or FolderPath endswith \"\\\\roboform-x64.dll\") and (not(((InitiatingProcessFolderPath endswith \"\\\\robotaskbaricon.exe\" or InitiatingProcessFolderPath endswith \"\\\\robotaskbaricon-x64.exe\") and (InitiatingProcessFolderPath startswith \" C:\\\\Program Files (x86)\\\\Siber Systems\\\\AI RoboForm\\\\\" or InitiatingProcessFolderPath startswith \" C:\\\\Program Files\\\\Siber Systems\\\\AI RoboForm\\\\\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
