{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b6457d63-d2a2-4e29-859d-4e7affc153d1')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b6457d63-d2a2-4e29-859d-4e7affc153d1')]",
      "properties": {
        "alertRuleTemplateName": "b6457d63-d2a2-4e29-859d-4e7affc153d1",
        "author": "@gott_cyber",
        "customDetails": null,
        "date": "2022/07/31",
        "description": "Detects an attempt to leverage dnscmd.exe to enumerate the DNS zones of a domain. DNS zones used to host the DNS records for a particular domain.",
        "displayName": "Potential Discovery Activity Via Dnscmd.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/04",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/enumrecords\" or ProcessCommandLine contains \"/enumzones\" or ProcessCommandLine contains \"/ZonePrint\" or ProcessCommandLine contains \"/info\") and FolderPath endswith \"\\\\dnscmd.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery",
          "execution"
        ],
        "techniques": [
          "T1543"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
