{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1327381e-6ab0-4f38-b583-4c1b8346a56b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1327381e-6ab0-4f38-b583-4c1b8346a56b')]",
      "properties": {
        "alertRuleTemplateName": "1327381e-6ab0-4f38-b583-4c1b8346a56b",
        "author": "Christian Burkard (Nextron Systems)",
        "customDetails": null,
        "date": "2021/10/26",
        "description": "Detects potential evasion or obfuscation attempts using bogus path traversal via the commandline",
        "displayName": "Potential Command Line Path Traversal Evasion Attempt",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/29",
        "query": "DeviceProcessEvents\n| where (((ProcessCommandLine contains \"\\\\..\\\\Windows\\\\\" or ProcessCommandLine contains \"\\\\..\\\\System32\\\\\" or ProcessCommandLine contains \"\\\\..\\\\..\\\\\") and FolderPath contains \"\\\\Windows\\\\\") or ProcessCommandLine contains \".exe\\\\..\\\\\") and (not((ProcessCommandLine contains \"\\\\Citrix\\\\Virtual Smart Card\\\\Citrix.Authentication.VirtualSmartcard.Launcher.exe\\\\..\\\\\" or ProcessCommandLine contains \"\\\\Google\\\\Drive\\\\googledrivesync.exe\\\\..\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1036"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
