{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7002aa10-b8d4-47ae-b5ba-51ab07e228b9')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7002aa10-b8d4-47ae-b5ba-51ab07e228b9')]",
      "properties": {
        "alertRuleTemplateName": "7002aa10-b8d4-47ae-b5ba-51ab07e228b9",
        "author": "Bhabesh Raj",
        "customDetails": null,
        "date": "2022/08/01",
        "description": "Detects potential sideloading of \"mpclient.dll\" by Windows Defender processes (\"MpCmdRun\" and \"NisSrv\") from their non-default directory.",
        "displayName": "Potential Mpclient.DLL Sideloading Via Defender Binaries",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/08/04",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\MpCmdRun.exe\" or FolderPath endswith \"\\\\NisSrv.exe\") and (not((FolderPath startswith \"C:\\\\Program Files (x86)\\\\Windows Defender\\\\\" or FolderPath startswith \"C:\\\\Program Files\\\\Microsoft Security Client\\\\\" or FolderPath startswith \"C:\\\\Program Files\\\\Windows Defender\\\\\" or FolderPath startswith \"C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\WinSxS\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
