{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8e0bb260-d4b2-4fff-bb8d-3f82118e6892')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8e0bb260-d4b2-4fff-bb8d-3f82118e6892')]",
      "properties": {
        "alertRuleTemplateName": "8e0bb260-d4b2-4fff-bb8d-3f82118e6892",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/07/12",
        "description": "Detects inline Windows shell commands redirecting output via the \">\" symbol to a suspicious location.\nThis technique is sometimes used by malicious actors in order to redirect the output of reconnaissance commands such as \"hostname\" and \"dir\" to files for future exfiltration.\n",
        "displayName": "Potentially Suspicious CMD Shell Output Redirect",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/19",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\cmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"Cmd.Exe\") and (((ProcessCommandLine contains \">\" and ProcessCommandLine contains \"%APPDATA%\\\\\") or (ProcessCommandLine contains \">\" and ProcessCommandLine contains \"%TEMP%\\\\\") or (ProcessCommandLine contains \">\" and ProcessCommandLine contains \"%TMP%\\\\\") or (ProcessCommandLine contains \">\" and ProcessCommandLine contains \"%USERPROFILE%\\\\\") or (ProcessCommandLine contains \">\" and ProcessCommandLine contains \"C:\\\\ProgramData\\\\\") or (ProcessCommandLine contains \">\" and ProcessCommandLine contains \"C:\\\\Temp\\\\\") or (ProcessCommandLine contains \">\" and ProcessCommandLine contains \"C:\\\\Users\\\\Public\\\\\") or (ProcessCommandLine contains \">\" and ProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\")) or ((ProcessCommandLine contains \" >\" or ProcessCommandLine contains \"\\\">\" or ProcessCommandLine contains \"'>\") and (ProcessCommandLine contains \"C:\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
