{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/24b6cf51-6122-469e-861a-22974e9c1e5b')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/24b6cf51-6122-469e-861a-22974e9c1e5b')]",
      "properties": {
        "alertRuleTemplateName": "24b6cf51-6122-469e-861a-22974e9c1e5b",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/06/01",
        "description": "Detects potential DLL sideloading of \"SmadHook.dll\", a DLL used by SmadAV antivirus",
        "displayName": "Potential SmadHook.DLL Sideloading",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\SmadHook32c.dll\" or FolderPath endswith \"\\\\SmadHook64c.dll\") and (not(((InitiatingProcessFolderPath in~ (\"C:\\\\Program Files (x86)\\\\SMADAV\\\\SmadavProtect32.exe\", \"C:\\\\Program Files (x86)\\\\SMADAV\\\\SmadavProtect64.exe\", \"C:\\\\Program Files\\\\SMADAV\\\\SmadavProtect32.exe\", \"C:\\\\Program Files\\\\SMADAV\\\\SmadavProtect64.exe\")) and (FolderPath startswith \"C:\\\\Program Files (x86)\\\\SMADAV\\\\\" or FolderPath startswith \"C:\\\\Program Files\\\\SMADAV\\\\\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
