{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8cbc9475-8d05-4e27-9c32-df960716c701')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8cbc9475-8d05-4e27-9c32-df960716c701')]",
      "properties": {
        "alertRuleTemplateName": "8cbc9475-8d05-4e27-9c32-df960716c701",
        "author": "Stephen Lincoln @slincoln-aiq (AttackIQ)",
        "customDetails": null,
        "date": "2023/12/21",
        "description": "Detects the execution of \"reg.exe\" to alter registry keys that would replace the user's desktop background.\nThis is a common technique used by malware to change the desktop background to a ransom note or other image.\n",
        "displayName": "Potentially Suspicious Desktop Background Change Using Reg.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"add\" and (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\")) and (ProcessCommandLine contains \"Control Panel\\\\Desktop\" or ProcessCommandLine contains \"CurrentVersion\\\\Policies\\\\ActiveDesktop\" or ProcessCommandLine contains \"CurrentVersion\\\\Policies\\\\System\") and ((ProcessCommandLine contains \"/v NoChangingWallpaper\" and ProcessCommandLine contains \"/d 1\") or (ProcessCommandLine contains \"/v Wallpaper\" and ProcessCommandLine contains \"/t REG_SZ\") or (ProcessCommandLine contains \"/v WallpaperStyle\" and ProcessCommandLine contains \"/d 2\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "impact"
        ],
        "techniques": [
          "t1112",
          "t1491"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
