{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b6188d2f-b3c4-4d2c-a17d-9706e0851af0')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b6188d2f-b3c4-4d2c-a17d-9706e0851af0')]",
      "properties": {
        "alertRuleTemplateName": "b6188d2f-b3c4-4d2c-a17d-9706e0851af0",
        "author": "X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/05/15",
        "description": "Detects potential DLL sideloading of \"goopdate.dll\", a DLL used by googleupdate.exe",
        "displayName": "Potential Goopdate.DLL Sideloading",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "2023/05/20",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\goopdate.dll\" and (not((FolderPath startswith \"C:\\\\Program Files (x86)\\\\\" or FolderPath startswith \"C:\\\\Program Files\\\\\"))) and (not(((FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\GUM\" and FolderPath contains \".tmp\\\\goopdate.dll\") and (InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\GUM\" and InitiatingProcessFolderPath contains \".tmp\\\\Dropbox\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
