{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/84b1ecf9-6eff-4004-bafb-bae5c0e251b2')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/84b1ecf9-6eff-4004-bafb-bae5c0e251b2')]",
      "properties": {
        "alertRuleTemplateName": "84b1ecf9-6eff-4004-bafb-bae5c0e251b2",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/05/15",
        "description": "Detects potentially suspicious child processes of \"GoogleUpdate.exe\"",
        "displayName": "Potentially Suspicious GoogleUpdate Child Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/05/22",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\GoogleUpdate.exe\" and (not((isnull(FolderPath) or (FolderPath contains \"\\\\Google\" or (FolderPath endswith \"\\\\setup.exe\" or FolderPath endswith \"chrome_updater.exe\" or FolderPath endswith \"chrome_installer.exe\")))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
