{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c740d4cf-a1e9-41de-bb16-8a46a4f57918')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c740d4cf-a1e9-41de-bb16-8a46a4f57918')]",
      "properties": {
        "alertRuleTemplateName": "c740d4cf-a1e9-41de-bb16-8a46a4f57918",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/12/29",
        "description": "Detects usage of the built-in PowerShell cmdlet \"Enable-WindowsOptionalFeature\" used as a Deployment Image Servicing and Management tool.\nSimilar to DISM.exe, this cmdlet is used to enumerate, install, uninstall, configure, and update features and packages in Windows images\n",
        "displayName": "Potential Suspicious Windows Feature Enabled - ProcCreation",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Enable-WindowsOptionalFeature\" and ProcessCommandLine contains \"-Online\" and ProcessCommandLine contains \"-FeatureName\") and (ProcessCommandLine contains \"TelnetServer\" or ProcessCommandLine contains \"Internet-Explorer-Optional-amd64\" or ProcessCommandLine contains \"TFTP\" or ProcessCommandLine contains \"SMB1Protocol\" or ProcessCommandLine contains \"Client-ProjFS\" or ProcessCommandLine contains \"Microsoft-Windows-Subsystem-Linux\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
