{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/551d9c1f-816c-445b-a7a6-7a3864720d60')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/551d9c1f-816c-445b-a7a6-7a3864720d60')]",
      "properties": {
        "alertRuleTemplateName": "551d9c1f-816c-445b-a7a6-7a3864720d60",
        "author": "Aaron Stratton",
        "customDetails": null,
        "date": "2023/11/13",
        "description": "Detects suspicious child processes of Excel which could be an indicator of lateral movement leveraging the \"ActivateMicrosoftApp\" Excel DCOM object.\n",
        "displayName": "Potential Excel.EXE DCOM Lateral Movement Via ActivateMicrosoftApp",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ((ProcessVersionInfoOriginalFileName in~ (\"foxprow.exe\", \"schdplus.exe\", \"winproj.exe\")) or (FolderPath endswith \"\\\\foxprow.exe\" or FolderPath endswith \"\\\\schdplus.exe\" or FolderPath endswith \"\\\\winproj.exe\")) and InitiatingProcessFolderPath endswith \"\\\\excel.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1021"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
