{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d7bcd677-645d-4691-a8d4-7a5602b780d1')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d7bcd677-645d-4691-a8d4-7a5602b780d1')]",
      "properties": {
        "alertRuleTemplateName": "d7bcd677-645d-4691-a8d4-7a5602b780d1",
        "author": "Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton (fp)",
        "customDetails": null,
        "date": "2020/10/15",
        "description": "Detects the PowerShell command lines with special characters",
        "displayName": "Potential PowerShell Command Line Obfuscation",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/04/15",
        "query": "DeviceProcessEvents\n| where (((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and (ProcessCommandLine matches regex \"\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+\" or ProcessCommandLine matches regex \"\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{\" or ProcessCommandLine matches regex \"\\\\^.*\\\\^.*\\\\^.*\\\\^.*\\\\^\" or ProcessCommandLine matches regex \"`.*`.*`.*`.*`\")) and (not((InitiatingProcessFolderPath =~ \"C:\\\\Program Files\\\\Amazon\\\\SSM\\\\ssm-document-worker.exe\" or (ProcessCommandLine contains \"new EventSource(\\\"Microsoft.Windows.Sense.Client.Management\\\"\" or ProcessCommandLine contains \"public static extern bool InstallELAMCertificateInfo(SafeFileHandle handle);\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1027",
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
