{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/51cbac1e-eee3-4a90-b1b7-358efb81fa0a')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/51cbac1e-eee3-4a90-b1b7-358efb81fa0a')]",
      "properties": {
        "alertRuleTemplateName": "51cbac1e-eee3-4a90-b1b7-358efb81fa0a",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/12/11",
        "description": "Detects potential tampering with Windows Defender settings such as adding exclusion using wmic",
        "displayName": "Potential Windows Defender Tampering Via Wmic.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/14",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"/Namespace:\\\\\\\\root\\\\Microsoft\\\\Windows\\\\Defender\" and (ProcessVersionInfoOriginalFileName =~ \"wmic.exe\" or FolderPath endswith \"\\\\WMIC.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1546"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
