{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/db77ce78-7e28-4188-9337-cf30e2b3ba9f')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/db77ce78-7e28-4188-9337-cf30e2b3ba9f')]",
      "properties": {
        "alertRuleTemplateName": "db77ce78-7e28-4188-9337-cf30e2b3ba9f",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/03/13",
        "description": "Detects potential DLL side loading of DLLs that are part of the Wazuh security platform",
        "displayName": "Potential Wazuh Security Platform DLL Sideloading",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "2023/05/12",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\libwazuhshared.dll\" or FolderPath endswith \"\\\\libwinpthread-1.dll\") and (not((FolderPath startswith \"C:\\\\Program Files\\\\\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\\"))) and (not(((FolderPath contains \"\\\\AppData\\\\Local\\\\\" or FolderPath contains \"\\\\ProgramData\\\\\") and FolderPath endswith \"\\\\mingw64\\\\bin\\\\libwinpthread-1.dll\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
