{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6414b5cd-b19d-447e-bb5e-9f03940b5784')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6414b5cd-b19d-447e-bb5e-9f03940b5784')]",
      "properties": {
        "alertRuleTemplateName": "6414b5cd-b19d-447e-bb5e-9f03940b5784",
        "author": "Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)",
        "customDetails": null,
        "date": "2022/10/25",
        "description": "Detects DLL sideloading of \"dbghelp.dll\"",
        "displayName": "Potential DLL Sideloading Of DBGHELP.DLL",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "2023/05/05",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\dbghelp.dll\" and (not((FolderPath startswith \"C:\\\\Program Files (x86)\\\\\" or FolderPath startswith \"C:\\\\Program Files\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\SoftwareDistribution\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\System32\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\SystemTemp\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\SysWOW64\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\WinSxS\\\\\"))) and (not(((FolderPath endswith \"\\\\Anaconda3\\\\Lib\\\\site-packages\\\\vtrace\\\\platforms\\\\windll\\\\amd64\\\\dbghelp.dll\" or FolderPath endswith \"\\\\Anaconda3\\\\Lib\\\\site-packages\\\\vtrace\\\\platforms\\\\windll\\\\i386\\\\dbghelp.dll\") or (FolderPath endswith \"\\\\Epic Games\\\\Launcher\\\\Engine\\\\Binaries\\\\ThirdParty\\\\DbgHelp\\\\dbghelp.dll\" or FolderPath endswith \"\\\\Epic Games\\\\MagicLegends\\\\x86\\\\dbghelp.dll\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "T1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
