{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/952ed57c-8f99-453d-aee0-53a49c22f95d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/952ed57c-8f99-453d-aee0-53a49c22f95d')]",
      "properties": {
        "alertRuleTemplateName": "952ed57c-8f99-453d-aee0-53a49c22f95d",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/08/03",
        "description": "Detects potential DLL sideloading of \"AVKkid.dll\"",
        "displayName": "Potential AVKkid.DLL Sideloading",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\AVKkid.dll\" and (not(((FolderPath startswith \"C:\\\\Program Files (x86)\\\\G DATA\\\\\" or FolderPath startswith \"C:\\\\Program Files\\\\G DATA\\\\\") and (InitiatingProcessFolderPath contains \"C:\\\\Program Files (x86)\\\\G DATA\\\\\" or InitiatingProcessFolderPath contains \"C:\\\\Program Files\\\\G DATA\\\\\") and InitiatingProcessFolderPath endswith \"\\\\AVKKid.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
