{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/17769c90-230e-488b-a463-e05c08e9d48f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/17769c90-230e-488b-a463-e05c08e9d48f')]",
      "properties": {
        "alertRuleTemplateName": "17769c90-230e-488b-a463-e05c08e9d48f",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/04/29",
        "description": "Detects requests to exclude files, folders or processes from Antivirus scanning using PowerShell cmdlets",
        "displayName": "Powershell Defender Exclusion",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/05/12",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Add-MpPreference \" or ProcessCommandLine contains \"Set-MpPreference \") and (ProcessCommandLine contains \" -ExclusionPath \" or ProcessCommandLine contains \" -ExclusionExtension \" or ProcessCommandLine contains \" -ExclusionProcess \" or ProcessCommandLine contains \" -ExclusionIpAddress \")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1562"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
