{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ee218c12-627a-4d27-9e30-d6fb2fe22ed2')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ee218c12-627a-4d27-9e30-d6fb2fe22ed2')]",
      "properties": {
        "alertRuleTemplateName": "ee218c12-627a-4d27-9e30-d6fb2fe22ed2",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/12/25",
        "description": "Detects inline execution of PowerShell code from a file",
        "displayName": "Powershell Inline Execution From A File",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"iex \" or ProcessCommandLine contains \"Invoke-Expression \" or ProcessCommandLine contains \"Invoke-Command \" or ProcessCommandLine contains \"icm \") and ProcessCommandLine contains \" -raw\" and (ProcessCommandLine contains \"cat \" or ProcessCommandLine contains \"get-content \" or ProcessCommandLine contains \"type \")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
