{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/85b0b087-eddf-4a2b-b033-d771fa2b9775')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/85b0b087-eddf-4a2b-b033-d771fa2b9775')]",
      "properties": {
        "alertRuleTemplateName": "85b0b087-eddf-4a2b-b033-d771fa2b9775",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/03/24",
        "description": "Detects PowerShell download and execution cradles.",
        "displayName": "PowerShell Download and Execution Cradles",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/05/04",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \".DownloadString(\" or ProcessCommandLine contains \".DownloadFile(\" or ProcessCommandLine contains \"Invoke-WebRequest \" or ProcessCommandLine contains \"iwr \") and (ProcessCommandLine contains \";iex $\" or ProcessCommandLine contains \"| IEX\" or ProcessCommandLine contains \"|IEX \" or ProcessCommandLine contains \"I`E`X\" or ProcessCommandLine contains \"I`EX\" or ProcessCommandLine contains \"IE`X\" or ProcessCommandLine contains \"iex \" or ProcessCommandLine contains \"IEX (\" or ProcessCommandLine contains \"IEX(\" or ProcessCommandLine contains \"Invoke-Expression\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
