{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8f70ac5f-1f6f-4f8e-b454-db19561216c5')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8f70ac5f-1f6f-4f8e-b454-db19561216c5')]",
      "properties": {
        "alertRuleTemplateName": "8f70ac5f-1f6f-4f8e-b454-db19561216c5",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2020/08/28",
        "description": "Detects the execution of powershell, a WebClient object creation and the invocation of DownloadFile in a single command line",
        "displayName": "PowerShell DownloadFile",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2021/11/27",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"powershell\" and ProcessCommandLine contains \".DownloadFile\" and ProcessCommandLine contains \"System.Net.WebClient\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059",
          "T1104",
          "T1105"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
