{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2e65275c-8288-4ab4-aeb7-6274f58b6b20')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2e65275c-8288-4ab4-aeb7-6274f58b6b20')]",
      "properties": {
        "alertRuleTemplateName": "2e65275c-8288-4ab4-aeb7-6274f58b6b20",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/08/16",
        "description": "Detects usage of the SysInternals Procdump utility",
        "displayName": "Procdump Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/28",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\procdump.exe\" or FolderPath endswith \"\\\\procdump64.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1003",
          "T1036"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
