{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/af77cf95-c469-471c-b6a0-946c685c4798')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/af77cf95-c469-471c-b6a0-946c685c4798')]",
      "properties": {
        "alertRuleTemplateName": "af77cf95-c469-471c-b6a0-946c685c4798",
        "author": "Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), Florian Roth (Nextron Systems), Sreeman, FPT.EagleEye Team",
        "customDetails": null,
        "date": "2020/10/12",
        "description": "Detects the use of the Windows Update Client binary (wuauclt.exe) for proxy execution.",
        "displayName": "Proxy Execution Via Wuauclt.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/11",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"UpdateDeploymentProvider\" and ProcessCommandLine contains \"RunHandlerComServer\") and (FolderPath endswith \"\\\\wuauclt.exe\" or ProcessVersionInfoOriginalFileName =~ \"wuauclt.exe\")) and (not((ProcessCommandLine contains \" /UpdateDeploymentProvider UpdateDeploymentProvider.dll \" or (ProcessCommandLine contains \":\\\\Windows\\\\UUS\\\\Packages\\\\Preview\\\\amd64\\\\updatedeploy.dll /ClassId\" or ProcessCommandLine contains \":\\\\Windows\\\\UUS\\\\amd64\\\\UpdateDeploy.dll /ClassId\") or (ProcessCommandLine contains \":\\\\Windows\\\\WinSxS\\\\\" and ProcessCommandLine contains \"\\\\UpdateDeploy.dll /ClassId \") or ProcessCommandLine contains \" wuaueng.dll \")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
