{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/730fc21b-eaff-474b-ad23-90fd265d4988')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/730fc21b-eaff-474b-ad23-90fd265d4988')]",
      "properties": {
        "alertRuleTemplateName": "730fc21b-eaff-474b-ad23-90fd265d4988",
        "author": "omkar72",
        "customDetails": null,
        "date": "2020/10/30",
        "description": "Detects user accept agreement execution in psexec commandline",
        "displayName": "Psexec Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/28",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\psexec.exe\" or ProcessVersionInfoOriginalFileName =~ \"psexec.c\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1021",
          "t1569"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
