{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5817e76f-4804-41e6-8f1d-5fa0b3ecae2d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5817e76f-4804-41e6-8f1d-5fa0b3ecae2d')]",
      "properties": {
        "alertRuleTemplateName": "5817e76f-4804-41e6-8f1d-5fa0b3ecae2d",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/01/22",
        "description": "Detects the execution of Radmin which can be abused by an adversary to remotely control Windows machines",
        "displayName": "PUA - Radmin Viewer Utility Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/11",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoFileDescription =~ \"Radmin Viewer\" or ProcessVersionInfoProductName =~ \"Radmin Viewer\" or ProcessVersionInfoOriginalFileName =~ \"Radmin.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1072"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
