{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bdeeabc9-ff2a-4a51-be59-bb253aac7891')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bdeeabc9-ff2a-4a51-be59-bb253aac7891')]",
      "properties": {
        "alertRuleTemplateName": "bdeeabc9-ff2a-4a51-be59-bb253aac7891",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/12/02",
        "description": "Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let the user execute programs with different permissions (System, Trusted Installer, Administrator...etc)",
        "displayName": "PUA - Wsudo Suspicious Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/14",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-u System\" or ProcessCommandLine contains \"-uSystem\" or ProcessCommandLine contains \"-u TrustedInstaller\" or ProcessCommandLine contains \"-uTrustedInstaller\" or ProcessCommandLine contains \" --ti \") or (FolderPath endswith \"\\\\wsudo.exe\" or ProcessVersionInfoOriginalFileName =~ \"wsudo.exe\" or ProcessVersionInfoFileDescription =~ \"Windows sudo utility\" or InitiatingProcessFolderPath endswith \"\\\\wsudo-bridge.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
