{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/38646daa-e78f-4ace-9de0-55547b2d30da')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/38646daa-e78f-4ace-9de0-55547b2d30da')]",
      "properties": {
        "alertRuleTemplateName": "38646daa-e78f-4ace-9de0-55547b2d30da",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/10/18",
        "description": "Detects the execution of the PUA/Recon tool Seatbelt via PE information of command line parameters",
        "displayName": "PUA - Seatbelt Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/04",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\Seatbelt.exe\" or ProcessVersionInfoOriginalFileName =~ \"Seatbelt.exe\" or ProcessVersionInfoFileDescription =~ \"Seatbelt\" or (ProcessCommandLine contains \" DpapiMasterKeys\" or ProcessCommandLine contains \" InterestingProcesses\" or ProcessCommandLine contains \" InterestingFiles\" or ProcessCommandLine contains \" CertificateThumbprints\" or ProcessCommandLine contains \" ChromiumBookmarks\" or ProcessCommandLine contains \" ChromiumHistory\" or ProcessCommandLine contains \" ChromiumPresence\" or ProcessCommandLine contains \" CloudCredentials\" or ProcessCommandLine contains \" CredEnum\" or ProcessCommandLine contains \" CredGuard\" or ProcessCommandLine contains \" FirefoxHistory\" or ProcessCommandLine contains \" ProcessCreationEvents\")) or ((ProcessCommandLine contains \" -group=misc\" or ProcessCommandLine contains \" -group=remote\" or ProcessCommandLine contains \" -group=chromium\" or ProcessCommandLine contains \" -group=slack\" or ProcessCommandLine contains \" -group=system\" or ProcessCommandLine contains \" -group=user\" or ProcessCommandLine contains \" -group=all\") and ProcessCommandLine contains \" -outputfile=\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "T1083",
          "T1087",
          "T1526"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
