{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31')]",
      "properties": {
        "alertRuleTemplateName": "ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/05/14",
        "description": "Detects the use of Ngrok, a utility used for port forwarding and tunneling, often used by threat actors to make local protected services publicly available.\nInvolved domains are bin.equinox.io for download and *.ngrok.io for connections.\n",
        "displayName": "PUA - Ngrok Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" tcp 139\" or ProcessCommandLine contains \" tcp 445\" or ProcessCommandLine contains \" tcp 3389\" or ProcessCommandLine contains \" tcp 5985\" or ProcessCommandLine contains \" tcp 5986\") or (ProcessCommandLine contains \" start \" and ProcessCommandLine contains \"--all\" and ProcessCommandLine contains \"--config\" and ProcessCommandLine contains \".yml\") or ((ProcessCommandLine contains \" tcp \" or ProcessCommandLine contains \" http \" or ProcessCommandLine contains \" authtoken \") and FolderPath endswith \"ngrok.exe\") or (ProcessCommandLine contains \".exe authtoken \" or ProcessCommandLine contains \".exe start --all\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1572"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
