{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/32410e29-5f94-4568-b6a3-d91a8adad863')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/32410e29-5f94-4568-b6a3-d91a8adad863')]",
      "properties": {
        "alertRuleTemplateName": "32410e29-5f94-4568-b6a3-d91a8adad863",
        "author": "frack113, Florian Roth",
        "customDetails": null,
        "date": "2022/09/02",
        "description": "Detects the use of Fast Reverse Proxy. frp is a fast reverse proxy to help you expose a local server behind a NAT or firewall to the Internet.",
        "displayName": "PUA - Fast Reverse Proxy (FRP) Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/04",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"\\\\frpc.ini\" or ((MD5 startswith \"7D9C233B8C9E3F0EA290D2B84593C842\" or SHA1 startswith \"06DDC9280E1F1810677935A2477012960905942F\" or SHA256 startswith \"57B0936B8D336D8E981C169466A15A5FD21A7D5A2C7DAF62D5E142EE860E387C\") or MD5 =~ \"7d9c233b8c9e3f0ea290d2b84593c842\" or SHA1 =~ \"06ddc9280e1f1810677935a2477012960905942f\" or SHA256 =~ \"57b0936b8d336d8e981c169466a15a5fd21a7d5a2c7daf62d5e142ee860e387c\") or (FolderPath endswith \"\\\\frpc.exe\" or FolderPath endswith \"\\\\frps.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1090"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
