{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fa00b701-44c6-4679-994d-5a18afa8a707')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fa00b701-44c6-4679-994d-5a18afa8a707')]",
      "properties": {
        "alertRuleTemplateName": "fa00b701-44c6-4679-994d-5a18afa8a707",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/01/20",
        "description": "Detects the execution of AdvancedRun utility in the context of the TrustedInstaller, SYSTEM, Local Service or Network Service accounts",
        "displayName": "PUA - AdvancedRun Suspicious Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/EXEFilename\" or ProcessCommandLine contains \"/CommandLine\") and ((ProcessCommandLine contains \" /RunAs 8 \" or ProcessCommandLine contains \" /RunAs 4 \" or ProcessCommandLine contains \" /RunAs 10 \" or ProcessCommandLine contains \" /RunAs 11 \") or (ProcessCommandLine endswith \"/RunAs 8\" or ProcessCommandLine endswith \"/RunAs 4\" or ProcessCommandLine endswith \"/RunAs 10\" or ProcessCommandLine endswith \"/RunAs 11\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1134"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
