{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bef0bc5a-b9ae-425d-85c6-7b2d705980c6')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bef0bc5a-b9ae-425d-85c6-7b2d705980c6')]",
      "properties": {
        "alertRuleTemplateName": "bef0bc5a-b9ae-425d-85c6-7b2d705980c6",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/12/10",
        "description": "Detects a Python process initiating a network connection. While this often relates to package installation, it can also indicate a potential malicious script communicating with a C&C server.",
        "displayName": "Python Initiated Connection",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "2023/09/07",
        "query": "DeviceNetworkEvents\n| where InitiatingProcessFolderPath contains \"python\" and (not((RemoteIP =~ \"127.0.0.1\" and LocalIP =~ \"127.0.0.1\"))) and (not((((InitiatingProcessCommandLine contains \":\\\\ProgramData\\\\Anaconda3\\\\Scripts\\\\conda-script.py\" and InitiatingProcessCommandLine contains \"update\") and InitiatingProcessParentFileName =~ \"conda.exe\") or (InitiatingProcessCommandLine contains \"C:\\\\ProgramData\\\\Anaconda3\\\\Scripts\\\\jupyter-notebook-script.py\" and InitiatingProcessParentFileName =~ \"python.exe\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "t1046"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
