{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/241e802a-b65e-484f-88cd-c2dc10f9206d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/241e802a-b65e-484f-88cd-c2dc10f9206d')]",
      "properties": {
        "alertRuleTemplateName": "241e802a-b65e-484f-88cd-c2dc10f9206d",
        "author": "frack113, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/03/07",
        "description": "Detect the use of \"<\" to read and potentially execute a file via cmd.exe",
        "displayName": "Read Contents From Stdin Via Cmd.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"<\" and (ProcessVersionInfoOriginalFileName =~ \"Cmd.Exe\" or FolderPath endswith \"\\\\cmd.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
