{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e01fa958-6893-41d4-ae03-182477c5e77d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e01fa958-6893-41d4-ae03-182477c5e77d')]",
      "properties": {
        "alertRuleTemplateName": "e01fa958-6893-41d4-ae03-182477c5e77d",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/19",
        "description": "Detects execution of Remote Utilities RAT (RURAT) from an unusual location (outside of 'C:\\Program Files')",
        "displayName": "Remote Access Tool - RURAT Execution From Unusual Location",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/05",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\rutserv.exe\" or FolderPath endswith \"\\\\rfusclient.exe\") or ProcessVersionInfoProductName =~ \"Remote Utilities\") and (not((FolderPath startswith \"C:\\\\Program Files\\\\Remote Utilities\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\Remote Utilities\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
