{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2433a154-bb3d-42e4-86c3-a26bdac91c45')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2433a154-bb3d-42e4-86c3-a26bdac91c45')]",
      "properties": {
        "alertRuleTemplateName": "2433a154-bb3d-42e4-86c3-a26bdac91c45",
        "author": "Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2024/01/11",
        "description": "Detects the execution of a renamed \"PingCastle\" binary based on the PE metadata fields.",
        "displayName": "Renamed PingCastle Binary Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ((ProcessVersionInfoOriginalFileName in~ (\"PingCastleReporting.exe\", \"PingCastleCloud.exe\", \"PingCastle.exe\")) or (ProcessCommandLine contains \"--scanner aclcheck\" or ProcessCommandLine contains \"--scanner antivirus\" or ProcessCommandLine contains \"--scanner computerversion\" or ProcessCommandLine contains \"--scanner foreignusers\" or ProcessCommandLine contains \"--scanner laps_bitlocker\" or ProcessCommandLine contains \"--scanner localadmin\" or ProcessCommandLine contains \"--scanner nullsession\" or ProcessCommandLine contains \"--scanner nullsession-trust\" or ProcessCommandLine contains \"--scanner oxidbindings\" or ProcessCommandLine contains \"--scanner remote\" or ProcessCommandLine contains \"--scanner share\" or ProcessCommandLine contains \"--scanner smb\" or ProcessCommandLine contains \"--scanner smb3querynetwork\" or ProcessCommandLine contains \"--scanner spooler\" or ProcessCommandLine contains \"--scanner startup\" or ProcessCommandLine contains \"--scanner zerologon\") or ProcessCommandLine contains \"--no-enum-limit\" or (ProcessCommandLine contains \"--healthcheck\" and ProcessCommandLine contains \"--level Full\") or (ProcessCommandLine contains \"--healthcheck\" and ProcessCommandLine contains \"--server \")) and (not((FolderPath endswith \"\\\\PingCastleReporting.exe\" or FolderPath endswith \"\\\\PingCastleCloud.exe\" or FolderPath endswith \"\\\\PingCastle.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059",
          "t1202"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
