{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ec0722a3-eb5c-4a56-8ab2-bf6f20708592')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ec0722a3-eb5c-4a56-8ab2-bf6f20708592')]",
      "properties": {
        "alertRuleTemplateName": "ec0722a3-eb5c-4a56-8ab2-bf6f20708592",
        "author": "Nasreddine Bencherchali (Nextron Systems), frack113",
        "customDetails": null,
        "date": "2023/08/09",
        "description": "Detects the execution of a renamed \"gpg.exe\". Often used by ransomware and loaders to decrypt/encrypt data.",
        "displayName": "Renamed Gpg.EXE Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoOriginalFileName =~ \"gpg.exe\" and (not((FolderPath endswith \"\\\\gpg.exe\" or FolderPath endswith \"\\\\gpg2.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "impact"
        ],
        "techniques": [
          "t1486"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
