{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1a1ed54a-2ba4-4221-94d5-01dee560d71e')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1a1ed54a-2ba4-4221-94d5-01dee560d71e')]",
      "properties": {
        "alertRuleTemplateName": "1a1ed54a-2ba4-4221-94d5-01dee560d71e",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/20",
        "description": "Detects uses of a renamed legitimate createdump.exe LOLOBIN utility to dump process memory",
        "displayName": "Renamed CreateDump Utility Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/14",
        "query": "DeviceProcessEvents\n| where (((ProcessCommandLine contains \" -u \" and ProcessCommandLine contains \" -f \" and ProcessCommandLine contains \".dmp\") or (ProcessCommandLine contains \" --full \" and ProcessCommandLine contains \" --name \" and ProcessCommandLine contains \".dmp\")) or ProcessVersionInfoOriginalFileName =~ \"FX_VER_INTERNALNAME_STR\") and (not(FolderPath endswith \"\\\\createdump.exe\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003",
          "t1036"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
