{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e6474a1b-5390-49cd-ab41-8d88655f7394')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e6474a1b-5390-49cd-ab41-8d88655f7394')]",
      "properties": {
        "alertRuleTemplateName": "e6474a1b-5390-49cd-ab41-8d88655f7394",
        "author": "frack113, Florian Roth",
        "customDetails": null,
        "date": "2022/12/05",
        "description": "Detects the execution of a renamed version of the \"Mavinject\" process. Which can be abused to perform process injection using the \"/INJECTRUNNING\" flag",
        "displayName": "Renamed Mavinject.EXE Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/03",
        "query": "DeviceProcessEvents\n| where (ProcessVersionInfoOriginalFileName in~ (\"mavinject32.exe\", \"mavinject64.exe\")) and (not((FolderPath endswith \"\\\\mavinject32.exe\" or FolderPath endswith \"\\\\mavinject64.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1055",
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
