{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cd764533-2e07-40d6-a718-cfeec7f2da7f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cd764533-2e07-40d6-a718-cfeec7f2da7f')]",
      "properties": {
        "alertRuleTemplateName": "cd764533-2e07-40d6-a718-cfeec7f2da7f",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2020/05/28",
        "description": "Detects suspicious renamed SysInternals DebugView execution",
        "displayName": "Renamed SysInternals DebugView Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/14",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoProductName =~ \"Sysinternals DebugView\" and (not((FolderPath endswith \"\\\\Dbgview.exe\" and ProcessVersionInfoOriginalFileName =~ \"Dbgview.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1588"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
