{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/198effb6-6c98-4d0c-9ea3-451fa143c45c')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/198effb6-6c98-4d0c-9ea3-451fa143c45c')]",
      "properties": {
        "alertRuleTemplateName": "198effb6-6c98-4d0c-9ea3-451fa143c45c",
        "author": "Avneet Singh @v3t0_, oscd.community, Christopher Peacock @SecurePeacock (updated)",
        "customDetails": null,
        "date": "2020/10/18",
        "description": "This rule detects the execution of Run Once task as configured in the registry",
        "displayName": "Run Once Task Execution as Configured in Registry",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/AlternateShellStartup\" or ProcessCommandLine endswith \"/r\") and (FolderPath endswith \"\\\\runonce.exe\" or ProcessVersionInfoFileDescription =~ \"Run Once Wrapper\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "low",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1112"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
