{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c3a99af4-35a9-4668-879e-c09aeb4f2bdf')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c3a99af4-35a9-4668-879e-c09aeb4f2bdf')]",
      "properties": {
        "alertRuleTemplateName": "c3a99af4-35a9-4668-879e-c09aeb4f2bdf",
        "author": "Tim Shelton, Florian Roth (Nextron Systems), Yassine Oukessou",
        "customDetails": null,
        "date": "2022/01/13",
        "description": "Detects the execution of rundll32 with a command line that doesn't contain a common extension",
        "displayName": "Rundll32 Execution With Uncommon DLL Extension",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/04/04",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\rundll32.exe\" or ProcessVersionInfoOriginalFileName =~ \"RUNDLL32.EXE\") and (not((ProcessCommandLine =~ \"\" or ((ProcessCommandLine contains \".cpl \" or ProcessCommandLine contains \".cpl,\" or ProcessCommandLine contains \".cpl\\\"\" or ProcessCommandLine contains \".cpl'\" or ProcessCommandLine contains \".dll \" or ProcessCommandLine contains \".dll,\" or ProcessCommandLine contains \".dll\\\"\" or ProcessCommandLine contains \".dll'\" or ProcessCommandLine contains \".inf \" or ProcessCommandLine contains \".inf,\" or ProcessCommandLine contains \".inf\\\"\" or ProcessCommandLine contains \".inf'\") or (ProcessCommandLine endswith \".cpl\" or ProcessCommandLine endswith \".dll\" or ProcessCommandLine endswith \".inf\")) or ProcessCommandLine contains \" -localserver \" or isnull(ProcessCommandLine) or ((ProcessCommandLine contains \":\\\\Windows\\\\Installer\\\\\" and ProcessCommandLine contains \".tmp\" and ProcessCommandLine contains \"zzzzInvokeManagedCustomActionOutOfProc\") and InitiatingProcessFolderPath endswith \"\\\\msiexec.exe\")))) and (not((InitiatingProcessCommandLine contains \":\\\\Users\\\\\" and InitiatingProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\{\" and InitiatingProcessCommandLine contains \"\\\\EDGEMITMP_\" and InitiatingProcessCommandLine contains \".tmp\\\\setup.exe\" and InitiatingProcessCommandLine contains \"--install-archive=\" and InitiatingProcessCommandLine contains \"--previous-version=\" and InitiatingProcessCommandLine contains \"--msedgewebview --verbose-logging --do-not-launch-msedge --user-level\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
