{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cdc8da7d-c303-42f8-b08c-b4ab47230263')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cdc8da7d-c303-42f8-b08c-b4ab47230263')]",
      "properties": {
        "alertRuleTemplateName": "cdc8da7d-c303-42f8-b08c-b4ab47230263",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2017/11/04",
        "description": "Detects a rundll32 that communicates with public IP addresses",
        "displayName": "Rundll32 Internet Connection",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "2024/03/13",
        "query": "DeviceNetworkEvents\n| where InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" and (not((InitiatingProcessCommandLine endswith \"\\\\system32\\\\PcaSvc.dll,PcaPatchSdbTask\" or DeviceName endswith \".internal.cloudapp.net\" or (ipv4_is_in_range(RemoteIP, \"127.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"10.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"172.16.0.0/12\") or ipv4_is_in_range(RemoteIP, \"192.168.0.0/16\") or ipv4_is_in_range(RemoteIP, \"169.254.0.0/16\") or ipv4_is_in_range(RemoteIP, \"::1/128\") or ipv4_is_in_range(RemoteIP, \"fe80::/10\") or ipv4_is_in_range(RemoteIP, \"fc00::/7\")) or (ipv4_is_in_range(RemoteIP, \"20.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"51.103.0.0/16\") or ipv4_is_in_range(RemoteIP, \"51.104.0.0/16\") or ipv4_is_in_range(RemoteIP, \"51.105.0.0/16\")) or (RemotePort == 443 and InitiatingProcessParentFileName =~ \"svchost.exe\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
