{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/86588b36-c6d3-465f-9cee-8f9093e07798')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/86588b36-c6d3-465f-9cee-8f9093e07798')]",
      "properties": {
        "alertRuleTemplateName": "86588b36-c6d3-465f-9cee-8f9093e07798",
        "author": "X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/07/18",
        "description": "Detects the creation of a schtasks that potentially executes a payload stored in the Windows Registry using PowerShell.",
        "displayName": "Scheduled Task Executing Payload from Registry",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/Create\" and (ProcessCommandLine contains \"Get-ItemProperty\" or ProcessCommandLine contains \" gp \") and (ProcessCommandLine contains \"HKCU:\" or ProcessCommandLine contains \"HKLM:\" or ProcessCommandLine contains \"registry::\" or ProcessCommandLine contains \"HKEY_\") and (FolderPath endswith \"\\\\schtasks.exe\" or ProcessVersionInfoOriginalFileName =~ \"schtasks.exe\")) and (not((ProcessCommandLine contains \"FromBase64String\" or ProcessCommandLine contains \"encodedcommand\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution",
          "persistence"
        ],
        "techniques": [
          "t1053",
          "t1059"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
