{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1228c958-e64e-4e71-92ad-7d429f4138ba')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1228c958-e64e-4e71-92ad-7d429f4138ba')]",
      "properties": {
        "alertRuleTemplateName": "1228c958-e64e-4e71-92ad-7d429f4138ba",
        "author": "Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/02/08",
        "description": "Detects a suspicious script execution in temporary folders or folders accessible by environment variables",
        "displayName": "Script Interpreter Execution From Suspicious Folder",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/06/16",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -ep bypass \" or ProcessCommandLine contains \" -ExecutionPolicy bypass \" or ProcessCommandLine contains \" -w hidden \" or ProcessCommandLine contains \"/e:javascript \" or ProcessCommandLine contains \"/e:Jscript \" or ProcessCommandLine contains \"/e:vbscript \") or (FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\wscript.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"cscript.exe\", \"mshta.exe\", \"wscript.exe\"))) and ((ProcessCommandLine contains \":\\\\Perflogs\\\\\" or ProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\" or ProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Temp\" or ProcessCommandLine contains \"\\\\Temporary Internet\" or ProcessCommandLine contains \"\\\\Windows\\\\Temp\") or ((ProcessCommandLine contains \":\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\Favorites\\\\\") or (ProcessCommandLine contains \":\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\Favourites\\\\\") or (ProcessCommandLine contains \":\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\Contacts\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
