{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b2b048b0-7857-4380-b0fb-d3f0ab820b71')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b2b048b0-7857-4380-b0fb-d3f0ab820b71')]",
      "properties": {
        "alertRuleTemplateName": "b2b048b0-7857-4380-b0fb-d3f0ab820b71",
        "author": "Joseliyo Sanchez, @Joseliyo_Jstnk, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2024/02/05",
        "description": "Detects the use of iexpress.exe to create binaries via Self Extraction Directive (SED) files located in potentially suspicious locations.\nThis behavior has been observed in-the-wild by different threat actors.\n",
        "displayName": "Self Extracting Package Creation Via Iexpress.EXE From Potentially Suspicious Location",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" /n \" and (FolderPath endswith \"\\\\iexpress.exe\" or ProcessVersionInfoOriginalFileName =~ \"IEXPRESS.exe\") and (ProcessCommandLine contains \":\\\\ProgramData\\\\\" or ProcessCommandLine contains \":\\\\Temp\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
