{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8b93a509-1cb8-42e1-97aa-ee24224cdc15')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8b93a509-1cb8-42e1-97aa-ee24224cdc15')]",
      "properties": {
        "alertRuleTemplateName": "8b93a509-1cb8-42e1-97aa-ee24224cdc15",
        "author": "Nasreddine Bencherchali (Nextron Systems), frack113",
        "customDetails": null,
        "date": "2024/05/10",
        "description": "Detects the dump of highly sensitive files such as \"NTDS.DIT\" and \"SECURITY\" hive.\nAttackers can leverage the \"wbadmin\" utility in order to dump sensitive files that might contain credential or sensitive information.\n",
        "displayName": "Sensitive File Dump Via Wbadmin.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"start\" or ProcessCommandLine contains \"backup\") and (FolderPath endswith \"\\\\wbadmin.exe\" or ProcessVersionInfoOriginalFileName =~ \"WBADMIN.EXE\") and (ProcessCommandLine contains \"\\\\config\\\\SAM\" or ProcessCommandLine contains \"\\\\config\\\\SECURITY\" or ProcessCommandLine contains \"\\\\config\\\\SYSTEM\" or ProcessCommandLine contains \"\\\\Windows\\\\NTDS\\\\NTDS.dit\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
