{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a746c9b8-a2fb-4ee5-a428-92bee9e99060')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a746c9b8-a2fb-4ee5-a428-92bee9e99060')]",
      "properties": {
        "alertRuleTemplateName": "a746c9b8-a2fb-4ee5-a428-92bee9e99060",
        "author": "Agro (@agro_sev) oscd.communitly",
        "customDetails": null,
        "date": "2020/10/13",
        "description": "This rule detects execution of a PowerShell code through the sqltoolsps.exe utility, which is included in the standard set of utilities supplied with the Microsoft SQL Server Management studio.\nScript blocks are not logged in this case, so this utility helps to bypass protection mechanisms based on the analysis of these logs.\n",
        "displayName": "SQL Client Tools PowerShell Session Detection",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/02/25",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\sqltoolsps.exe\" or InitiatingProcessFolderPath endswith \"\\\\sqltoolsps.exe\" or ProcessVersionInfoOriginalFileName =~ \"\\\\sqltoolsps.exe\") and (not(InitiatingProcessFolderPath endswith \"\\\\smss.exe\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059",
          "t1127"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
