{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cd1f961e-0b96-436b-b7c6-38da4583ec00')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cd1f961e-0b96-436b-b7c6-38da4583ec00')]",
      "properties": {
        "alertRuleTemplateName": "cd1f961e-0b96-436b-b7c6-38da4583ec00",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/02/11",
        "description": "Detects the execution of \"logman\" utility in order to disable or delete Windows trace sessions",
        "displayName": "Suspicious Windows Trace ETW Session Tamper Via Logman.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"stop \" or ProcessCommandLine contains \"delete \") and (FolderPath endswith \"\\\\logman.exe\" or ProcessVersionInfoOriginalFileName =~ \"Logman.exe\") and (ProcessCommandLine contains \"Circular Kernel Context Logger\" or ProcessCommandLine contains \"EventLog-\" or ProcessCommandLine contains \"SYSMON TRACE\" or ProcessCommandLine contains \"SysmonDnsEtwSession\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1070",
          "t1562"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
