{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a35f5a72-f347-4e36-8895-9869b0d5fc6d')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a35f5a72-f347-4e36-8895-9869b0d5fc6d')]",
      "properties": {
        "alertRuleTemplateName": "a35f5a72-f347-4e36-8895-9869b0d5fc6d",
        "author": "Sander Wiebing, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community",
        "customDetails": null,
        "date": "2020/05/25",
        "description": "Detects Netsh command execution that whitelists a program located in a suspicious location in the Windows Firewall",
        "displayName": "Suspicious Program Location Whitelisted In Firewall Via Netsh.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/11",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"firewall\" and ProcessCommandLine contains \"add\" and ProcessCommandLine contains \"allowedprogram\") or (ProcessCommandLine contains \"advfirewall\" and ProcessCommandLine contains \"firewall\" and ProcessCommandLine contains \"add\" and ProcessCommandLine contains \"rule\" and ProcessCommandLine contains \"action=allow\" and ProcessCommandLine contains \"program=\")) and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\") and (ProcessCommandLine contains \":\\\\$Recycle.bin\\\\\" or ProcessCommandLine contains \":\\\\RECYCLER.BIN\\\\\" or ProcessCommandLine contains \":\\\\RECYCLERS.BIN\\\\\" or ProcessCommandLine contains \":\\\\SystemVolumeInformation\\\\\" or ProcessCommandLine contains \":\\\\Temp\\\\\" or ProcessCommandLine contains \":\\\\Users\\\\Default\\\\\" or ProcessCommandLine contains \":\\\\Users\\\\Desktop\\\\\" or ProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\addins\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\cursors\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\debug\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\drivers\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\fonts\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\help\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\system32\\\\tasks\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\Downloads\\\\\" or ProcessCommandLine contains \"\\\\Local Settings\\\\Temporary Internet Files\\\\\" or ProcessCommandLine contains \"\\\\Temporary Internet Files\\\\Content.Outlook\\\\\" or ProcessCommandLine contains \"%Public%\\\\\" or ProcessCommandLine contains \"%TEMP%\" or ProcessCommandLine contains \"%TMP%\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1562"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
