{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c5c00f49-b3f9-45a6-997e-cfdecc6e1967')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c5c00f49-b3f9-45a6-997e-cfdecc6e1967')]",
      "properties": {
        "alertRuleTemplateName": "c5c00f49-b3f9-45a6-997e-cfdecc6e1967",
        "author": "pH-T (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/03/15",
        "description": "Detects the creation of a schtask that executes a file from C:\\Users\\<USER>\\AppData\\Local",
        "displayName": "Suspicious Schtasks Execution AppData Folder",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/07/28",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"NT AUT\" or ProcessCommandLine contains \" SYSTEM \") and (ProcessCommandLine contains \"/Create\" and ProcessCommandLine contains \"/RU\" and ProcessCommandLine contains \"/TR\" and ProcessCommandLine contains \"C:\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\") and FolderPath endswith \"\\\\schtasks.exe\") and (not((ProcessCommandLine contains \"/TN TVInstallRestore\" and FolderPath endswith \"\\\\schtasks.exe\" and (InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and InitiatingProcessFolderPath contains \"TeamViewer_.exe\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution",
          "persistence"
        ],
        "techniques": [
          "T1053",
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
