{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1c0e41cd-21bb-4433-9acc-4a2cd6367b9b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1c0e41cd-21bb-4433-9acc-4a2cd6367b9b')]",
      "properties": {
        "alertRuleTemplateName": "1c0e41cd-21bb-4433-9acc-4a2cd6367b9b",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/07/28",
        "description": "Detects when an attacker tries to modify an already existing scheduled tasks to run from a suspicious location\nAttackers can create a simple looking task in order to avoid detection on creation as it's often the most focused on\nInstead they modify the task after creation to include their malicious payload\n",
        "displayName": "Suspicious Modification Of Scheduled Tasks",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/11/18",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" /Change \" and ProcessCommandLine contains \" /TN \") and FolderPath endswith \"\\\\schtasks.exe\") and (ProcessCommandLine contains \"regsvr32\" or ProcessCommandLine contains \"rundll32\" or ProcessCommandLine contains \"cmd /c \" or ProcessCommandLine contains \"cmd /k \" or ProcessCommandLine contains \"cmd /r \" or ProcessCommandLine contains \"cmd.exe /c \" or ProcessCommandLine contains \"cmd.exe /k \" or ProcessCommandLine contains \"cmd.exe /r \" or ProcessCommandLine contains \"powershell\" or ProcessCommandLine contains \"mshta\" or ProcessCommandLine contains \"wscript\" or ProcessCommandLine contains \"cscript\" or ProcessCommandLine contains \"certutil\" or ProcessCommandLine contains \"bitsadmin\" or ProcessCommandLine contains \"bash.exe\" or ProcessCommandLine contains \"bash \" or ProcessCommandLine contains \"scrcons\" or ProcessCommandLine contains \"wmic \" or ProcessCommandLine contains \"wmic.exe\" or ProcessCommandLine contains \"forfiles\" or ProcessCommandLine contains \"scriptrunner\" or ProcessCommandLine contains \"hh.exe\" or ProcessCommandLine contains \"hh \") and (ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\" or ProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or ProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"\\\\WINDOWS\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\Desktop\\\\\" or ProcessCommandLine contains \"\\\\Downloads\\\\\" or ProcessCommandLine contains \"\\\\Temporary Internet\" or ProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or ProcessCommandLine contains \"C:\\\\Perflogs\\\\\" or ProcessCommandLine contains \"%ProgramData%\" or ProcessCommandLine contains \"%appdata%\" or ProcessCommandLine contains \"%comspec%\" or ProcessCommandLine contains \"%localappdata%\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1053"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
