{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9ccba514-7cb6-4c5c-b377-700758f2f120')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9ccba514-7cb6-4c5c-b377-700758f2f120')]",
      "properties": {
        "alertRuleTemplateName": "9ccba514-7cb6-4c5c-b377-700758f2f120",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/08/14",
        "description": "Detects potentially suspicious child processes of \"aspnet_compiler.exe\".",
        "displayName": "Suspicious Child Process of AspNetCompiler",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\calc.exe\" or FolderPath endswith \"\\\\notepad.exe\") or (FolderPath contains \"\\\\Users\\\\Public\\\\\" or FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or FolderPath contains \"\\\\AppData\\\\Local\\\\Roaming\\\\\" or FolderPath contains \":\\\\Temp\\\\\" or FolderPath contains \":\\\\Windows\\\\Temp\\\\\" or FolderPath contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or FolderPath contains \":\\\\Windows\\\\Tasks\\\\\")) and InitiatingProcessFolderPath endswith \"\\\\aspnet_compiler.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1127"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
