{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d042284c-a296-4988-9be5-f424fadcc28c')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d042284c-a296-4988-9be5-f424fadcc28c')]",
      "properties": {
        "alertRuleTemplateName": "d042284c-a296-4988-9be5-f424fadcc28c",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/01/23",
        "description": "Uses the .NET InstallUtil.exe application in order to execute image without log",
        "displayName": "Suspicious Execution of InstallUtil Without Log",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/02/04",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/logfile= \" and ProcessCommandLine contains \"/LogToConsole=false\") and FolderPath contains \"Microsoft.NET\\\\Framework\" and FolderPath endswith \"\\\\InstallUtil.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
