{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cbec226f-63d9-4eca-9f52-dfb6652f24df')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cbec226f-63d9-4eca-9f52-dfb6652f24df')]",
      "properties": {
        "alertRuleTemplateName": "cbec226f-63d9-4eca-9f52-dfb6652f24df",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/03/21",
        "description": "Detects suspicious parent processes that should not have any children or should only have a single possible child program",
        "displayName": "Suspicious Process Parents",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/09/08",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessFolderPath endswith \"\\\\minesweeper.exe\" or InitiatingProcessFolderPath endswith \"\\\\winver.exe\" or InitiatingProcessFolderPath endswith \"\\\\bitsadmin.exe\") or ((InitiatingProcessFolderPath endswith \"\\\\csrss.exe\" or InitiatingProcessFolderPath endswith \"\\\\certutil.exe\" or InitiatingProcessFolderPath endswith \"\\\\eventvwr.exe\" or InitiatingProcessFolderPath endswith \"\\\\calc.exe\" or InitiatingProcessFolderPath endswith \"\\\\notepad.exe\") and (not((isnull(FolderPath) or (FolderPath endswith \"\\\\WerFault.exe\" or FolderPath endswith \"\\\\wermgr.exe\" or FolderPath endswith \"\\\\conhost.exe\" or FolderPath endswith \"\\\\mmc.exe\" or FolderPath endswith \"\\\\win32calc.exe\" or FolderPath endswith \"\\\\notepad.exe\")))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1036"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
