{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/285b85b1-a555-4095-8652-a8a4106af63f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/285b85b1-a555-4095-8652-a8a4106af63f')]",
      "properties": {
        "alertRuleTemplateName": "285b85b1-a555-4095-8652-a8a4106af63f",
        "author": "Konstantin Grishchenko, oscd.community",
        "customDetails": null,
        "date": "2020/10/07",
        "description": "setupapi.dll library provide InstallHinfSection function for processing INF files. INF file may contain instructions allowing to create values in the registry, modify files and install drivers. This technique could be used to obtain persistence via modifying one of Run or RunOnce registry keys, run process or use other DLLs chain calls (see references) InstallHinfSection function in setupapi.dll calls runonce.exe executable regardless of actual content of INF file.",
        "displayName": "Suspicious Rundll32 Setupapi.dll Activity",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2021/11/27",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\runonce.exe\" and (InitiatingProcessCommandLine contains \"setupapi.dll\" and InitiatingProcessCommandLine contains \"InstallHinfSection\") and InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
