{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5ce0f04e-3efc-42af-839d-5b3a543b76c0')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5ce0f04e-3efc-42af-839d-5b3a543b76c0')]",
      "properties": {
        "alertRuleTemplateName": "5ce0f04e-3efc-42af-839d-5b3a543b76c0",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/07/12",
        "description": "Detects process execution from a fake recycle bin folder, often used to avoid security solution.",
        "displayName": "Suspicious Process Execution From Fake Recycle.Bin Folder",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/11",
        "query": "DeviceProcessEvents\n| where FolderPath contains \"RECYCLERS.BIN\\\\\" or FolderPath contains \"RECYCLER.BIN\\\\\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
