{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c7942406-33dd-4377-a564-0f62db0593a3')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c7942406-33dd-4377-a564-0f62db0593a3')]",
      "properties": {
        "alertRuleTemplateName": "c7942406-33dd-4377-a564-0f62db0593a3",
        "author": "Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community",
        "customDetails": null,
        "date": "2019/10/14",
        "description": "Detects a code page switch in command line or batch scripts to a rare language",
        "displayName": "Suspicious CodePage Switch Via CHCP",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/07",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \" 936\" or ProcessCommandLine endswith \" 1258\") and FolderPath endswith \"\\\\chcp.com\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1036"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
