{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/dc4576d4-7467-424f-9eee-fd2b02855fe0')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/dc4576d4-7467-424f-9eee-fd2b02855fe0')]",
      "properties": {
        "alertRuleTemplateName": "dc4576d4-7467-424f-9eee-fd2b02855fe0",
        "author": "Nasreddine Bencherchali (Nextron Systems), GossiTheDog, frack113",
        "customDetails": null,
        "date": "2022/06/21",
        "description": "Detects execution of msdt.exe using the \"cab\" flag which could indicates suspicious diagcab files with embedded answer files leveraging CVE-2022-30190",
        "displayName": "Suspicious Cabinet File Execution Via Msdt.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -cab \" or ProcessCommandLine contains \" /cab \") and (FolderPath endswith \"\\\\msdt.exe\" or ProcessVersionInfoOriginalFileName =~ \"msdt.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1202"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
