{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/20384606-a124-4fec-acbb-8bd373728613')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/20384606-a124-4fec-acbb-8bd373728613')]",
      "properties": {
        "alertRuleTemplateName": "20384606-a124-4fec-acbb-8bd373728613",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/07/03",
        "description": "Detects suspicious network connections made by a well-known Windows binary run with no command line parameters",
        "displayName": "Suspicious Network Connection Binary No CommandLine",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceNetworkEvents\n| where ((InitiatingProcessCommandLine endswith \"\\\\regsvr32.exe\" or InitiatingProcessCommandLine endswith \"\\\\rundll32.exe\" or InitiatingProcessCommandLine endswith \"\\\\dllhost.exe\") and (InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\" or InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" or InitiatingProcessFolderPath endswith \"\\\\dllhost.exe\")) and (not((InitiatingProcessCommandLine =~ \"\" or isnull(InitiatingProcessCommandLine))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
