{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f0507c0f-a3a2-40f5-acc6-7f543c334993')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f0507c0f-a3a2-40f5-acc6-7f543c334993')]",
      "properties": {
        "alertRuleTemplateName": "f0507c0f-a3a2-40f5-acc6-7f543c334993",
        "author": "pH-T (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/01",
        "description": "Detects the execution of the \"net use\" command to mount a WebDAV server and then immediately execute some content in it. As seen being used in malicious LNK files",
        "displayName": "Suspicious File Execution From Internet Hosted WebDav Share",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/21",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" net use http\" and ProcessCommandLine contains \"& start /b \" and ProcessCommandLine contains \"\\\\DavWWWRoot\\\\\") and (ProcessCommandLine contains \".exe \" or ProcessCommandLine contains \".dll \" or ProcessCommandLine contains \".bat \" or ProcessCommandLine contains \".vbs \" or ProcessCommandLine contains \".ps1 \") and (FolderPath contains \"\\\\cmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"Cmd.EXE\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
