{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/023394c4-29d5-46ab-92b8-6a534c6f447b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/023394c4-29d5-46ab-92b8-6a534c6f447b')]",
      "properties": {
        "alertRuleTemplateName": "023394c4-29d5-46ab-92b8-6a534c6f447b",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2019/10/24",
        "description": "Detects suspicious Hangul Word Processor (Hanword) sub processes that could indicate an exploitation",
        "displayName": "Suspicious HWP Sub Processes",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2021/11/27",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\gbb.exe\" and InitiatingProcessFolderPath endswith \"\\\\Hwp.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1059",
          "t1203",
          "t1566"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
