{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb')]",
      "properties": {
        "alertRuleTemplateName": "f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2018/03/17",
        "description": "Detects a suspicious RDP session redirect using tscon.exe",
        "displayName": "Suspicious RDP Redirect Using TSCON",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/05/16",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" /dest:rdp-tcp#\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1021",
          "T1563"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
