{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a58353df-af43-4753-bad0-cd83ef35eef5')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a58353df-af43-4753-bad0-cd83ef35eef5')]",
      "properties": {
        "alertRuleTemplateName": "a58353df-af43-4753-bad0-cd83ef35eef5",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/14",
        "description": "Detects execution of ntdsutil.exe to perform different actions such as restoring snapshots...etc.",
        "displayName": "Suspicious Usage Of Active Directory Diagnostic Tool (ntdsutil.exe)",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"snapshot\" and ProcessCommandLine contains \"mount \") or (ProcessCommandLine contains \"ac\" and ProcessCommandLine contains \" i\" and ProcessCommandLine contains \" ntds\")) and (FolderPath endswith \"\\\\ntdsutil.exe\" or ProcessVersionInfoOriginalFileName =~ \"ntdsutil.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
