{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4b13db67-0c45-40f1-aba8-66a1a7198a1e')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4b13db67-0c45-40f1-aba8-66a1a7198a1e')]",
      "properties": {
        "alertRuleTemplateName": "4b13db67-0c45-40f1-aba8-66a1a7198a1e",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/11/26",
        "description": "Extract data from cab file and hide it in an alternate data stream",
        "displayName": "Suspicious Extrac32 Alternate Data Stream Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/30",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"extrac32.exe\" and ProcessCommandLine contains \".cab\") and ProcessCommandLine matches regex \":[^\\\\\\\\]\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1564"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
