{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/99c840f2-2012-46fd-9141-c761987550ef')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/99c840f2-2012-46fd-9141-c761987550ef')]",
      "properties": {
        "alertRuleTemplateName": "99c840f2-2012-46fd-9141-c761987550ef",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/06/28",
        "description": "Detects usage of bitsadmin downloading a file using an URL that contains an IP",
        "displayName": "Suspicious Download From Direct IP Via Bitsadmin",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/15",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"://1\" or ProcessCommandLine contains \"://2\" or ProcessCommandLine contains \"://3\" or ProcessCommandLine contains \"://4\" or ProcessCommandLine contains \"://5\" or ProcessCommandLine contains \"://6\" or ProcessCommandLine contains \"://7\" or ProcessCommandLine contains \"://8\" or ProcessCommandLine contains \"://9\") and (ProcessCommandLine contains \" /transfer \" or ProcessCommandLine contains \" /create \" or ProcessCommandLine contains \" /addfile \") and (FolderPath endswith \"\\\\bitsadmin.exe\" or ProcessVersionInfoOriginalFileName =~ \"bitsadmin.exe\")) and (not(ProcessCommandLine contains \"://7-\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence"
        ],
        "techniques": [
          "T1036",
          "T1197"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
