{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4480827a-9799-4232-b2c4-ccc6c4e9e12b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4480827a-9799-4232-b2c4-ccc6c4e9e12b')]",
      "properties": {
        "alertRuleTemplateName": "4480827a-9799-4232-b2c4-ccc6c4e9e12b",
        "author": "Christian Burkard (Nextron Systems)",
        "customDetails": null,
        "date": "2021/11/24",
        "description": "Detects a suspicious certreq execution taken from the LOLBAS examples, which can be abused to download (small) files",
        "displayName": "Suspicious Certreq Command to Download",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/06/13",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -Post \" and ProcessCommandLine contains \" -config \" and ProcessCommandLine contains \" http\" and ProcessCommandLine contains \" C:\\\\windows\\\\win.ini \") and (FolderPath endswith \"\\\\certreq.exe\" or ProcessVersionInfoOriginalFileName =~ \"CertReq.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1105"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
