{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6e22722b-dfb1-4508-a911-49ac840b40f8')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6e22722b-dfb1-4508-a911-49ac840b40f8')]",
      "properties": {
        "alertRuleTemplateName": "6e22722b-dfb1-4508-a911-49ac840b40f8",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2023/04/18",
        "description": "Detects potential RDP connection via Mstsc using a local \".rdp\" file located in suspicious locations.",
        "displayName": "Suspicious Mstsc.EXE Execution With Local RDP File",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \".rdp\" or ProcessCommandLine endswith \".rdp\\\"\") and (FolderPath endswith \"\\\\mstsc.exe\" or ProcessVersionInfoOriginalFileName =~ \"mstsc.exe\") and (ProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\" or ProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks_Migrated \" or ProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\Tracing\\\\\" or ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\Downloads\\\\\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1219"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
