{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1cdd9a09-06c9-4769-99ff-626e2b3991b8')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1cdd9a09-06c9-4769-99ff-626e2b3991b8')]",
      "properties": {
        "alertRuleTemplateName": "1cdd9a09-06c9-4769-99ff-626e2b3991b8",
        "author": "Florian Roth (Nextron Systems), @blu3_team (idea), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2019/06/26",
        "description": "Detects suspicious use of an .exe extension after a non-executable file extension like .pdf.exe, a set of spaces or underlines to cloak the executable file in spear phishing campaigns",
        "displayName": "Suspicious Double Extension File Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/28",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \".doc.exe\" or ProcessCommandLine contains \".docx.exe\" or ProcessCommandLine contains \".xls.exe\" or ProcessCommandLine contains \".xlsx.exe\" or ProcessCommandLine contains \".ppt.exe\" or ProcessCommandLine contains \".pptx.exe\" or ProcessCommandLine contains \".rtf.exe\" or ProcessCommandLine contains \".pdf.exe\" or ProcessCommandLine contains \".txt.exe\" or ProcessCommandLine contains \"      .exe\" or ProcessCommandLine contains \"______.exe\" or ProcessCommandLine contains \".doc.js\" or ProcessCommandLine contains \".docx.js\" or ProcessCommandLine contains \".xls.js\" or ProcessCommandLine contains \".xlsx.js\" or ProcessCommandLine contains \".ppt.js\" or ProcessCommandLine contains \".pptx.js\" or ProcessCommandLine contains \".rtf.js\" or ProcessCommandLine contains \".pdf.js\" or ProcessCommandLine contains \".txt.js\") and (FolderPath endswith \".doc.exe\" or FolderPath endswith \".docx.exe\" or FolderPath endswith \".xls.exe\" or FolderPath endswith \".xlsx.exe\" or FolderPath endswith \".ppt.exe\" or FolderPath endswith \".pptx.exe\" or FolderPath endswith \".rtf.exe\" or FolderPath endswith \".pdf.exe\" or FolderPath endswith \".txt.exe\" or FolderPath endswith \"      .exe\" or FolderPath endswith \"______.exe\" or FolderPath endswith \".doc.js\" or FolderPath endswith \".docx.js\" or FolderPath endswith \".xls.js\" or FolderPath endswith \".xlsx.js\" or FolderPath endswith \".ppt.js\" or FolderPath endswith \".pptx.js\" or FolderPath endswith \".rtf.js\" or FolderPath endswith \".pdf.js\" or FolderPath endswith \".txt.js\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "critical",
        "status": "stable",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1566"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
