{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/883faa95-175a-4e22-8181-e5761aeb373c')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/883faa95-175a-4e22-8181-e5761aeb373c')]",
      "properties": {
        "alertRuleTemplateName": "883faa95-175a-4e22-8181-e5761aeb373c",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/03/09",
        "description": "Detects a service binary running in a suspicious directory",
        "displayName": "Suspicious Service Binary Directory",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceProcessEvents\n| where (FolderPath contains \"\\\\Users\\\\Public\\\\\" or FolderPath contains \"\\\\$Recycle.bin\" or FolderPath contains \"\\\\Users\\\\All Users\\\\\" or FolderPath contains \"\\\\Users\\\\Default\\\\\" or FolderPath contains \"\\\\Users\\\\Contacts\\\\\" or FolderPath contains \"\\\\Users\\\\Searches\\\\\" or FolderPath contains \"C:\\\\Perflogs\\\\\" or FolderPath contains \"\\\\config\\\\systemprofile\\\\\" or FolderPath contains \"\\\\Windows\\\\Fonts\\\\\" or FolderPath contains \"\\\\Windows\\\\IME\\\\\" or FolderPath contains \"\\\\Windows\\\\addins\\\\\") and (InitiatingProcessFolderPath endswith \"\\\\services.exe\" or InitiatingProcessFolderPath endswith \"\\\\svchost.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1202"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
