{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4a2a2c3e-209f-4d01-b513-4155a540b469')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4a2a2c3e-209f-4d01-b513-4155a540b469')]",
      "properties": {
        "alertRuleTemplateName": "4a2a2c3e-209f-4d01-b513-4155a540b469",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/04/16",
        "description": "Adversaries may abuse msiexec.exe to proxy the execution of malicious payloads",
        "displayName": "Suspicious MsiExec Embedding Parent",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/07/14",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\cmd.exe\") and (InitiatingProcessCommandLine contains \"MsiExec.exe\" and InitiatingProcessCommandLine contains \"-Embedding \")) and (not(((ProcessCommandLine contains \"C:\\\\Program Files\\\\SplunkUniversalForwarder\\\\bin\\\\\" and FolderPath endswith \":\\\\Windows\\\\System32\\\\cmd.exe\") or (ProcessCommandLine contains \"\\\\DismFoDInstall.cmd\" or (InitiatingProcessCommandLine contains \"\\\\MsiExec.exe -Embedding \" and InitiatingProcessCommandLine contains \"Global\\\\MSI0000\")))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
