{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d95de845-b83c-4a9a-8a6a-4fc802ebf6c0')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d95de845-b83c-4a9a-8a6a-4fc802ebf6c0')]",
      "properties": {
        "alertRuleTemplateName": "d95de845-b83c-4a9a-8a6a-4fc802ebf6c0",
        "author": "Florian Roth (Nextron Systems), omkar72, @svch0st, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2019/01/16",
        "description": "Detects suspicious reconnaissance command line activity on Windows systems using Net.EXE\nCheck if the user that executed the commands is suspicious (e.g. service accounts, LOCAL_SYSTEM)\n",
        "displayName": "Suspicious Group And Account Reconnaissance Activity Using Net.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/02",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\net1.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"net.exe\", \"net1.exe\"))) and ((((ProcessCommandLine contains \"domain admins\" or ProcessCommandLine contains \" administrator\" or ProcessCommandLine contains \" administrateur\" or ProcessCommandLine contains \"enterprise admins\" or ProcessCommandLine contains \"Exchange Trusted Subsystem\" or ProcessCommandLine contains \"Remote Desktop Users\" or ProcessCommandLine contains \"Utilisateurs du Bureau à distance\" or ProcessCommandLine contains \"Usuarios de escritorio remoto\" or ProcessCommandLine contains \" /do\") and (ProcessCommandLine contains \" group \" or ProcessCommandLine contains \" localgroup \")) and (not(ProcessCommandLine contains \" /add\"))) or (ProcessCommandLine contains \" /do\" and ProcessCommandLine contains \" accounts \"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "t1087"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
