{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bb58aa4a-b80b-415a-a2c0-2f65a4c81009')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bb58aa4a-b80b-415a-a2c0-2f65a4c81009')]",
      "properties": {
        "alertRuleTemplateName": "bb58aa4a-b80b-415a-a2c0-2f65a4c81009",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2020/07/03",
        "description": "Detects a suspicious Microsoft desktopimgdownldr execution with parameters used to download files from the Internet",
        "displayName": "Suspicious Desktopimgdownldr Command",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2021/11/27",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" /lockscreenurl:\" and (not((ProcessCommandLine contains \".jpg\" or ProcessCommandLine contains \".jpeg\" or ProcessCommandLine contains \".png\")))) or (ProcessCommandLine contains \"reg delete\" and ProcessCommandLine contains \"\\\\PersonalizationCSP\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1105"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
