{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ca2092a1-c273-4878-9b4b-0d60115bf5ea')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ca2092a1-c273-4878-9b4b-0d60115bf5ea')]",
      "properties": {
        "alertRuleTemplateName": "ca2092a1-c273-4878-9b4b-0d60115bf5ea",
        "author": "Florian Roth (Nextron Systems), Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, Anton Kutepov, oscd.community",
        "customDetails": null,
        "date": "2018/09/03",
        "description": "Detects suspicious powershell process starts with base64 encoded commands (e.g. Emotet)",
        "displayName": "Suspicious Encoded PowerShell Command Line",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/04/06",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and (((ProcessCommandLine contains \" JAB\" or ProcessCommandLine contains \" SUVYI\" or ProcessCommandLine contains \" SQBFAFgA\" or ProcessCommandLine contains \" aQBlAHgA\" or ProcessCommandLine contains \" aWV4I\" or ProcessCommandLine contains \" IAA\" or ProcessCommandLine contains \" IAB\" or ProcessCommandLine contains \" UwB\" or ProcessCommandLine contains \" cwB\") and ProcessCommandLine contains \" -e\") or (ProcessCommandLine contains \".exe -ENCOD \" or ProcessCommandLine contains \" BA^J e-\")) and (not(ProcessCommandLine contains \" -ExecutionPolicy remotesigned \"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
