{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/889719ef-dd62-43df-86c3-768fb08dc7c0')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/889719ef-dd62-43df-86c3-768fb08dc7c0')]",
      "properties": {
        "alertRuleTemplateName": "889719ef-dd62-43df-86c3-768fb08dc7c0",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/08/07",
        "description": "Detects usage of the powerShell New-MailboxExportRequest Cmdlet to exports a mailbox to a remote or local share, as used in ProxyShell exploitations",
        "displayName": "Suspicious PowerShell Mailbox Export to Share",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/26",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"New-MailboxExportRequest\" and ProcessCommandLine contains \" -Mailbox \" and ProcessCommandLine contains \" -FilePath \\\\\\\\\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "critical",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "exfiltration"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
