{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8de89e52-f6e1-4b5b-afd1-41ecfa300d48')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8de89e52-f6e1-4b5b-afd1-41ecfa300d48')]",
      "properties": {
        "alertRuleTemplateName": "8de89e52-f6e1-4b5b-afd1-41ecfa300d48",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/07/25",
        "description": "Detects suspicious children spawned via the Windows Terminal application which could be a sign of persistence via WindowsTerminal (see references section)",
        "displayName": "Suspicious WindowsTerminal Child Processes",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/14",
        "query": "DeviceProcessEvents\n| where ((InitiatingProcessFolderPath endswith \"\\\\WindowsTerminal.exe\" or InitiatingProcessFolderPath endswith \"\\\\wt.exe\") and ((FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\certutil.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\wscript.exe\" or FolderPath endswith \"\\\\csc.exe\") or (FolderPath contains \"C:\\\\Users\\\\Public\\\\\" or FolderPath contains \"\\\\Downloads\\\\\" or FolderPath contains \"\\\\Desktop\\\\\" or FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or FolderPath contains \"\\\\Windows\\\\TEMP\\\\\") or (ProcessCommandLine contains \" iex \" or ProcessCommandLine contains \" icm\" or ProcessCommandLine contains \"Invoke-\" or ProcessCommandLine contains \"Import-Module \" or ProcessCommandLine contains \"ipmo \" or ProcessCommandLine contains \"DownloadString(\" or ProcessCommandLine contains \" /c \" or ProcessCommandLine contains \" /k \" or ProcessCommandLine contains \" /r \"))) and (not(((ProcessCommandLine contains \"Import-Module\" and ProcessCommandLine contains \"Microsoft.VisualStudio.DevShell.dll\" and ProcessCommandLine contains \"Enter-VsDevShell\") or (ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Packages\\\\Microsoft.WindowsTerminal_\" and ProcessCommandLine contains \"\\\\LocalState\\\\settings.json\") or (ProcessCommandLine contains \"C:\\\\Program Files\\\\Microsoft Visual Studio\\\\\" and ProcessCommandLine contains \"\\\\Common7\\\\Tools\\\\VsDevCmd.bat\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution",
          "persistence"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
