{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/dd3ee8cc-f751-41c9-ba53-5a32ed47e563')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/dd3ee8cc-f751-41c9-ba53-5a32ed47e563')]",
      "properties": {
        "alertRuleTemplateName": "dd3ee8cc-f751-41c9-ba53-5a32ed47e563",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/12/20",
        "description": "Threat actors performed dumping of SAM, SECURITY and SYSTEM registry hives using DelegateExecute key",
        "displayName": "Suspicious Reg Add Open Command",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/25",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"reg\" and ProcessCommandLine contains \"add\" and ProcessCommandLine contains \"hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" and ProcessCommandLine contains \"/ve \" and ProcessCommandLine contains \"/d\") or (ProcessCommandLine contains \"reg\" and ProcessCommandLine contains \"add\" and ProcessCommandLine contains \"hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" and ProcessCommandLine contains \"/v\" and ProcessCommandLine contains \"DelegateExecute\") or (ProcessCommandLine contains \"reg\" and ProcessCommandLine contains \"delete\" and ProcessCommandLine contains \"hkcu\\\\software\\\\classes\\\\ms-settings\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1003"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
