{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cc36992a-4671-4f21-a91d-6c2b72a2edf5')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cc36992a-4671-4f21-a91d-6c2b72a2edf5')]",
      "properties": {
        "alertRuleTemplateName": "cc36992a-4671-4f21-a91d-6c2b72a2edf5",
        "author": "Ecco, Daniil Yugoslavskiy, oscd.community, D3F7A5105",
        "customDetails": null,
        "date": "2019/09/26",
        "description": "Detects clearing or configuration of eventlogs using wevtutil, powershell and wmic. Might be used by ransomwares during the attack (seen by NotPetya and others).",
        "displayName": "Suspicious Eventlog Clear or Configuration Change",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/07/13",
        "query": "DeviceProcessEvents\n| where (((ProcessCommandLine contains \"Clear-EventLog \" or ProcessCommandLine contains \"Remove-EventLog \" or ProcessCommandLine contains \"Limit-EventLog \" or ProcessCommandLine contains \"Clear-WinEvent \") and (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\")) or (ProcessCommandLine contains \"ClearEventLog\" and (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\wmic.exe\")) or ((ProcessCommandLine contains \"clear-log \" or ProcessCommandLine contains \" cl \" or ProcessCommandLine contains \"set-log \" or ProcessCommandLine contains \" sl \" or ProcessCommandLine contains \"lfn:\") and FolderPath endswith \"\\\\wevtutil.exe\")) and (not((ProcessCommandLine contains \" sl \" and (InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\", \"C:\\\\Windows\\\\System32\\\\msiexec.exe\")))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "stable",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1070",
          "t1562"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
