{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/88a87a10-384b-4ad7-8871-2f9bf9259ce5')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/88a87a10-384b-4ad7-8871-2f9bf9259ce5')]",
      "properties": {
        "alertRuleTemplateName": "88a87a10-384b-4ad7-8871-2f9bf9259ce5",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/10/31",
        "description": "Detects REGSVR32.exe to execute DLL hosted on remote shares",
        "displayName": "Suspicious Regsvr32 Execution From Remote Share",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" \\\\\\\\\" and (FolderPath endswith \"\\\\regsvr32.exe\" or ProcessVersionInfoOriginalFileName =~ \"\\\\REGSVR32.EXE\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
