{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0d34ed8b-1c12-4ff2-828c-16fc860b766d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0d34ed8b-1c12-4ff2-828c-16fc860b766d')]",
      "properties": {
        "alertRuleTemplateName": "0d34ed8b-1c12-4ff2-828c-16fc860b766d",
        "author": "Andreas Hunkeler (@Karneades), Florian Roth",
        "customDetails": null,
        "date": "2021/12/17",
        "description": "Detects suspicious processes spawned from a Java host process which could indicate a sign of exploitation (e.g. log4j)",
        "displayName": "Suspicious Processes Spawned by Java.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/01/18",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\AppVLP.exe\" or FolderPath endswith \"\\\\bitsadmin.exe\" or FolderPath endswith \"\\\\certutil.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\curl.exe\" or FolderPath endswith \"\\\\forfiles.exe\" or FolderPath endswith \"\\\\hh.exe\" or FolderPath endswith \"\\\\mftrace.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\net1.exe\" or FolderPath endswith \"\\\\query.exe\" or FolderPath endswith \"\\\\reg.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\scrcons.exe\" or FolderPath endswith \"\\\\scriptrunner.exe\" or FolderPath endswith \"\\\\sh.exe\" or FolderPath endswith \"\\\\systeminfo.exe\" or FolderPath endswith \"\\\\whoami.exe\" or FolderPath endswith \"\\\\wmic.exe\" or FolderPath endswith \"\\\\wscript.exe\") and InitiatingProcessFolderPath endswith \"\\\\java.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
