{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b')]",
      "properties": {
        "alertRuleTemplateName": "f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b",
        "author": "frack113",
        "customDetails": null,
        "date": "2022/11/18",
        "description": "Detects suspicious execution of 'Powercfg.exe' to change lock screen timeout",
        "displayName": "Suspicious Powercfg Execution To Change Lock Screen Timeout",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\powercfg.exe\" or ProcessVersionInfoOriginalFileName =~ \"PowerCfg.exe\") and ((ProcessCommandLine contains \"/setacvalueindex \" and ProcessCommandLine contains \"SCHEME_CURRENT\" and ProcessCommandLine contains \"SUB_VIDEO\" and ProcessCommandLine contains \"VIDEOCONLOCK\") or (ProcessCommandLine contains \"-change \" and ProcessCommandLine contains \"-standby-timeout-\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
