{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0fc35fc3-efe6-4898-8a37-0b233339524f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0fc35fc3-efe6-4898-8a37-0b233339524f')]",
      "properties": {
        "alertRuleTemplateName": "0fc35fc3-efe6-4898-8a37-0b233339524f",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/08/19",
        "description": "Adversaries may establish persistence by executing malicious content triggered by user inactivity.\nScreensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension\n",
        "displayName": "Suspicious ScreenSave Change by Reg.exe",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/06/02",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"HKEY_CURRENT_USER\\\\Control Panel\\\\Desktop\" or ProcessCommandLine contains \"HKCU\\\\Control Panel\\\\Desktop\") and FolderPath endswith \"\\\\reg.exe\") and ((ProcessCommandLine contains \"/v ScreenSaveActive\" and ProcessCommandLine contains \"/t REG_SZ\" and ProcessCommandLine contains \"/d 1\" and ProcessCommandLine contains \"/f\") or (ProcessCommandLine contains \"/v ScreenSaveTimeout\" and ProcessCommandLine contains \"/t REG_SZ\" and ProcessCommandLine contains \"/d \" and ProcessCommandLine contains \"/f\") or (ProcessCommandLine contains \"/v ScreenSaverIsSecure\" and ProcessCommandLine contains \"/t REG_SZ\" and ProcessCommandLine contains \"/d 0\" and ProcessCommandLine contains \"/f\") or (ProcessCommandLine contains \"/v SCRNSAVE.EXE\" and ProcessCommandLine contains \"/t REG_SZ\" and ProcessCommandLine contains \"/d \" and ProcessCommandLine contains \".scr\" and ProcessCommandLine contains \"/f\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1546"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
