{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ab9e3b40-0c85-4ba1-aede-455d226fd124')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ab9e3b40-0c85-4ba1-aede-455d226fd124')]",
      "properties": {
        "alertRuleTemplateName": "ab9e3b40-0c85-4ba1-aede-455d226fd124",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/01/16",
        "description": "Detects a suspicious output redirection to the local admins share, this technique is often found in malicious scripts or hacktool stagers",
        "displayName": "Suspicious Redirection to Local Admin Share",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/28",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \">\" and (ProcessCommandLine contains \"\\\\\\\\127.0.0.1\\\\admin$\\\\\" or ProcessCommandLine contains \"\\\\\\\\localhost\\\\admin$\\\\\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Exfiltration"
        ],
        "techniques": [
          "T1048"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
