{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/25eabf56-22f0-4915-a1ed-056b8dae0a68')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/25eabf56-22f0-4915-a1ed-056b8dae0a68')]",
      "properties": {
        "alertRuleTemplateName": "25eabf56-22f0-4915-a1ed-056b8dae0a68",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2022/04/20",
        "description": "Detects an executable that isn't dropbox but communicates with the Dropbox API",
        "displayName": "Suspicious Dropbox API Usage",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceNetworkEvents\n| where (RemoteUrl endswith \"api.dropboxapi.com\" or RemoteUrl endswith \"content.dropboxapi.com\") and (not(InitiatingProcessFolderPath contains \"\\\\Dropbox\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1105"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
