{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bb76d96b-821c-47cf-944b-7ce377864492')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bb76d96b-821c-47cf-944b-7ce377864492')]",
      "properties": {
        "alertRuleTemplateName": "bb76d96b-821c-47cf-944b-7ce377864492",
        "author": "Elastic (idea), Tobias Michalski (Nextron Systems)",
        "customDetails": null,
        "date": "2022/05/04",
        "description": "Detects a privilege elevation attempt by coercing NTLM authentication on the Printer Spooler service",
        "displayName": "Suspicious NTLM Authentication on the Printer Spooler Service",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/02/09",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"spoolss\" or ProcessCommandLine contains \"srvsvc\" or ProcessCommandLine contains \"/print/pipe/\") and (ProcessCommandLine contains \"C:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie\" and ProcessCommandLine contains \"http\")) and (FolderPath endswith \"\\\\rundll32.exe\" or ProcessVersionInfoOriginalFileName =~ \"RUNDLL32.EXE\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1212"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
