{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bb780e0c-16cf-4383-8383-1e5471db6cf9')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bb780e0c-16cf-4383-8383-1e5471db6cf9')]",
      "properties": {
        "alertRuleTemplateName": "bb780e0c-16cf-4383-8383-1e5471db6cf9",
        "author": "Sami Ruohonen, Harish Segar, Tim Shelton, Teymur Kheirkhabarov, Vasiliy Burov, oscd.community, Nasreddine Bencherchali",
        "customDetails": null,
        "date": "2018/09/05",
        "description": "Detects presence of a potentially xor encoded powershell command",
        "displayName": "Suspicious XOR Encoded PowerShell Command",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/30",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"ForEach\" or ProcessCommandLine contains \"for(\" or ProcessCommandLine contains \"for \" or ProcessCommandLine contains \"-join \" or ProcessCommandLine contains \"-join'\" or ProcessCommandLine contains \"-join\\\"\" or ProcessCommandLine contains \"-join`\" or ProcessCommandLine contains \"::Join\" or ProcessCommandLine contains \"[char]\") and ProcessCommandLine contains \"bxor\" and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")) or ProcessVersionInfoFileDescription =~ \"Windows PowerShell\" or ProcessVersionInfoProductName =~ \"PowerShell Core 6\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "t1027",
          "t1059",
          "t1140"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
