{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/90dcf730-1b71-4ae7-9ffc-6fcf62bd0132')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/90dcf730-1b71-4ae7-9ffc-6fcf62bd0132')]",
      "properties": {
        "alertRuleTemplateName": "90dcf730-1b71-4ae7-9ffc-6fcf62bd0132",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/11/07",
        "description": "ZipExec is a Proof-of-Concept (POC) tool to wrap binary-based tools into a password-protected zip file.",
        "displayName": "Suspicious ZipExec Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/25",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/generic:Microsoft_Windows_Shell_ZipFolder:filename=\" and ProcessCommandLine contains \".zip\" and ProcessCommandLine contains \"/pass:\" and ProcessCommandLine contains \"/user:\") or (ProcessCommandLine contains \"/delete\" and ProcessCommandLine contains \"Microsoft_Windows_Shell_ZipFolder:filename=\" and ProcessCommandLine contains \".zip\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1202",
          "T1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
