{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fbd7c32d-db2a-4418-b92c-566eb8911133')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fbd7c32d-db2a-4418-b92c-566eb8911133')]",
      "properties": {
        "alertRuleTemplateName": "fbd7c32d-db2a-4418-b92c-566eb8911133",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/07/12",
        "description": "Executes arbitrary PowerShell code using SyncAppvPublishingServer.exe.",
        "displayName": "SyncAppvPublishingServer Execute Arbitrary PowerShell Code",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/04",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"\\\"n; \" and (FolderPath endswith \"\\\\SyncAppvPublishingServer.exe\" or ProcessVersionInfoOriginalFileName =~ \"syncappvpublishingserver.exe\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
