{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/37db85d1-b089-490a-a59a-c7b6f984f480')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/37db85d1-b089-490a-a59a-c7b6f984f480')]",
      "properties": {
        "alertRuleTemplateName": "37db85d1-b089-490a-a59a-c7b6f984f480",
        "author": "frack113",
        "customDetails": null,
        "date": "2021/12/16",
        "description": "Detects usage of \"findstr\" with the argument \"385201\". Which could indicate potential discovery of an installed Sysinternals Sysmon service using the default driver altitude (even if the name is changed).",
        "displayName": "Sysmon Discovery Via Default Driver Altitude Using Findstr.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/14",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" 385201\" and ((FolderPath endswith \"\\\\find.exe\" or FolderPath endswith \"\\\\findstr.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"FIND.EXE\", \"FINDSTR.EXE\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Discovery"
        ],
        "techniques": [
          "T1518"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
