{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2b140a5c-dc02-4bb8-b6b1-8bdb45714cde')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2b140a5c-dc02-4bb8-b6b1-8bdb45714cde')]",
      "properties": {
        "alertRuleTemplateName": "2b140a5c-dc02-4bb8-b6b1-8bdb45714cde",
        "author": "Anish Bogati",
        "customDetails": null,
        "date": "2024/01/09",
        "description": "Detects image load events of system control panel items (.cpl) from uncommon or non-system locations which might be the result of sideloading.",
        "displayName": "System Control Panel Item Loaded From Uncommon Location",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\hdwwiz.cpl\" or FolderPath endswith \"\\\\appwiz.cpl\") and (not((FolderPath contains \":\\\\Windows\\\\System32\\\\\" or FolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\" or FolderPath contains \":\\\\Windows\\\\WinSxS\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1036"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
