{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/99793437-3e16-439b-be0f-078782cf953d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/99793437-3e16-439b-be0f-078782cf953d')]",
      "properties": {
        "alertRuleTemplateName": "99793437-3e16-439b-be0f-078782cf953d",
        "author": "Daniil Yugoslavskiy, Ian Davis, oscd.community",
        "customDetails": null,
        "date": "2019/10/24",
        "description": "Well-known TAP software installation. Possible preparation for data exfiltration using tunneling techniques",
        "displayName": "Tap Installer Execution",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/12/11",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\tapinstall.exe\" and (not(((FolderPath contains \":\\\\Program Files\\\\Avast Software\\\\SecureLine VPN\\\\\" or FolderPath contains \":\\\\Program Files (x86)\\\\Avast Software\\\\SecureLine VPN\\\\\") or FolderPath contains \":\\\\Program Files\\\\OpenVPN Connect\\\\drivers\\\\tap\\\\\" or FolderPath contains \":\\\\Program Files (x86)\\\\Proton Technologies\\\\ProtonVPNTap\\\\installer\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "exfiltration"
        ],
        "techniques": [
          "T1048"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
