{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cc4e02ba-9c06-48e2-b09e-2500cace9ae0')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cc4e02ba-9c06-48e2-b09e-2500cace9ae0')]",
      "properties": {
        "alertRuleTemplateName": "cc4e02ba-9c06-48e2-b09e-2500cace9ae0",
        "author": "Sreeman",
        "customDetails": null,
        "date": "2020/01/13",
        "description": "The Tasks folder in system32 and syswow64 are globally writable paths.\nAdversaries can take advantage of this and load or influence any script hosts or ANY .NET Application\nin Tasks to load and execute a custom assembly into cscript, wscript, regsvr32, mshta, eventvwr\n",
        "displayName": "Tasks Folder Evasion",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/25",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"echo \" or ProcessCommandLine contains \"copy \" or ProcessCommandLine contains \"type \" or ProcessCommandLine contains \"file createnew\") and (ProcessCommandLine contains \" C:\\\\Windows\\\\System32\\\\Tasks\\\\\" or ProcessCommandLine contains \" C:\\\\Windows\\\\SysWow64\\\\Tasks\\\\\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution",
          "persistence"
        ],
        "techniques": [
          "T1574"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
