{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1012f107-b8f1-4271-af30-5aed2de89b39')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1012f107-b8f1-4271-af30-5aed2de89b39')]",
      "properties": {
        "alertRuleTemplateName": "1012f107-b8f1-4271-af30-5aed2de89b39",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2019/05/22",
        "description": "Detects a process spawned by the terminal service server process (this could be an indicator for an exploitation of CVE-2019-0708)",
        "displayName": "Terminal Service Process Spawn",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/25",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessCommandLine contains \"\\\\svchost.exe\" and InitiatingProcessCommandLine contains \"termsvcs\") and (not(((FolderPath endswith \"\\\\rdpclip.exe\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\csrss.exe\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\wininit.exe\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\winlogon.exe\") or isnull(FolderPath))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1190",
          "t1210"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
