{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0058b9e5-bcd7-40d4-9205-95ca5a16d7b2')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0058b9e5-bcd7-40d4-9205-95ca5a16d7b2')]",
      "properties": {
        "alertRuleTemplateName": "0058b9e5-bcd7-40d4-9205-95ca5a16d7b2",
        "author": "Christian Burkard (Nextron Systems)",
        "customDetails": null,
        "date": "2021/08/23",
        "description": "Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll (UACMe 32)",
        "displayName": "UAC Bypass Using Windows Media Player - Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceProcessEvents\n| where (FolderPath =~ \"C:\\\\Program Files\\\\Windows Media Player\\\\osk.exe\" and (ProcessIntegrityLevel in~ (\"High\", \"System\"))) or (FolderPath =~ \"C:\\\\Windows\\\\System32\\\\cmd.exe\" and (ProcessIntegrityLevel in~ (\"High\", \"System\")) and InitiatingProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\mmc.exe\\\" \\\"C:\\\\Windows\\\\system32\\\\eventvwr.msc\\\" /s\")",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1548"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
