{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7a01183d-71a2-46ad-ad5c-acd989ac1793')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7a01183d-71a2-46ad-ad5c-acd989ac1793')]",
      "properties": {
        "alertRuleTemplateName": "7a01183d-71a2-46ad-ad5c-acd989ac1793",
        "author": "Christian Burkard (Nextron Systems)",
        "customDetails": null,
        "date": "2021/08/30",
        "description": "Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe (UACMe 52)",
        "displayName": "UAC Bypass Abusing Winsat Path Parsing - Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceProcessEvents\n| where (ProcessIntegrityLevel in~ (\"High\", \"System\")) and InitiatingProcessCommandLine contains \"C:\\\\Windows \\\\system32\\\\winsat.exe\" and InitiatingProcessFolderPath endswith \"\\\\AppData\\\\Local\\\\Temp\\\\system32\\\\winsat.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1548"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
