{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b697e69c-746f-4a86-9f59-7bfff8eab881')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b697e69c-746f-4a86-9f59-7bfff8eab881')]",
      "properties": {
        "alertRuleTemplateName": "b697e69c-746f-4a86-9f59-7bfff8eab881",
        "author": "Christian Burkard (Nextron Systems)",
        "customDetails": null,
        "date": "2021/08/30",
        "description": "Detects the pattern of UAC Bypass using scheduled tasks and variable expansion of cleanmgr.exe (UACMe 34)",
        "displayName": "UAC Bypass Using Disk Cleanup",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine endswith \"\\\"\\\\system32\\\\cleanmgr.exe /autoclean /d C:\" and (ProcessIntegrityLevel in~ (\"High\", \"System\")) and InitiatingProcessCommandLine =~ \"C:\\\\Windows\\\\system32\\\\svchost.exe -k netsvcs -p -s Schedule\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1548"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
