{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/3c05e90d-7eba-4324-9972-5d7f711a60a8')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/3c05e90d-7eba-4324-9972-5d7f711a60a8')]",
      "properties": {
        "alertRuleTemplateName": "3c05e90d-7eba-4324-9972-5d7f711a60a8",
        "author": "Christian Burkard (Nextron Systems)",
        "customDetails": null,
        "date": "2021/08/31",
        "description": "Detects tools such as UACMe used to bypass UAC with computerdefaults.exe (UACMe 59)",
        "displayName": "UAC Bypass Tools Using ComputerDefaults",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceProcessEvents\n| where (FolderPath =~ \"C:\\\\Windows\\\\System32\\\\ComputerDefaults.exe\" and (ProcessIntegrityLevel in~ (\"High\", \"System\"))) and (not((InitiatingProcessFolderPath contains \":\\\\Windows\\\\System32\" or InitiatingProcessFolderPath contains \":\\\\Program Files\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1548"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
