{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0a98a10c-685d-4ab0-bddc-b6bdd1d48458')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0a98a10c-685d-4ab0-bddc-b6bdd1d48458')]",
      "properties": {
        "alertRuleTemplateName": "0a98a10c-685d-4ab0-bddc-b6bdd1d48458",
        "author": "Tom Ueltschi (@c_APT_ure), Tim Shelton",
        "customDetails": null,
        "date": "2019/01/12",
        "description": "Detects uncommon \"userinit.exe\" child processes, which could be a sign of uncommon shells or login scripts used for persistence.",
        "displayName": "Uncommon Userinit Child Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/11/14",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\userinit.exe\" and (not(FolderPath endswith \":\\\\WINDOWS\\\\explorer.exe\")) and (not(((FolderPath endswith \":\\\\Program Files (x86)\\\\Citrix\\\\HDX\\\\bin\\\\cmstart.exe\" or FolderPath endswith \":\\\\Program Files (x86)\\\\Citrix\\\\HDX\\\\bin\\\\icast.exe\" or FolderPath endswith \":\\\\Program Files (x86)\\\\Citrix\\\\System32\\\\icast.exe\" or FolderPath endswith \":\\\\Program Files\\\\Citrix\\\\HDX\\\\bin\\\\cmstart.exe\" or FolderPath endswith \":\\\\Program Files\\\\Citrix\\\\HDX\\\\bin\\\\icast.exe\" or FolderPath endswith \":\\\\Program Files\\\\Citrix\\\\System32\\\\icast.exe\") or isnull(FolderPath) or (ProcessCommandLine contains \"netlogon.bat\" or ProcessCommandLine contains \"UsrLogon.cmd\") or (FolderPath endswith \":\\\\Windows\\\\System32\\\\proquota.exe\" or FolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\proquota.exe\") or ProcessCommandLine =~ \"PowerShell.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "T1037"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
