{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e54979bd-c5f9-4d6c-967b-a04b19ac4c74')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e54979bd-c5f9-4d6c-967b-a04b19ac4c74')]",
      "properties": {
        "alertRuleTemplateName": "e54979bd-c5f9-4d6c-967b-a04b19ac4c74",
        "author": "Ilyas Ochkov, oscd.community",
        "customDetails": null,
        "date": "2019/10/24",
        "description": "Detects uncommon outbound network activity via Kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.\n",
        "displayName": "Uncommon Outbound Kerberos Connection",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "network_connection",
          "product": "windows"
        },
        "modified": "2024/03/15",
        "query": "DeviceNetworkEvents\n| where RemotePort == 88 and (not(InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\lsass.exe\")) and (not(((InitiatingProcessFolderPath in~ (\"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\", \"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\")) or (InitiatingProcessFolderPath in~ (\"C:\\\\Program Files (x86)\\\\Mozilla Firefox\\\\firefox.exe\", \"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\")) or InitiatingProcessFolderPath endswith \"\\\\tomcat\\\\bin\\\\tomcat8.exe\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "T1550",
          "T1558"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
