{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d')]",
      "properties": {
        "alertRuleTemplateName": "9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d",
        "author": "James Pemberton / @4A616D6573, Endgame, JHasenbusch, oscd.community, Austin Songer @austinsonger",
        "customDetails": null,
        "date": "2019/10/24",
        "description": "Detects the use of various web request commands with commandline tools and Windows PowerShell cmdlets (including aliases) via CommandLine",
        "displayName": "Usage Of Web Request Commands And Cmdlets",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/01/10",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"[System.Net.WebRequest]::create\" or ProcessCommandLine contains \"curl \" or ProcessCommandLine contains \"Invoke-RestMethod\" or ProcessCommandLine contains \"Invoke-WebRequest\" or ProcessCommandLine contains \"iwr \" or ProcessCommandLine contains \"Net.WebClient\" or ProcessCommandLine contains \"Resume-BitsTransfer\" or ProcessCommandLine contains \"Start-BitsTransfer\" or ProcessCommandLine contains \"wget \" or ProcessCommandLine contains \"WinHttp.WinHttpRequest\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
