{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795')]",
      "properties": {
        "alertRuleTemplateName": "dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795",
        "author": "frack113, Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/08/05",
        "description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid command-line detection",
        "displayName": "Use NTFS Short Name in Command Line",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/09/21",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"~1.exe\" or ProcessCommandLine contains \"~1.bat\" or ProcessCommandLine contains \"~1.msi\" or ProcessCommandLine contains \"~1.vbe\" or ProcessCommandLine contains \"~1.vbs\" or ProcessCommandLine contains \"~1.dll\" or ProcessCommandLine contains \"~1.ps1\" or ProcessCommandLine contains \"~1.js\" or ProcessCommandLine contains \"~1.hta\" or ProcessCommandLine contains \"~2.exe\" or ProcessCommandLine contains \"~2.bat\" or ProcessCommandLine contains \"~2.msi\" or ProcessCommandLine contains \"~2.vbe\" or ProcessCommandLine contains \"~2.vbs\" or ProcessCommandLine contains \"~2.dll\" or ProcessCommandLine contains \"~2.ps1\" or ProcessCommandLine contains \"~2.js\" or ProcessCommandLine contains \"~2.hta\") and (not(((InitiatingProcessFolderPath endswith \"\\\\WebEx\\\\WebexHost.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor\\\\thor64.exe\") or ProcessCommandLine contains \"C:\\\\xampp\\\\vcredist\\\\VCREDI~1.EXE\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1564"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
