{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b96b2031-7c17-4473-afe7-a30ce714db29')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b96b2031-7c17-4473-afe7-a30ce714db29')]",
      "properties": {
        "alertRuleTemplateName": "b96b2031-7c17-4473-afe7-a30ce714db29",
        "author": "Christopher Peacock @SecurePeacock, SCYTHE @scythe_io",
        "customDetails": null,
        "date": "2022/06/02",
        "description": "Detects the execution of FSharp Interpreters \"FsiAnyCpu.exe\" and \"FSi.exe\"\nBoth can be used for AWL bypass and to execute F# code via scripts or inline.\n",
        "displayName": "Use of FSharp Interpreters",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/04/23",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\fsi.exe\" or FolderPath endswith \"\\\\fsianycpu.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"fsi.exe\", \"fsianycpu.exe\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1059"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
