{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1114e048-b69c-4f41-bc20-657245ae6e3f')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1114e048-b69c-4f41-bc20-657245ae6e3f')]",
      "properties": {
        "alertRuleTemplateName": "1114e048-b69c-4f41-bc20-657245ae6e3f",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/09",
        "description": "Detects usage of the Get-ADUser cmdlet to collect user information and output it to a file",
        "displayName": "User Discovery And Export Via Get-ADUser Cmdlet",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/11/17",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" > \" or ProcessCommandLine contains \" | Select \" or ProcessCommandLine contains \"Out-File\" or ProcessCommandLine contains \"Set-Content\" or ProcessCommandLine contains \"Add-Content\") and (ProcessCommandLine contains \"Get-ADUser \" and ProcessCommandLine contains \" -Filter *\")) and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "discovery"
        ],
        "techniques": [
          "T1033"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
