{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ad720b90-25ad-43ff-9b5e-5c841facc8e5')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ad720b90-25ad-43ff-9b5e-5c841facc8e5')]",
      "properties": {
        "alertRuleTemplateName": "ad720b90-25ad-43ff-9b5e-5c841facc8e5",
        "author": "Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/08/12",
        "description": "Detects addition of users to the local administrator group via \"Net\" or \"Add-LocalGroupMember\".",
        "displayName": "User Added to Local Administrators Group",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2023/03/02",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" administrators \" or ProcessCommandLine contains \" administrateur\") and ((ProcessCommandLine contains \"localgroup \" and ProcessCommandLine contains \" /add\") or (ProcessCommandLine contains \"Add-LocalGroupMember \" and ProcessCommandLine contains \" -Group \"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "T1098"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
