{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/91edcfb1-2529-4ac2-9ecc-7617f895c7e4')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/91edcfb1-2529-4ac2-9ecc-7617f895c7e4')]",
      "properties": {
        "alertRuleTemplateName": "91edcfb1-2529-4ac2-9ecc-7617f895c7e4",
        "author": "Nasreddine Bencherchali (Nextron Systems)",
        "customDetails": null,
        "date": "2022/09/14",
        "description": "Detects weak passwords or often abused passwords (seen used by threat actors) via the CLI.\nAn example would be a threat actor creating a new user via the net command and providing the password inline\n",
        "displayName": "Weak or Abused Passwords In CLI",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/02/23",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"123456789\" or ProcessCommandLine contains \"123123qwE\" or ProcessCommandLine contains \"Asd123.aaaa\" or ProcessCommandLine contains \"Decryptme\" or ProcessCommandLine contains \"P@ssw0rd!\" or ProcessCommandLine contains \"Pass8080\" or ProcessCommandLine contains \"password123\" or ProcessCommandLine contains \"test@202\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
