{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bed2a484-9348-4143-8a8a-b801c979301c')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bed2a484-9348-4143-8a8a-b801c979301c')]",
      "properties": {
        "alertRuleTemplateName": "bed2a484-9348-4143-8a8a-b801c979301c",
        "author": "Florian Roth (Nextron Systems), Jonhnathan Ribeiro, Anton Kutepov, oscd.community",
        "customDetails": null,
        "date": "2017/01/01",
        "description": "Detects certain command line parameters often used during reconnaissance activity via web shells",
        "displayName": "Webshell Detection With Command Line Keywords",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/05/13",
        "query": "DeviceProcessEvents\n| where (((InitiatingProcessFolderPath contains \"-tomcat-\" or InitiatingProcessFolderPath contains \"\\\\tomcat\") and (InitiatingProcessFolderPath endswith \"\\\\java.exe\" or InitiatingProcessFolderPath endswith \"\\\\javaw.exe\")) or ((ProcessCommandLine contains \"catalina.jar\" or ProcessCommandLine contains \"CATALINA_HOME\") and (InitiatingProcessFolderPath endswith \"\\\\java.exe\" or InitiatingProcessFolderPath endswith \"\\\\javaw.exe\")) or (InitiatingProcessFolderPath endswith \"\\\\w3wp.exe\" or InitiatingProcessFolderPath endswith \"\\\\php-cgi.exe\" or InitiatingProcessFolderPath endswith \"\\\\nginx.exe\" or InitiatingProcessFolderPath endswith \"\\\\httpd.exe\" or InitiatingProcessFolderPath endswith \"\\\\caddy.exe\" or InitiatingProcessFolderPath endswith \"\\\\ws_tomcatservice.exe\")) and ((ProcessCommandLine contains \"&cd&echo\" or ProcessCommandLine contains \"cd /d \") or ((FolderPath endswith \"\\\\dsquery.exe\" or FolderPath endswith \"\\\\find.exe\" or FolderPath endswith \"\\\\findstr.exe\" or FolderPath endswith \"\\\\ipconfig.exe\" or FolderPath endswith \"\\\\netstat.exe\" or FolderPath endswith \"\\\\nslookup.exe\" or FolderPath endswith \"\\\\pathping.exe\" or FolderPath endswith \"\\\\quser.exe\" or FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\systeminfo.exe\" or FolderPath endswith \"\\\\tasklist.exe\" or FolderPath endswith \"\\\\tracert.exe\" or FolderPath endswith \"\\\\ver.exe\" or FolderPath endswith \"\\\\wevtutil.exe\" or FolderPath endswith \"\\\\whoami.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"dsquery.exe\", \"find.exe\", \"findstr.exe\", \"ipconfig.exe\", \"netstat.exe\", \"nslookup.exe\", \"pathping.exe\", \"quser.exe\", \"schtasks.exe\", \"sysinfo.exe\", \"tasklist.exe\", \"tracert.exe\", \"ver.exe\", \"VSSADMIN.EXE\", \"wevtutil.exe\", \"whoami.exe\"))) or (ProcessCommandLine contains \" Test-NetConnection \" or ProcessCommandLine contains \"dir \\\\\") or ((ProcessCommandLine contains \" user \" or ProcessCommandLine contains \" use \" or ProcessCommandLine contains \" group \") and (ProcessVersionInfoOriginalFileName in~ (\"net.exe\", \"net1.exe\"))) or (ProcessCommandLine contains \" -n \" and ProcessVersionInfoOriginalFileName =~ \"ping.exe\") or (ProcessCommandLine contains \" /node:\" and ProcessVersionInfoOriginalFileName =~ \"wmic.exe\"))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "persistence"
        ],
        "techniques": [
          "t1018",
          "t1033",
          "t1087",
          "t1505"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
