{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e9142d84-fbe0-401d-ac50-3e519fb00c89')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e9142d84-fbe0-401d-ac50-3e519fb00c89')]",
      "properties": {
        "alertRuleTemplateName": "e9142d84-fbe0-401d-ac50-3e519fb00c89",
        "author": "Florian Roth (Nextron Systems)",
        "customDetails": null,
        "date": "2021/11/29",
        "description": "Detects a suspicious process command line that uses whoami as first parameter (as e.g. used by EfsPotato)",
        "displayName": "WhoAmI as Parameter",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/12/25",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \".exe whoami\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Discovery"
        ],
        "techniques": [
          "T1033"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
