{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/96036718-71cc-4027-a538-d1587e0006a7')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/96036718-71cc-4027-a538-d1587e0006a7')]",
      "properties": {
        "alertRuleTemplateName": "96036718-71cc-4027-a538-d1587e0006a7",
        "author": "vburov",
        "customDetails": null,
        "date": "2019/02/23",
        "description": "Detect suspicious parent processes of well-known Windows processes",
        "displayName": "Windows Processes Suspicious Parent Directory",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/02/14",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\svchost.exe\" or FolderPath endswith \"\\\\taskhost.exe\" or FolderPath endswith \"\\\\lsm.exe\" or FolderPath endswith \"\\\\lsass.exe\" or FolderPath endswith \"\\\\services.exe\" or FolderPath endswith \"\\\\lsaiso.exe\" or FolderPath endswith \"\\\\csrss.exe\" or FolderPath endswith \"\\\\wininit.exe\" or FolderPath endswith \"\\\\winlogon.exe\") and (not((((InitiatingProcessFolderPath contains \"\\\\Windows Defender\\\\\" or InitiatingProcessFolderPath contains \"\\\\Microsoft Security Client\\\\\") and InitiatingProcessFolderPath endswith \"\\\\MsMpEng.exe\") or (isnull(InitiatingProcessFolderPath) or InitiatingProcessFolderPath =~ \"-\") or ((InitiatingProcessFolderPath endswith \"\\\\SavService.exe\" or InitiatingProcessFolderPath endswith \"\\\\ngen.exe\") or (InitiatingProcessFolderPath contains \"\\\\System32\\\\\" or InitiatingProcessFolderPath contains \"\\\\SysWOW64\\\\\")))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "low",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1036"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
