{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9cfc00b6-bfb7-49ce-9781-ef78503154bb')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9cfc00b6-bfb7-49ce-9781-ef78503154bb')]",
      "properties": {
        "alertRuleTemplateName": "9cfc00b6-bfb7-49ce-9781-ef78503154bb",
        "author": "frack113, manasmbellani",
        "customDetails": null,
        "date": "2022/02/16",
        "description": "Detects the execution of \"Wlrmdr.exe\" with the \"-u\" command line flag which allows anything passed to it to be an argument of the ShellExecute API, which would allow an attacker to execute arbitrary binaries.\nThis detection also focuses on any uncommon child processes spawned from \"Wlrmdr.exe\" as a supplement for those that posses \"ParentImage\" telemetry.\n",
        "displayName": "Wlrmdr.EXE Uncommon Argument Or Child Process",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/06",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\wlrmdr.exe\" or ((((ProcessCommandLine contains \"-s \" or ProcessCommandLine contains \"/s \") and (ProcessCommandLine contains \"-f \" or ProcessCommandLine contains \"/f \") and (ProcessCommandLine contains \"-t \" or ProcessCommandLine contains \"/t \") and (ProcessCommandLine contains \"-m \" or ProcessCommandLine contains \"/m \") and (ProcessCommandLine contains \"-a \" or ProcessCommandLine contains \"/a \") and (ProcessCommandLine contains \"-u \" or ProcessCommandLine contains \"/u \")) and (FolderPath endswith \"\\\\wlrmdr.exe\" or ProcessVersionInfoOriginalFileName =~ \"WLRMNDR.EXE\")) and (not(((InitiatingProcessFolderPath in~ (\"\", \"-\")) or isnull(InitiatingProcessFolderPath) or InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\winlogon.exe\"))))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1218"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
