{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e')]",
      "properties": {
        "alertRuleTemplateName": "ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e",
        "author": "Thomas Patzke",
        "customDetails": null,
        "date": "2018/03/07",
        "description": "Detects WMI script event consumers",
        "displayName": "WMI Persistence - Script Event Consumer",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2022/10/11",
        "query": "DeviceProcessEvents\n| where FolderPath =~ \"C:\\\\WINDOWS\\\\system32\\\\wbem\\\\scrcons.exe\" and InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\svchost.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence"
        ],
        "techniques": [
          "T1546"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
