{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7707a579-e0d8-4886-a853-ce47e4575aaa')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7707a579-e0d8-4886-a853-ce47e4575aaa')]",
      "properties": {
        "alertRuleTemplateName": "7707a579-e0d8-4886-a853-ce47e4575aaa",
        "author": "Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)",
        "customDetails": null,
        "date": "2020/10/12",
        "description": "Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\\Windows\\System32\\wbem\\` directory over the network and loading it for a WMI DLL Hijack scenario.",
        "displayName": "Wmiprvse Wbemcomn DLL Hijack",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "image_load",
          "product": "windows"
        },
        "modified": "2022/10/09",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\wbem\\\\wbemcomn.dll\" and InitiatingProcessFolderPath endswith \"\\\\wmiprvse.exe\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "techniques": [
          "T1021",
          "T1047"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
