{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13')]",
      "properties": {
        "alertRuleTemplateName": "75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13",
        "author": "Sreeman",
        "customDetails": null,
        "date": "2021/06/11",
        "description": "Detects applications trying to modify the registry in order to disable any write-protect property for storage devices.\nThis could be a precursor to a ransomware attack and has been an observed technique used by cypherpunk group.\n",
        "displayName": "Write Protect For Storage Disabled",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/01/18",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"\\\\System\\\\CurrentControlSet\\\\Control\" and ProcessCommandLine contains \"Write Protection\" and ProcessCommandLine contains \"0\" and ProcessCommandLine contains \"storage\"",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1562"
        ],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
