{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99')]",
      "properties": {
        "alertRuleTemplateName": "ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99",
        "author": "X__Junior (Nextron Systems)",
        "customDetails": null,
        "date": "2023/11/26",
        "description": "Detects execution of the \"wusa.exe\" (Windows Update Standalone Installer) utility by a parent process that is located in a suspicious location.\n",
        "displayName": "Wusa.EXE Executed By Parent Process Located In Suspicious Location",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\wusa.exe\" and ((InitiatingProcessFolderPath contains \":\\\\Perflogs\\\\\" or InitiatingProcessFolderPath contains \":\\\\Users\\\\Public\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\Temp\\\\\" or InitiatingProcessFolderPath contains \"\\\\Appdata\\\\Local\\\\Temp\\\\\" or InitiatingProcessFolderPath contains \"\\\\Temporary Internet\") or ((InitiatingProcessFolderPath contains \":\\\\Users\\\\\" and InitiatingProcessFolderPath contains \"\\\\Favorites\\\\\") or (InitiatingProcessFolderPath contains \":\\\\Users\\\\\" and InitiatingProcessFolderPath contains \"\\\\Favourites\\\\\") or (InitiatingProcessFolderPath contains \":\\\\Users\\\\\" and InitiatingProcessFolderPath contains \"\\\\Contacts\\\\\") or (InitiatingProcessFolderPath contains \":\\\\Users\\\\\" and InitiatingProcessFolderPath contains \"\\\\Pictures\\\\\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "high",
        "status": "experimental",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "execution"
        ],
        "techniques": [],
        "templateVersion": "1.0.0",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
