{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/05c36dd6-79d6-4a9a-97da-3db20298ab2d')]",
      "kind": "NRT",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/05c36dd6-79d6-4a9a-97da-3db20298ab2d')]",
      "properties": {
        "alertRuleTemplateName": "05c36dd6-79d6-4a9a-97da-3db20298ab2d",
        "author": "Timur Zinniatullin, oscd.community, Swachchhanda Shrawan Poudel",
        "customDetails": null,
        "date": "2019/10/21",
        "description": "Detects the execution of WMIC with the \"format\" flag to potentially load XSL files.\nAdversaries abuse this functionality to execute arbitrary files while potentially bypassing application whitelisting defenses.\nExtensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files.\n",
        "displayName": "XSL Script Execution Via WMIC.EXE",
        "enabled": true,
        "entityMappings": null,
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "logsource": {
          "category": "process_creation",
          "product": "windows"
        },
        "modified": "2024/03/05",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"-format\" or ProcessCommandLine contains \"/format\") and FolderPath endswith \"\\\\wmic.exe\") and (not((ProcessCommandLine contains \"Format:List\" or ProcessCommandLine contains \"Format:htable\" or ProcessCommandLine contains \"Format:hform\" or ProcessCommandLine contains \"Format:table\" or ProcessCommandLine contains \"Format:mof\" or ProcessCommandLine contains \"Format:value\" or ProcessCommandLine contains \"Format:rawxml\" or ProcessCommandLine contains \"Format:xml\" or ProcessCommandLine contains \"Format:csv\")))",
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "sentinelEntitiesMappings": null,
        "severity": "medium",
        "status": "test",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": null,
        "techniques": [
          "t1220"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
