id: cd96d5f2-b6ac-46ac-a87e-55954c0c4ea2
name: Privileged Entra Directory Roles unassigned from multiple accounts
version: 1.0.0
kind: Scheduled
description: Highly privileged Entra directory roles removed from multiple accounts.
severity: Medium
queryFrequency: 5m
queryPeriod: 2h
triggerOperator: gt
triggerThreshold: 2
tactics:
- Impact
relevantTechniques:
- T1531
query:  'DeviceImageLoadEvents

  | where (FolderPath endswith "\\coreclr.dll" or FolderPath endswith "\\facesdk.dll"
  or FolderPath endswith "\\HPCustPartUI.dll" or FolderPath endswith "\\libcef.dll"
  or FolderPath endswith "\\ZIPDLL.dll") and ((FolderPath contains ":\\Perflogs\\"
  or FolderPath contains ":\\Users\\Public\\" or FolderPath contains "\\Temporary
  Internet" or FolderPath contains "\\Windows\\Temp\\") or ((FolderPath contains ":\\Users\\"
  and FolderPath contains "\\Favorites\\") or (FolderPath contains ":\\Users\\" and
  FolderPath contains "\\Favourites\\") or (FolderPath contains ":\\Users\\" and FolderPath
  contains "\\Contacts\\") or (FolderPath contains ":\\Users\\" and FolderPath contains
  "\\Pictures\\")))'
