{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "apiVersion": "2023-02-01-preview",
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cd96d5f2-b6ac-46ac-a87e-55954c0c4ea2')]",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cd96d5f2-b6ac-46ac-a87e-55954c0c4ea2')]",
      "properties": {
        "alertRuleTemplateName": "cd96d5f2-b6ac-46ac-a87e-55954c0c4ea2",
        "customDetails": {
          "RoleDisplayName": "RoleDisplayName"
        },
        "description": "Highly privileged Entra directory roles removed from multiple accounts.",
        "displayName": "Privileged Entra Directory Roles unassigned from multiple accounts",
        "enabled": true,
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "UserObjectId",
                "identifier": "AadUserId"
              }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "Actor",
                "identifier": "AadUserId"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "IPAddress",
                "identifier": "Address"
              }
            ]
          }
        ],
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": true,
            "groupByAlertDetails": [],
            "groupByCustomDetails": [
              "RoleDisplayName"
            ],
            "groupByEntities": [
              "Account"
            ],
            "lookbackDuration": "PT2H",
            "matchingMethod": "Selected",
            "reopenClosedIncident": false
          }
        },
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\coreclr.dll\" or FolderPath endswith \"\\\\facesdk.dll\" or FolderPath endswith \"\\\\HPCustPartUI.dll\" or FolderPath endswith \"\\\\libcef.dll\" or FolderPath endswith \"\\\\ZIPDLL.dll\") and ((FolderPath contains \":\\\\Perflogs\\\\\" or FolderPath contains \":\\\\Users\\\\Public\\\\\" or FolderPath contains \"\\\\Temporary Internet\" or FolderPath contains \"\\\\Windows\\\\Temp\\\\\") or ((FolderPath contains \":\\\\Users\\\\\" and FolderPath contains \"\\\\Favorites\\\\\") or (FolderPath contains \":\\\\Users\\\\\" and FolderPath contains \"\\\\Favourites\\\\\") or (FolderPath contains \":\\\\Users\\\\\" and FolderPath contains \"\\\\Contacts\\\\\") or (FolderPath contains \":\\\\Users\\\\\" and FolderPath contains \"\\\\Pictures\\\\\")))",
        "queryFrequency": "PT5M",
        "queryPeriod": "PT2H",
        "severity": "Medium",
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "Impact"
        ],
        "techniques": [
          "T1531"
        ],
        "templateVersion": "1.0.0",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 2
      },
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules"
    }
  ]
}
