name: Abused Debug Privilege by Arbitrary Parent Processes
id: d522eca2-2973-4391-a3e0-ef0374321dae
severity: high
description: Detection of unusual child processes by different system processes
tactics:
- privilege_escalation
relevantTechniques:
- t1548
query: |+
  DeviceProcessEvents
  | where (((FolderPath endswith "\\powershell.exe" or FolderPath endswith "\\pwsh.exe"
  or FolderPath endswith "\\cmd.exe") or (ProcessVersionInfoOriginalFileName in~ ("PowerShell.EXE",
  "pwsh.dll", "Cmd.Exe"))) and ((InitiatingProcessFolderPath endswith "\\winlogon.exe"
  or InitiatingProcessFolderPath endswith "\\services.exe" or InitiatingProcessFolderPath
  endswith "\\lsass.exe" or InitiatingProcessFolderPath endswith "\\csrss.exe" or
  InitiatingProcessFolderPath endswith "\\smss.exe" or InitiatingProcessFolderPath
  endswith "\\wininit.exe" or InitiatingProcessFolderPath endswith "\\spoolsv.exe"
  or InitiatingProcessFolderPath endswith "\\searchindexer.exe") and (AccountName
  contains "AUTHORI" or AccountName contains "AUTORI"))) and (not((ProcessCommandLine
  contains " route " and ProcessCommandLine contains " ADD ")))
