id: cd96d5f2-b6ac-46ac-a87e-55954c0c4ea2
name: Privileged Entra Directory Roles unassigned from multiple accounts
description: Highly privileged Entra directory roles removed from multiple accounts.
severity: Medium
queryFrequency: 5m
tactics:
- Impact
relevantTechniques:
- T1531
query: |+
  DeviceProcessEvents
  | where (((FolderPath endswith "\\powershell.exe" or FolderPath endswith "\\pwsh.exe"
  or FolderPath endswith "\\cmd.exe") or (ProcessVersionInfoOriginalFileName in~ ("PowerShell.EXE",
  "pwsh.dll", "Cmd.Exe"))) and ((InitiatingProcessFolderPath endswith "\\winlogon.exe"
  or InitiatingProcessFolderPath endswith "\\services.exe" or InitiatingProcessFolderPath
  endswith "\\lsass.exe" or InitiatingProcessFolderPath endswith "\\csrss.exe" or
  InitiatingProcessFolderPath endswith "\\smss.exe" or InitiatingProcessFolderPath
  endswith "\\wininit.exe" or InitiatingProcessFolderPath endswith "\\spoolsv.exe"
  or InitiatingProcessFolderPath endswith "\\searchindexer.exe") and (AccountName
  contains "AUTHORI" or AccountName contains "AUTORI"))) and (not((ProcessCommandLine
  contains " route " and ProcessCommandLine contains " ADD ")))
