{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Change_PowerShell_Policies_to_an_Insecure_Level')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Change PowerShell Policies to an Insecure Level",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")) or (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\")) and (ProcessCommandLine contains \"Bypass\" or ProcessCommandLine contains \"Unrestricted\") and (ProcessCommandLine contains \"-executionpolicy \" or ProcessCommandLine contains \" -ep \" or ProcessCommandLine contains \" -exec \")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects changing the PowerShell script execution policy to a potentially insecure level using the \"-ExecutionPolicy\" fla"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
