{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Communication_To_Ngrok_Tunneling_Service_Initiated')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Communication To Ngrok Tunneling Service Initiated",
        "category": "Hunting Queries",
        "query": "DeviceNetworkEvents\n| where RemoteUrl contains \"tunnel.us.ngrok.com\" or RemoteUrl contains \"tunnel.eu.ngrok.com\" or RemoteUrl contains \"tunnel.ap.ngrok.com\" or RemoteUrl contains \"tunnel.au.ngrok.com\" or RemoteUrl contains \"tunnel.sa.ngrok.com\" or RemoteUrl contains \"tunnel.jp.ngrok.com\" or RemoteUrl contains \"tunnel.in.ngrok.com\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects an executable initiating a network connection to \"ngrok\" tunneling domains.\nAttackers were seen using this \"ngrok\" in order to store their second stage payloads and malware.\nWhile communication with such domains can be legitimate, of"
          },
          {
            "name": "tactics",
            "value": "command_and_control,exfiltration,s0508"
          },
          {
            "name": "relevantTechniques",
            "value": "T1090,T1102,T1567,T1568,T1572"
          }
        ]
      }
    }
  ]
}
