{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_SecurityXploded_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - SecurityXploded Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoCompanyName =~ \"SecurityXploded\" or FolderPath endswith \"PasswordDump.exe\" or ProcessVersionInfoOriginalFileName endswith \"PasswordDump.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the execution of SecurityXploded Too"
          },
          {
            "name": "tactics",
            "value": "credential_access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1555"
          }
        ]
      }
    }
  ]
}
