{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Import_PowerShell_Modules_From_Suspicious_Directories_-_ProcCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Import PowerShell Modules From Suspicious Directories - ProcCreation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"Import-Module \\\"$Env:Temp\\\\\" or ProcessCommandLine contains \"Import-Module '$Env:Temp\\\\\" or ProcessCommandLine contains \"Import-Module $Env:Temp\\\\\" or ProcessCommandLine contains \"Import-Module \\\"$Env:Appdata\\\\\" or ProcessCommandLine contains \"Import-Module '$Env:Appdata\\\\\" or ProcessCommandLine contains \"Import-Module $Env:Appdata\\\\\" or ProcessCommandLine contains \"Import-Module C:\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"ipmo \\\"$Env:Temp\\\\\" or ProcessCommandLine contains \"ipmo '$Env:Temp\\\\\" or ProcessCommandLine contains \"ipmo $Env:Temp\\\\\" or ProcessCommandLine contains \"ipmo \\\"$Env:Appdata\\\\\" or ProcessCommandLine contains \"ipmo '$Env:Appdata\\\\\" or ProcessCommandLine contains \"ipmo $Env:Appdata\\\\\" or ProcessCommandLine contains \"ipmo C:\\\\Users\\\\Public\\\\\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects powershell scripts that import modules from suspicious directori"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
