{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Kernel_Memory_Dump_Via_LiveKD')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Kernel Memory Dump Via LiveKD",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -m\" or ProcessCommandLine contains \" /m\") and ((FolderPath endswith \"\\\\livekd.exe\" or FolderPath endswith \"\\\\livekd64.exe\") or ProcessVersionInfoOriginalFileName =~ \"livekd.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects execution of LiveKD with the \"-m\" flag to potentially dump the kernel memo"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          }
        ]
      }
    }
  ]
}
