{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Loaded_Module_Enumeration_Via_Tasklist.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Loaded Module Enumeration Via Tasklist.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-m\" or ProcessCommandLine contains \"/m\") and (FolderPath endswith \"\\\\tasklist.exe\" or ProcessVersionInfoOriginalFileName =~ \"tasklist.exe\") and ProcessCommandLine contains \"rdpcorets.dll\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the enumeration of a specific DLL or EXE being used by a binary via \"tasklist.exe\".\nThis is often used by attackers in order to find the specific process identifier (PID) that is using the DLL in question.\nIn order to dump the proces"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
