{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Mavinject_Inject_DLL_Into_Running_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Mavinject Inject DLL Into Running Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" /INJECTRUNNING \" and (not(InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\AppVClient.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects process injection using the signed Windows tool \"Mavinject\" via the \"INJECTRUNNING\" fl"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,privilege_escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1055,T1218"
          }
        ]
      }
    }
  ]
}
