{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potentially_Suspicious_Windows_App_Activity')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potentially Suspicious Windows App Activity",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath contains \"C:\\\\Program Files\\\\WindowsApps\\\\\" and ((ProcessCommandLine contains \"cmd /c\" or ProcessCommandLine contains \"Invoke-\" or ProcessCommandLine contains \"Base64\") or (FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\wscript.exe\")) and (not(((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\pwsh.exe\") and InitiatingProcessFolderPath contains \":\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal\" and InitiatingProcessFolderPath endswith \"\\\\WindowsTerminal.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects potentially suspicious child process of applications launched from inside the WindowsApps directory. This could be a sign of a rogue \".appx\" package installation/executi"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          }
        ]
      }
    }
  ]
}
