{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Dosfuscation_Activity')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Dosfuscation Activity",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"^^\" or ProcessCommandLine contains \"^|^\" or ProcessCommandLine contains \",;,\" or ProcessCommandLine contains \";;;;\" or ProcessCommandLine contains \";; ;;\" or ProcessCommandLine contains \"(,(,\" or ProcessCommandLine contains \"%COMSPEC:~\" or ProcessCommandLine contains \" c^m^d\" or ProcessCommandLine contains \"^c^m^d\" or ProcessCommandLine contains \" c^md\" or ProcessCommandLine contains \" cm^d\" or ProcessCommandLine contains \"^cm^d\" or ProcessCommandLine contains \" s^et \" or ProcessCommandLine contains \" s^e^t \" or ProcessCommandLine contains \" se^t \"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects possible payload obfuscation via the commandli"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
