{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Scheduled_Task_Executing_Payload_from_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Scheduled Task Executing Payload from Registry",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/Create\" and (ProcessCommandLine contains \"Get-ItemProperty\" or ProcessCommandLine contains \" gp \") and (ProcessCommandLine contains \"HKCU:\" or ProcessCommandLine contains \"HKLM:\" or ProcessCommandLine contains \"registry::\" or ProcessCommandLine contains \"HKEY_\") and (FolderPath endswith \"\\\\schtasks.exe\" or ProcessVersionInfoOriginalFileName =~ \"schtasks.exe\")) and (not((ProcessCommandLine contains \"FromBase64String\" or ProcessCommandLine contains \"encodedcommand\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the creation of a schtasks that potentially executes a payload stored in the Windows Registry using PowerShel"
          },
          {
            "name": "tactics",
            "value": "execution,persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1053,T1059"
          }
        ]
      }
    }
  ]
}
