{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Sensitive_File_Access_Via_Volume_Shadow_Copy_Backup')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Sensitive File Access Via Volume Shadow Copy Backup",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"\\\\\\\\?\\\\GLOBALROOT\\\\Device\\\\HarddiskVolumeShadowCopy\" and (ProcessCommandLine contains \"\\\\NTDS.dit\" or ProcessCommandLine contains \"\\\\SYSTEM\" or ProcessCommandLine contains \"\\\\SECURITY\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a command that accesses the VolumeShadowCopy in order to extract sensitive files such as the Security or SAM registry hives or the AD database (ntds.dit"
          },
          {
            "name": "tactics",
            "value": "impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1490"
          }
        ]
      }
    }
  ]
}
