{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Stop_Windows_Service_Via_Net.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Stop Windows Service Via Net.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" stop \" and ((ProcessVersionInfoOriginalFileName in~ (\"net.exe\", \"net1.exe\")) or (FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\net1.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the stopping of a Windows service via the \"net\" utilit"
          },
          {
            "name": "tactics",
            "value": "impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1489"
          }
        ]
      }
    }
  ]
}
