{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Child_Process_of_AspNetCompiler')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Child Process of AspNetCompiler",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\calc.exe\" or FolderPath endswith \"\\\\notepad.exe\") or (FolderPath contains \"\\\\Users\\\\Public\\\\\" or FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or FolderPath contains \"\\\\AppData\\\\Local\\\\Roaming\\\\\" or FolderPath contains \":\\\\Temp\\\\\" or FolderPath contains \":\\\\Windows\\\\Temp\\\\\" or FolderPath contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or FolderPath contains \":\\\\Windows\\\\Tasks\\\\\")) and InitiatingProcessFolderPath endswith \"\\\\aspnet_compiler.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects potentially suspicious child processes of \"aspnet_compiler.exe"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1127"
          }
        ]
      }
    }
  ]
}
