{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Windows_Update_Agent_Empty_Cmdline')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Windows Update Agent Empty Cmdline",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \"Wuauclt\" or ProcessCommandLine endswith \"Wuauclt.exe\") and (FolderPath endswith \"\\\\Wuauclt.exe\" or ProcessVersionInfoOriginalFileName =~ \"Wuauclt.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects suspicious Windows Update Agent activity in which a wuauclt.exe process command line doesn't contain any command line flag"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
