{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Uncommon_Outbound_Kerberos_Connection')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Uncommon Outbound Kerberos Connection",
        "category": "Hunting Queries",
        "query": "DeviceNetworkEvents\n| where RemotePort == 88 and (not(InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\lsass.exe\")) and (not(((InitiatingProcessFolderPath in~ (\"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\", \"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\")) or (InitiatingProcessFolderPath in~ (\"C:\\\\Program Files (x86)\\\\Mozilla Firefox\\\\firefox.exe\", \"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\")) or InitiatingProcessFolderPath endswith \"\\\\tomcat\\\\bin\\\\tomcat8.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects uncommon outbound network activity via Kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation"
          },
          {
            "name": "tactics",
            "value": "credential_access,lateral_movement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1550,T1558"
          }
        ]
      }
    }
  ]
}
