{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Usage_Of_Web_Request_Commands_And_Cmdlets')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Usage Of Web Request Commands And Cmdlets",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"[System.Net.WebRequest]::create\" or ProcessCommandLine contains \"curl \" or ProcessCommandLine contains \"Invoke-RestMethod\" or ProcessCommandLine contains \"Invoke-WebRequest\" or ProcessCommandLine contains \"iwr \" or ProcessCommandLine contains \"Net.WebClient\" or ProcessCommandLine contains \"Resume-BitsTransfer\" or ProcessCommandLine contains \"Start-BitsTransfer\" or ProcessCommandLine contains \"wget \" or ProcessCommandLine contains \"WinHttp.WinHttpRequest\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the use of various web request commands with commandline tools and Windows PowerShell cmdlets (including aliases) via CommandLi"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
