{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Use_of_Wfc.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Use of Wfc.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\wfc.exe\" or ProcessVersionInfoOriginalFileName =~ \"wfc.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "he Workflow Command-line Compiler can be used for AWL bypass and is listed in Microsoft's recommended block rule"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1127"
          }
        ]
      }
    }
  ]
}
