{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Windows_Recall_Feature_Enabled_Via_Reg.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Windows Recall Feature Enabled Via Reg.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\") and (ProcessCommandLine contains \"Microsoft\\\\Windows\\\\WindowsAI\" and ProcessCommandLine contains \"DisableAIDataAnalysis\") and ((ProcessCommandLine contains \"add\" or ProcessCommandLine contains \"0\") or ProcessCommandLine contains \"delete\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the enabling of the Windows Recall feature via registry manipulation.\nWindows Recall can be enabled by deleting the existing \"DisableAIDataAnalysis\" value, or setting it to 0.\nAdversaries may enable Windows Recall as part of post-exp"
          },
          {
            "name": "tactics",
            "value": "collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1113"
          }
        ]
      }
    }
  ]
}
