{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Windows_Defender_Definition_Files_Removed')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Windows Defender Definition Files Removed",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -RemoveDefinitions\" and ProcessCommandLine contains \" -All\") and (FolderPath endswith \"\\\\MpCmdRun.exe\" or ProcessVersionInfoOriginalFileName =~ \"MpCmdRun.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "dversaries may disable security tools to avoid possible detection of their tools and activities by removing Windows Defender Definition Fil"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
