{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/WMI_Persistence_-_Command_Line_Event_Consumer')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "WMI Persistence - Command Line Event Consumer",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe\" and FolderPath endswith \"\\\\wbemcons.dll\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects WMI command line event consume"
          },
          {
            "name": "tactics",
            "value": "persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1546"
          }
        ]
      }
    }
  ]
}
