{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Writing_Of_Malicious_Files_To_The_Fonts_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Writing Of Malicious Files To The Fonts Folder",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"echo\" or ProcessCommandLine contains \"copy\" or ProcessCommandLine contains \"type\" or ProcessCommandLine contains \"file createnew\" or ProcessCommandLine contains \"cacls\") and ProcessCommandLine contains \"C:\\\\Windows\\\\Fonts\\\\\" and (ProcessCommandLine contains \".sh\" or ProcessCommandLine contains \".exe\" or ProcessCommandLine contains \".dll\" or ProcessCommandLine contains \".bin\" or ProcessCommandLine contains \".bat\" or ProcessCommandLine contains \".cmd\" or ProcessCommandLine contains \".js\" or ProcessCommandLine contains \".msh\" or ProcessCommandLine contains \".reg\" or ProcessCommandLine contains \".scr\" or ProcessCommandLine contains \".ps\" or ProcessCommandLine contains \".vb\" or ProcessCommandLine contains \".jar\" or ProcessCommandLine contains \".pl\" or ProcessCommandLine contains \".inf\" or ProcessCommandLine contains \".cpl\" or ProcessCommandLine contains \".hta\" or ProcessCommandLine contains \".msi\" or ProcessCommandLine contains \".vbs\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "onitors for the hiding possible malicious files in the C:\\Windows\\Fonts\\ location. This folder doesn't require admin privillege to be written and executed fro"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1211"
          }
        ]
      }
    }
  ]
}
