{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/AADInternals_PowerShell_Cmdlets_Execution_-_ProccessCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "AADInternals PowerShell Cmdlets Execution - ProccessCreation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Add-AADInt\" or ProcessCommandLine contains \"ConvertTo-AADInt\" or ProcessCommandLine contains \"Disable-AADInt\" or ProcessCommandLine contains \"Enable-AADInt\" or ProcessCommandLine contains \"Export-AADInt\" or ProcessCommandLine contains \"Get-AADInt\" or ProcessCommandLine contains \"Grant-AADInt\" or ProcessCommandLine contains \"Install-AADInt\" or ProcessCommandLine contains \"Invoke-AADInt\" or ProcessCommandLine contains \"Join-AADInt\" or ProcessCommandLine contains \"New-AADInt\" or ProcessCommandLine contains \"Open-AADInt\" or ProcessCommandLine contains \"Read-AADInt\" or ProcessCommandLine contains \"Register-AADInt\" or ProcessCommandLine contains \"Remove-AADInt\" or ProcessCommandLine contains \"Restore-AADInt\" or ProcessCommandLine contains \"Search-AADInt\" or ProcessCommandLine contains \"Send-AADInt\" or ProcessCommandLine contains \"Set-AADInt\" or ProcessCommandLine contains \"Start-AADInt\" or ProcessCommandLine contains \"Update-AADInt\") and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.Exe\", \"pwsh.dll\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects ADDInternals Cmdlet execution. A tool for administering Azure AD and Office 365. Which can be abused by threat actors to attack Azure AD or Office 3"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess,Discovery,Execution,Impact,Reconnaissance"
          }
        ]
      }
    }
  ]
}
