{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Access_To_Browser_Credential_Files_By_Uncommon_Application')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Access To Browser Credential Files By Uncommon Application",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where ((FileName contains \"\\\\Appdata\\\\Local\\\\Chrome\\\\User Data\\\\Default\\\\Login Data\" or FileName contains \"\\\\AppData\\\\Local\\\\Google\\\\Chrome\\\\User Data\\\\Default\\\\Network\\\\Cookies\" or FileName contains \"\\\\AppData\\\\Local\\\\Google\\\\Chrome\\\\User Data\\\\Local State\") or (FileName endswith \"\\\\cookies.sqlite\" or FileName endswith \"release\\\\key3.db\" or FileName endswith \"release\\\\key4.db\" or FileName endswith \"release\\\\logins.json\") or FileName endswith \"\\\\Appdata\\\\Local\\\\Microsoft\\\\Windows\\\\WebCache\\\\WebCacheV01.dat\") and (not(((InitiatingProcessFolderPath contains \":\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath contains \":\\\\Program Files\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\system32\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\") or InitiatingProcessFolderPath =~ \"System\"))) and (not(((InitiatingProcessFolderPath contains \":\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\\" and (InitiatingProcessFolderPath endswith \"\\\\MpCopyAccelerator.exe\" or InitiatingProcessFolderPath endswith \"\\\\MsMpEng.exe\")) or (InitiatingProcessFolderPath endswith \"\\\\thor64.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects file access requests to browser credential stores by uncommon processes.\nCould indicate potential attempt of credential stealing.\nRequires heavy baselining before usage\n"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
