{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Access_To_Windows_Credential_History_File_By_Uncommon_Application')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Access To Windows Credential History File By Uncommon Application",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FileName endswith \"\\\\Microsoft\\\\Protect\\\\CREDHIST\" and (not((InitiatingProcessFolderPath endswith \":\\\\Windows\\\\explorer.exe\" or (InitiatingProcessFolderPath contains \":\\\\Program Files\\\\\" or InitiatingProcessFolderPath contains \":\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\system32\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects file access requests to the Windows Credential History File by an uncommon application.\nThis can be a sign of credential stealing. Example case would be usage of mimikatz \"dpapi::credhist\" function\n"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1555"
          }
        ]
      }
    }
  ]
}
