{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Access_To_Windows_DPAPI_Master_Keys_By_Uncommon_Application')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Access To Windows DPAPI Master Keys By Uncommon Application",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FileName contains \"\\\\Microsoft\\\\Protect\\\\S-1-5-18\\\\\" or FileName contains \"\\\\Microsoft\\\\Protect\\\\S-1-5-21-\") and (not((InitiatingProcessFolderPath contains \":\\\\Program Files\\\\\" or InitiatingProcessFolderPath contains \":\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\system32\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects file access requests to the the Windows Data Protection API Master keys by an uncommon application.\nThis can be a sign of credential stealing. Example case would be usage of mimikatz \"dpapi::masterkey\" function\n"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1555"
          }
        ]
      }
    }
  ]
}
