{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Access_To_Windows_Outlook_Mail_Files_By_Uncommon_Application')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Access To Windows Outlook Mail Files By Uncommon Application",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FileName contains \"\\\\AppData\\\\Local\\\\Comms\\\\Unistore\\\\data\" or FileName endswith \"\\\\AppData\\\\Local\\\\Comms\\\\UnistoreDB\\\\store.vol\") and (not(((InitiatingProcessFolderPath contains \":\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath contains \":\\\\Program Files\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\system32\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\") or InitiatingProcessFolderPath =~ \"System\"))) and (not(((InitiatingProcessFolderPath contains \":\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\\" and (InitiatingProcessFolderPath endswith \"\\\\MpCopyAccelerator.exe\" or InitiatingProcessFolderPath endswith \"\\\\MsMpEng.exe\")) or (InitiatingProcessFolderPath endswith \"\\\\thor64.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects file access requests to Windows Outlook Mail by uncommon processes.\nCould indicate potential attempt of credential stealing.\nRequires heavy baselining before usage\n"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1070"
          }
        ]
      }
    }
  ]
}
