{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Active_Directory_Structure_Export_Via_Ldifde.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Active Directory Structure Export Via Ldifde.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-f\" and (FolderPath endswith \"\\\\ldifde.exe\" or ProcessVersionInfoOriginalFileName =~ \"ldifde.exe\")) and (not(ProcessCommandLine contains \" -i\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of \"ldifde.exe\" in order to export organizational Active Directory structu"
          },
          {
            "name": "tactics",
            "value": "Exfiltration"
          }
        ]
      }
    }
  ]
}
