{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Add_Port_Monitor_Persistence_in_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Add Port Monitor Persistence in Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryValueData endswith \".dll\" and RegistryKey contains \"\\\\Control\\\\Print\\\\Monitors\") and (not(((RegistryValueData =~ \"cpwmon64_v40.dll\" and InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\spoolsv.exe\" and RegistryKey contains \"\\\\Control\\\\Print\\\\Monitors\\\\CutePDF Writer Monitor v4.0\\\\Driver\" and (InitiatingProcessAccountName contains \"AUTHORI\" or InitiatingProcessAccountName contains \"AUTORI\")) or RegistryKey contains \"\\\\Control\\\\Print\\\\Monitors\\\\MONVNC\\\\Driver\" or (RegistryKey contains \"Control\\\\Print\\\\Environments\" and RegistryKey contains \"\\\\Drivers\" and RegistryKey contains \"\\\\VNC Printer\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Adversaries may use port monitors to run an attacker supplied DLL during system boot for persistence or privilege escalation.\nA port monitor can be set through the AddMonitor API call to set a DLL to be loaded at startup.\n"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
