{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/ADS_Zone.Identifier_Deleted_By_Uncommon_Application')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "ADS Zone.Identifier Deleted By Uncommon Application",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \":Zone.Identifier\" and (not((InitiatingProcessFolderPath in~ (\"C:\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe\", \"C:\\\\Program Files\\\\PowerShell\\\\7\\\\pwsh.exe\", \"C:\\\\Windows\\\\explorer.exe\", \"C:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\explorer.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\")))) and (not(((InitiatingProcessFolderPath in~ (\"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\", \"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\")) or (InitiatingProcessFolderPath in~ (\"C:\\\\Program Files (x86)\\\\Mozilla Firefox\\\\firefox.exe\", \"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the deletion of the \"Zone.Identifier\" ADS by an uncommon process. Attackers can leverage this in order to bypass security restrictions that make use of the ADS such as Microsoft Office apps."
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1070"
          }
        ]
      }
    }
  ]
}
