{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Always_Install_Elevated_MSI_Spawned_Cmd_And_Powershell')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Always Install Elevated MSI Spawned Cmd And Powershell",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"Cmd.Exe\", \"PowerShell.EXE\", \"pwsh.dll\"))) and ((InitiatingProcessFolderPath contains \"\\\\Windows\\\\Installer\\\\\" and InitiatingProcessFolderPath contains \"msi\") and InitiatingProcessFolderPath endswith \"tmp\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects Windows Installer service (msiexec.exe) spawning \"cmd\" or \"powershe"
          },
          {
            "name": "tactics",
            "value": "Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
