{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Arbitrary_Command_Execution_Using_WSL')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Arbitrary Command Execution Using WSL",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -e \" or ProcessCommandLine contains \" --exec\" or ProcessCommandLine contains \" --system\" or ProcessCommandLine contains \" --shell-type \" or ProcessCommandLine contains \" /mnt/c\" or ProcessCommandLine contains \" --user root\" or ProcessCommandLine contains \" -u root\" or ProcessCommandLine contains \"--debug-shell\") and (FolderPath endswith \"\\\\wsl.exe\" or ProcessVersionInfoOriginalFileName =~ \"wsl.exe\")) and (not(((ProcessCommandLine contains \" -d \" and ProcessCommandLine contains \" -e kill \") and InitiatingProcessFolderPath endswith \"\\\\cmd.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential abuse of Windows Subsystem for Linux (WSL) binary as a LOLBIN to execute arbitrary Linux or Windows comma"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1202,T1218"
          }
        ]
      }
    }
  ]
}
