{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Atbroker_Registry_Change')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Atbroker Registry Change",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey contains \"Software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Accessibility\\\\ATs\" or RegistryKey contains \"Software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Accessibility\\\\Configuration\") and (not(((RegistryValueData =~ \"(Empty)\" and InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\system32\\\\atbroker.exe\" and RegistryKey contains \"\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Accessibility\\\\Configuration\") or (InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\Installer\\\\MSI\" and RegistryKey contains \"Software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Accessibility\\\\ATs\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects creation/modification of Assistive Technology applications and persistence with usage of 'at'"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218,T1547"
          }
        ]
      }
    }
  ]
}
