{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Audit_Policy_Tampering_Via_NT_Resource_Kit_Auditpol')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Audit Policy Tampering Via NT Resource Kit Auditpol",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"/logon:none\" or ProcessCommandLine contains \"/system:none\" or ProcessCommandLine contains \"/sam:none\" or ProcessCommandLine contains \"/privilege:none\" or ProcessCommandLine contains \"/object:none\" or ProcessCommandLine contains \"/process:none\" or ProcessCommandLine contains \"/policy:none\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Threat actors can use an older version of the auditpol binary available inside the NT resource kit to change audit policy configuration to impair detection capability.\nThis can be carried out by selectively disabling/removing certain audit "
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
