{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Audit_Policy_Tampering_Via_Auditpol')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Audit Policy Tampering Via Auditpol",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"disable\" or ProcessCommandLine contains \"clear\" or ProcessCommandLine contains \"remove\" or ProcessCommandLine contains \"restore\") and (FolderPath endswith \"\\\\auditpol.exe\" or ProcessVersionInfoOriginalFileName =~ \"AUDITPOL.EXE\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Threat actors can use auditpol binary to change audit policy configuration to impair detection capability.\nThis can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor.\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
