{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Automated_Collection_Command_Prompt')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Automated Collection Command Prompt",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \".doc\" or ProcessCommandLine contains \".docx\" or ProcessCommandLine contains \".xls\" or ProcessCommandLine contains \".xlsx\" or ProcessCommandLine contains \".ppt\" or ProcessCommandLine contains \".pptx\" or ProcessCommandLine contains \".rtf\" or ProcessCommandLine contains \".pdf\" or ProcessCommandLine contains \".txt\") and ((ProcessCommandLine contains \"dir \" and ProcessCommandLine contains \" /b \" and ProcessCommandLine contains \" /s \") or ((ProcessCommandLine contains \" /e \" or ProcessCommandLine contains \" /si \") and ProcessVersionInfoOriginalFileName =~ \"FINDSTR.EXE\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Once established within a system or network, an adversary may use automated techniques for collecting internal da"
          },
          {
            "name": "tactics",
            "value": "Collection,Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1119,T1552"
          }
        ]
      }
    }
  ]
}
