{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Binary_Proxy_Execution_Via_Dotnet-Trace.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Binary Proxy Execution Via Dotnet-Trace.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-- \" and ProcessCommandLine contains \"collect\") and (FolderPath endswith \"\\\\dotnet-trace.exe\" or ProcessVersionInfoOriginalFileName =~ \"dotnet-trace.dll\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects commandline arguments for executing a child process via dotnet-trace."
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
