{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Bypass_UAC_Using_Event_Viewer')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Bypass UAC Using Event Viewer",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey endswith \"_Classes\\\\mscfile\\\\shell\\\\open\\\\command\\\\(Default)\" and (not(RegistryValueData startswith \"%SystemRoot%\\\\system32\\\\mmc.exe \\\"%1\\\" %\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Bypasses User Account Control using Event Viewer and a relevant Windows Registry modification"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
