{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Bypass_UAC_via_CMSTP')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Bypass UAC via CMSTP",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/s\" or ProcessCommandLine contains \"-s\" or ProcessCommandLine contains \"/au\" or ProcessCommandLine contains \"-au\" or ProcessCommandLine contains \"/ni\" or ProcessCommandLine contains \"-ni\") and (FolderPath endswith \"\\\\cmstp.exe\" or ProcessVersionInfoOriginalFileName =~ \"CMSTP.EXE\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect commandline usage of Microsoft Connection Manager Profile Installer (cmstp.exe) to install specially formatted local .INF files"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218,T1548"
          }
        ]
      }
    }
  ]
}
