{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/C#_IL_Code_Compilation_Via_Ilasm.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "C# IL Code Compilation Via Ilasm.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" /dll\" or ProcessCommandLine contains \" /exe\") and (FolderPath endswith \"\\\\ilasm.exe\" or ProcessVersionInfoOriginalFileName =~ \"ilasm.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of \"Ilasm.EXE\" in order to compile C# intermediate (IL) code to EXE or D"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1127"
          }
        ]
      }
    }
  ]
}
