{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Capture_Credentials_with_Rpcping.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Capture Credentials with Rpcping.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\rpcping.exe\" and (ProcessCommandLine contains \"-s\" or ProcessCommandLine contains \"/s\") and (((ProcessCommandLine contains \"-u\" or ProcessCommandLine contains \"/u\") and (ProcessCommandLine contains \"NTLM\")) or ((ProcessCommandLine contains \"-t\" or ProcessCommandLine contains \"/t\") and (ProcessCommandLine contains \"ncacn_np\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects using Rpcping.exe to send a RPC test connection to the target server (-s) and force the NTLM hash to be sent in the process."
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
