{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Certificate_Exported_Via_PowerShell')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Certificate Exported Via PowerShell",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"Export-PfxCertificate \" or ProcessCommandLine contains \"Export-Certificate \"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects calls to cmdlets that are used to export certificates from the local certificate store. Threat actors were seen abusing this to steal private keys from compromised machines."
          },
          {
            "name": "tactics",
            "value": "CredentialAccess,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1552"
          }
        ]
      }
    }
  ]
}
