{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Change_User_Account_Associated_with_the_FAX_Service')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Change User Account Associated with the FAX Service",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey =~ \"HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet001\\\\Services\\\\Fax\\\\ObjectName\" and (not(RegistryValueData contains \"NetworkService\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect change of the user account associated with the FAX service to avoid the escalation problem."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
