{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Cloudflared_Tunnel_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Cloudflared Tunnel Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-config \" or ProcessCommandLine contains \"-credentials-contents \" or ProcessCommandLine contains \"-credentials-file \" or ProcessCommandLine contains \"-token \") and (ProcessCommandLine contains \" tunnel \" and ProcessCommandLine contains \" run \")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of the \"cloudflared\" tool to connect back to a tunnel. This was seen used by threat actors to maintain persistence and remote access to compromised networ"
          },
          {
            "name": "tactics",
            "value": "command_and_control"
          },
          {
            "name": "relevantTechniques",
            "value": "T1090,T1102,T1572"
          }
        ]
      }
    }
  ]
}
