{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/CMSTP_UAC_Bypass_via_COM_Object_Access')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "CMSTP UAC Bypass via COM Object Access",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessIntegrityLevel in~ (\"High\", \"System\")) and (InitiatingProcessCommandLine contains \" /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or InitiatingProcessCommandLine contains \" /Processid:{3E000D72-A845-4CD9-BD83-80C07C3B881F}\" or InitiatingProcessCommandLine contains \" /Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}\" or InitiatingProcessCommandLine contains \" /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\" or InitiatingProcessCommandLine contains \" /Processid:{E9495B87-D950-4AB5-87A5-FF6D70BF3E90}\") and InitiatingProcessFolderPath endswith \"\\\\DllHost.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects UAC Bypass Attempt Using Microsoft Connection Manager Profile Installer Autoelevate-capable COM Objects (e.g. UACMe ID of 41, 43, 58 or "
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution,G0069,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218,T1548"
          }
        ]
      }
    }
  ]
}
