{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/COM_Hijacking_via_TreatAs')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "COM Hijacking via TreatAs",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey endswith \"TreatAs\\\\(Default)\" and (not(((InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\system32\\\\msiexec.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\")) or (InitiatingProcessFolderPath endswith \"\\\\OfficeClickToRun.exe\" and InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\\") or InitiatingProcessFolderPath =~ \"C:\\\\Program Files (x86)\\\\Microsoft Office\\\\root\\\\integration\\\\integrator.exe\" or InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\system32\\\\svchost.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect modification of TreatAs key to enable \"rundll32.exe -sta\" command"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1546"
          }
        ]
      }
    }
  ]
}
