{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Compress_Data_and_Lock_With_Password_for_Exfiltration_With_7-ZIP')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Compress Data and Lock With Password for Exfiltration With 7-ZIP",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" a \" or ProcessCommandLine contains \" u \") and (ProcessVersionInfoFileDescription contains \"7-Zip\" or (FolderPath endswith \"\\\\7z.exe\" or FolderPath endswith \"\\\\7zr.exe\" or FolderPath endswith \"\\\\7za.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"7z.exe\", \"7za.exe\"))) and ProcessCommandLine contains \" -p\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "n adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party utiliti"
          },
          {
            "name": "tactics",
            "value": "collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1560"
          }
        ]
      }
    }
  ]
}
