{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Compress_Data_and_Lock_With_Password_for_Exfiltration_With_WINZIP')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Compress Data and Lock With Password for Exfiltration With WINZIP",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -min \" or ProcessCommandLine contains \" -a \") and ProcessCommandLine contains \"-s\\\"\" and (ProcessCommandLine contains \"winzip.exe\" or ProcessCommandLine contains \"winzip64.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party utilit"
          },
          {
            "name": "tactics",
            "value": "collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1560"
          }
        ]
      }
    }
  ]
}
