{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Control_Panel_Items')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Control Panel Items",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"add\" and ProcessCommandLine contains \"CurrentVersion\\\\Control Panel\\\\CPLs\") and (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\")) or (ProcessCommandLine endswith \".cpl\" and (not(((ProcessCommandLine contains \"regsvr32 \" and ProcessCommandLine contains \" /s \" and ProcessCommandLine contains \"igfxCPL.cpl\") or (ProcessCommandLine contains \"\\\\System32\\\\\" or ProcessCommandLine contains \"%System%\" or ProcessCommandLine contains \"|C:\\\\Windows\\\\system32|\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the malicious use of a control panel item"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218,T1546"
          }
        ]
      }
    }
  ]
}
