{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Copy_From_VolumeShadowCopy_Via_Cmd.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Copy From VolumeShadowCopy Via Cmd.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"copy \" and ProcessCommandLine contains \"\\\\\\\\?\\\\GLOBALROOT\\\\Device\\\\HarddiskVolumeShadowCopy\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of the builtin \"copy\" command that targets a shadow copy (sometimes used to copy registry hives that are in use)"
          },
          {
            "name": "tactics",
            "value": "Impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1490"
          }
        ]
      }
    }
  ]
}
