{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Copying_Sensitive_Files_with_Credential_Data')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Copying Sensitive Files with Credential Data",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"vss\" or ProcessCommandLine contains \" /m \" or ProcessCommandLine contains \" /y \") and (FolderPath endswith \"\\\\esentutl.exe\" or ProcessVersionInfoOriginalFileName =~ \"\\\\esentutl.exe\")) or (ProcessCommandLine contains \"\\\\windows\\\\ntds\\\\ntds.dit\" or ProcessCommandLine contains \"\\\\config\\\\sam\" or ProcessCommandLine contains \"\\\\config\\\\security\" or ProcessCommandLine contains \"\\\\config\\\\system \" or ProcessCommandLine contains \"\\\\repair\\\\sam\" or ProcessCommandLine contains \"\\\\repair\\\\system\" or ProcessCommandLine contains \"\\\\repair\\\\security\" or ProcessCommandLine contains \"\\\\config\\\\RegBack\\\\sam\" or ProcessCommandLine contains \"\\\\config\\\\RegBack\\\\system\" or ProcessCommandLine contains \"\\\\config\\\\RegBack\\\\security\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Files with well-known filenames (sensitive files with credential data) copy"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess,S0404"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
