{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Copy_From_Or_To_Admin_Share_Or_Sysvol_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Copy From Or To Admin Share Or Sysvol Folder",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"\\\\\" and ProcessCommandLine contains \"$\") or ProcessCommandLine contains \"\\\\Sysvol\\\\\") and (((FolderPath endswith \"\\\\robocopy.exe\" or FolderPath endswith \"\\\\xcopy.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"robocopy.exe\", \"XCOPY.EXE\"))) or (ProcessCommandLine contains \"copy\" and (FolderPath endswith \"\\\\cmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"Cmd.Exe\")) or ((ProcessCommandLine contains \"copy-item\" or ProcessCommandLine contains \"copy \" or ProcessCommandLine contains \"cpi \" or ProcessCommandLine contains \" cp \" or ProcessCommandLine contains \"move \" or ProcessCommandLine contains \"move-item\" or ProcessCommandLine contains \" mi \" or ProcessCommandLine contains \" mv \") and ((FolderPath contains \"\\\\powershell.exe\" or FolderPath contains \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a copy command or a copy utility execution to or from an Admin share or rem"
          },
          {
            "name": "tactics",
            "value": "Collection,Exfiltration,LateralMovement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1021,T1039,T1048"
          }
        ]
      }
    }
  ]
}
