{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/CrackMapExec_File_Indicators')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "CrackMapExec File Indicators",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath startswith \"C:\\\\Windows\\\\Temp\\\\\" and ((FolderPath matches regex \"\\\\\\\\[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}\\\\.txt$\" or FolderPath matches regex \"\\\\\\\\[a-zA-Z]{8}\\\\.tmp$\") or (FolderPath endswith \"\\\\temp.ps1\" or FolderPath endswith \"\\\\msol.ps1\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects file creation events with filename patterns used by CrackMapExec."
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
