{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/CrashControl_CrashDump_Disabled')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "CrashControl CrashDump Disabled",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000000)\" and RegistryKey contains \"SYSTEM\\\\CurrentControlSet\\\\Control\\\\CrashControl\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects disabling the CrashDump per registry (as used by HermeticWiper)"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112,T1564"
          }
        ]
      }
    }
  ]
}
