{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Creation_of_a_Local_Hidden_User_Account_by_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Creation of a Local Hidden User Account by Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where InitiatingProcessFolderPath endswith \"\\\\lsass.exe\" and RegistryKey contains \"\\\\SAM\\\\SAM\\\\Domains\\\\Account\\\\Users\\\\Names\" and RegistryKey endswith \"$\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Sysmon registry detection of a local hidden user account."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1136"
          }
        ]
      }
    }
  ]
}
