{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Creation_of_a_Diagcab')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Creation of a Diagcab",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \".diagcab\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of diagcab file, which could be caused by some legitimate installer or is a sign of exploitation (review the filename and its location)"
          },
          {
            "name": "tactics",
            "value": "Resource Development"
          }
        ]
      }
    }
  ]
}
