{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Created_Files_by_Microsoft_Sync_Center')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Created Files by Microsoft Sync Center",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where InitiatingProcessFolderPath endswith \"\\\\mobsync.exe\" and (FolderPath endswith \".dll\" or FolderPath endswith \".exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "This rule detects suspicious files created by Microsoft Sync Center (mobsync)"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1055,T1218"
          }
        ]
      }
    }
  ]
}
