{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Creation_Of_Non-Existent_System_DLL')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Creation Of Non-Existent System DLL",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \":\\\\Windows\\\\System32\\\\TSMSISrv.dll\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\TSVIPSrv.dll\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\wbem\\\\wbemcomn.dll\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\WLBSCTRL.dll\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\wow64log.dll\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\WptsExtensions.dll\" or FolderPath endswith \"\\\\SprintCSP.dll\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of system DLLs that are usually not present on the system (or at least not in system directories).\nUsually this technique is used to achieve DLL hijacking.\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Persistence,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
