{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/CredUI.DLL_Loaded_By_Uncommon_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "CredUI.DLL Loaded By Uncommon Process",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where ((FolderPath endswith \"\\\\credui.dll\" or FolderPath endswith \"\\\\wincredui.dll\") or (InitiatingProcessVersionInfoOriginalFileName in~ (\"credui.dll\", \"wincredui.dll\"))) and (not(((InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\explorer.exe\", \"C:\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe\", \"C:\\\\Windows\\\\regedit.exe\")) or (InitiatingProcessFolderPath startswith \"C:\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\System32\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\SysWOW64\\\\\")))) and (not(((InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\\" and InitiatingProcessFolderPath startswith \"C:\\\\Users\\\\\") or InitiatingProcessFolderPath endswith \"\\\\opera_autoupdate.exe\" or (InitiatingProcessFolderPath endswith \"\\\\procexp64.exe\" or InitiatingProcessFolderPath endswith \"\\\\procexp.exe\") or (InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\\" and InitiatingProcessFolderPath endswith \"\\\\Teams.exe\" and InitiatingProcessFolderPath startswith \"C:\\\\Users\\\\\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects loading of \"credui.dll\" and related DLLs by an uncommon process. Attackers might leverage this DLL for potential use of \"CredUIPromptForCredentials\" or \"CredUnPackAuthenticationBufferW"
          },
          {
            "name": "tactics",
            "value": "collection,credential_access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1056"
          }
        ]
      }
    }
  ]
}
