{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Credential_Manager_Access_By_Uncommon_Application')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Credential Manager Access By Uncommon Application",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FileName contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\Credentials\\\\\" or FileName contains \"\\\\AppData\\\\Roaming\\\\Microsoft\\\\Credentials\\\\\" or FileName contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\Vault\\\\\" or FileName contains \"\\\\ProgramData\\\\Microsoft\\\\Vault\\\\\") and (not((InitiatingProcessFolderPath contains \":\\\\Program Files\\\\\" or InitiatingProcessFolderPath contains \":\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\system32\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious processes based on name and location that access the windows credential manager and vault.\nWhich can be a sign of credential stealing. Example case would be usage of mimikatz \"dpapi::cred\" function\n"
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
