{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Csc.EXE_Execution_Form_Potentially_Suspicious_Parent')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Csc.EXE Execution Form Potentially Suspicious Parent",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\csc.exe\" or ProcessVersionInfoOriginalFileName =~ \"csc.exe\") and ((InitiatingProcessFolderPath endswith \"\\\\cscript.exe\" or InitiatingProcessFolderPath endswith \"\\\\excel.exe\" or InitiatingProcessFolderPath endswith \"\\\\mshta.exe\" or InitiatingProcessFolderPath endswith \"\\\\onenote.exe\" or InitiatingProcessFolderPath endswith \"\\\\outlook.exe\" or InitiatingProcessFolderPath endswith \"\\\\powerpnt.exe\" or InitiatingProcessFolderPath endswith \"\\\\winword.exe\" or InitiatingProcessFolderPath endswith \"\\\\wscript.exe\") or ((InitiatingProcessCommandLine contains \"-Encoded \" or InitiatingProcessCommandLine contains \"FromBase64String\") and (InitiatingProcessFolderPath endswith \"\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \"\\\\pwsh.exe\")) or (InitiatingProcessCommandLine matches regex \"([Pp]rogram[Dd]ata|%([Ll]ocal)?[Aa]pp[Dd]ata%|\\\\\\\\[Aa]pp[Dd]ata\\\\\\\\([Ll]ocal([Ll]ow)?|[Rr]oaming))\\\\\\\\[^\\\\\\\\]{1,256}$\" or (InitiatingProcessCommandLine contains \":\\\\PerfLogs\\\\\" or InitiatingProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or InitiatingProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or InitiatingProcessCommandLine contains \"\\\\Temporary Internet\") or (InitiatingProcessCommandLine contains \":\\\\Users\\\\\" and InitiatingProcessCommandLine contains \"\\\\Favorites\\\\\") or (InitiatingProcessCommandLine contains \":\\\\Users\\\\\" and InitiatingProcessCommandLine contains \"\\\\Favourites\\\\\") or (InitiatingProcessCommandLine contains \":\\\\Users\\\\\" and InitiatingProcessCommandLine contains \"\\\\Contacts\\\\\") or (InitiatingProcessCommandLine contains \":\\\\Users\\\\\" and InitiatingProcessCommandLine contains \"\\\\Pictures\\\\\"))) and (not(((InitiatingProcessFolderPath startswith \"C:\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\\") or InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\sdiagnhost.exe\" or InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\inetsrv\\\\w3wp.exe\"))) and (not(((InitiatingProcessCommandLine contains \"JwB7ACIAZgBhAGkAbABlAGQAIgA6AHQAcgB1AGUALAAiAG0AcwBnACIAOgAiAEEAbgBzAGkAYgBsAGUAIAByAGUAcQB1AGkAcgBlAHMAIABQAG8AdwBlAHIAUwBoAGUAbABsACAAdgAzAC4AMAAgAG8AcgAgAG4AZQB3AGUAcgAiAH0AJw\" or InitiatingProcessCommandLine contains \"cAewAiAGYAYQBpAGwAZQBkACIAOgB0AHIAdQBlACwAIgBtAHMAZwAiADoAIgBBAG4AcwBpAGIAbABlACAAcgBlAHEAdQBpAHIAZQBzACAAUABvAHcAZQByAFMAaABlAGwAbAAgAHYAMwAuADAAIABvAHIAIABuAGUAdwBlAHIAIgB9ACcA\" or InitiatingProcessCommandLine contains \"nAHsAIgBmAGEAaQBsAGUAZAAiADoAdAByAHUAZQAsACIAbQBzAGcAIgA6ACIAQQBuAHMAaQBiAGwAZQAgAHIAZQBxAHUAaQByAGUAcwAgAFAAbwB3AGUAcgBTAGgAZQBsAGwAIAB2ADMALgAwACAAbwByACAAbgBlAHcAZQByACIAfQAnA\") or InitiatingProcessFolderPath =~ \"C:\\\\ProgramData\\\\chocolatey\\\\choco.exe\" or InitiatingProcessCommandLine contains \"\\\\ProgramData\\\\Microsoft\\\\Windows Defender Advanced Threat Protection\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a potentially suspicious parent of \"csc.exe\", which could be a sign of payload deliver"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1027,T1059,T1218"
          }
        ]
      }
    }
  ]
}
