{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Curl_Download_And_Execute_Combination')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Curl Download And Execute Combination",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"curl \" and ProcessCommandLine contains \"http\" and ProcessCommandLine contains \"-o\" and ProcessCommandLine contains \"&\") and (ProcessCommandLine contains \" -c \" or ProcessCommandLine contains \" /c \")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Adversaries can use curl to download payloads remotely and execute them. Curl is included by default in Windows 10 build 17063 and lat"
          },
          {
            "name": "tactics",
            "value": "CommandAndControl,DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105,T1218"
          }
        ]
      }
    }
  ]
}
