{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/CurrentVersion_NT_Autorun_Keys_Modification')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "CurrentVersion NT Autorun Keys Modification",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey contains \"\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\" and (RegistryKey contains \"\\\\Winlogon\\\\VmApplet\" or RegistryKey contains \"\\\\Winlogon\\\\Userinit\" or RegistryKey contains \"\\\\Winlogon\\\\Taskman\" or RegistryKey contains \"\\\\Winlogon\\\\Shell\" or RegistryKey contains \"\\\\Winlogon\\\\GpExtensions\" or RegistryKey contains \"\\\\Winlogon\\\\AppSetup\" or RegistryKey contains \"\\\\Winlogon\\\\AlternateShells\\\\AvailableShells\" or RegistryKey contains \"\\\\Windows\\\\IconServiceLib\" or RegistryKey contains \"\\\\Windows\\\\Appinit_Dlls\" or RegistryKey contains \"\\\\Image File Execution Options\" or RegistryKey contains \"\\\\Font Drivers\" or RegistryKey contains \"\\\\Drivers32\" or RegistryKey contains \"\\\\Windows\\\\Run\" or RegistryKey contains \"\\\\Windows\\\\Load\") and (not(((InitiatingProcessFolderPath endswith \"\\\\MicrosoftEdgeUpdate.exe\" and InitiatingProcessFolderPath startswith \"C:\\\\Program Files (x86)\\\\Microsoft\\\\Temp\\\\\") or RegistryValueData =~ \"(Empty)\" or (RegistryKey contains \"\\\\Image File Execution Options\" and (RegistryKey endswith \"\\\\DisableExceptionChainValidation\" or RegistryKey endswith \"\\\\MitigationOptions\")) or ((RegistryKey contains \"\\\\ClickToRunStore\\\\HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\" or RegistryKey contains \"\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\") or (InitiatingProcessFolderPath in~ (\"C:\\\\Program Files\\\\Microsoft Office\\\\root\\\\integration\\\\integrator.exe\", \"C:\\\\Program Files (x86)\\\\Microsoft Office\\\\root\\\\integration\\\\integrator.exe\"))) or (InitiatingProcessFolderPath endswith \"\\\\ngen.exe\" and InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\Microsoft.NET\\\\Framework\") or (InitiatingProcessFolderPath endswith \"\\\\OfficeClickToRun.exe\" and (InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\Updates\\\\\")) or (RegistryValueData endswith \"\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\Update\\\\OneDriveSetup.exe\\\"\" and RegistryValueData startswith \"C:\\\\Windows\\\\system32\\\\cmd.exe /q /c del /q \\\"C:\\\\Users\\\\\" and InitiatingProcessFolderPath endswith \"\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\StandaloneUpdater\\\\OneDriveSetup.exe\" and RegistryKey endswith \"\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\Delete Cached Update Binary\") or ((RegistryValueData in~ (\"DWORD (0x00000009)\", \"DWORD (0x000003c0)\")) and InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\system32\\\\svchost.exe\" and (RegistryKey contains \"\\\\Winlogon\\\\GPExtensions\\\\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\\\\PreviousPolicyAreas\" or RegistryKey contains \"\\\\Winlogon\\\\GPExtensions\\\\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\\\\MaxNoGPOListChangesInterval\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects modification of autostart extensibility point (ASEP) in registry."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
