{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Deny_Service_Access_Using_Security_Descriptor_Tampering_Via_Sc.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Deny Service Access Using Security Descriptor Tampering Via Sc.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\sc.exe\" or ProcessVersionInfoOriginalFileName =~ \"sc.exe\") and (ProcessCommandLine contains \"sdset\" and ProcessCommandLine contains \"D;\") and (ProcessCommandLine contains \";IU\" or ProcessCommandLine contains \";SU\" or ProcessCommandLine contains \";BA\" or ProcessCommandLine contains \";SY\" or ProcessCommandLine contains \";WD\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious DACL modifications to deny access to a service that affects critical trustees. This can be used to hide services or make them unstoppable."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1543"
          }
        ]
      }
    }
  ]
}
