{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Detection_of_PowerShell_Execution_via_Sqlps.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Detection of PowerShell Execution via Sqlps.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\sqlps.exe\" or ((FolderPath endswith \"\\\\sqlps.exe\" or ProcessVersionInfoOriginalFileName =~ \"sqlps.exe\") and (not(InitiatingProcessFolderPath endswith \"\\\\sqlagent.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "This rule detects execution of a PowerShell code through the sqlps.exe utility, which is included in the standard set of utilities supplied with the MSSQL Server.\nScript blocks are not logged in this case, so this utility helps to bypass pr"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1127"
          }
        ]
      }
    }
  ]
}
