{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Direct_Autorun_Keys_Modification')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Direct Autorun Keys Modification",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"add\" and FolderPath endswith \"\\\\reg.exe\") and (ProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" or ProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\\\\Userinit\" or ProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\\\\Shell\" or ProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Windows\" or ProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\User Shell Folders\" or ProcessCommandLine contains \"\\\\system\\\\CurrentControlSet\\\\Control\\\\SafeBoot\\\\AlternateShell\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects direct modification of autostart extensibility point (ASEP) in registry using reg.e"
          },
          {
            "name": "tactics",
            "value": "persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
