{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Disable_Macro_Runtime_Scan_Scope')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Disable Macro Runtime Scan Scope",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000000)\" and (RegistryKey contains \"\\\\SOFTWARE\" and RegistryKey contains \"\\\\Microsoft\\\\Office\" and RegistryKey contains \"\\\\Common\\\\Security\") and RegistryKey endswith \"\\\\MacroRuntimeScanScope\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects tampering with the MacroRuntimeScanScope registry key to disable runtime scanning of enabled macros"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
