{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Disable_Windows_Defender_AV_Security_Monitoring')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Disable Windows Defender AV Security Monitoring",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and (ProcessCommandLine contains \"-DisableBehaviorMonitoring $true\" or ProcessCommandLine contains \"-DisableRuntimeMonitoring $true\")) or ((FolderPath endswith \"\\\\sc.exe\" or ProcessVersionInfoOriginalFileName =~ \"sc.exe\") and ((ProcessCommandLine contains \"delete\" and ProcessCommandLine contains \"WinDefend\") or (ProcessCommandLine contains \"config\" and ProcessCommandLine contains \"WinDefend\" and ProcessCommandLine contains \"start=disabled\") or (ProcessCommandLine contains \"stop\" and ProcessCommandLine contains \"WinDefend\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects attackers attempting to disable Windows Defender using Powershe"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
