{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Disabled_IE_Security_Features')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Disabled IE Security Features",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -name IEHarden \" and ProcessCommandLine contains \" -value 0 \") or (ProcessCommandLine contains \" -name DEPOff \" and ProcessCommandLine contains \" -value 1 \") or (ProcessCommandLine contains \" -name DisableFirstRunCustomize \" and ProcessCommandLine contains \" -value 2 \")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects command lines that indicate unwanted modifications to registry keys that disable important Internet Explorer security featur"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
