{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Disable_Privacy_Settings_Experience_in_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Disable Privacy Settings Experience in Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000000)\" and RegistryKey endswith \"\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE\\\\DisablePrivacyExperience\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects registry modifications that disable Privacy Settings Experience"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
