{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Diskshadow_Script_Mode_-_Uncommon_Script_Extension_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Diskshadow Script Mode - Uncommon Script Extension Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"-s \" or ProcessCommandLine contains \"/s \") and (ProcessVersionInfoOriginalFileName =~ \"diskshadow.exe\" or FolderPath endswith \"\\\\diskshadow.exe\")) and (not(ProcessCommandLine contains \".txt\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"Diskshadow.exe\" in script mode to execute an script with a potentially uncommon extension.\nInitial baselining of the allowed extension list is required.\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
