{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Diskshadow_Script_Mode_-_Execution_From_Potential_Suspicious_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Diskshadow Script Mode - Execution From Potential Suspicious Location",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-s \" or ProcessCommandLine contains \"/s \") and (ProcessVersionInfoOriginalFileName =~ \"diskshadow.exe\" or FolderPath endswith \"\\\\diskshadow.exe\") and (ProcessCommandLine contains \":\\\\Temp\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or ProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or ProcessCommandLine contains \"\\\\ProgramData\\\\\" or ProcessCommandLine contains \"\\\\Users\\\\Public\\\\\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"Diskshadow.exe\" in script mode using the \"/s\" flag where the script is located in a potentially suspicious locati"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
