{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Dism_Remove_Online_Package')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Dism Remove Online Package",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"/Online\" and ProcessCommandLine contains \"/Disable-Feature\") and FolderPath endswith \"\\\\Dism.exe\") or (FolderPath endswith \"\\\\DismHost.exe\" and (InitiatingProcessCommandLine contains \"/Online\" and InitiatingProcessCommandLine contains \"/Disable-Feature\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Deployment Image Servicing and Management tool. DISM is used to enumerate, install, uninstall, configure, and update features and packages in Windows ima"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
