{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/DLL_Loaded_via_CertOC.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "DLL Loaded via CertOC.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -LoadDLL \" or ProcessCommandLine contains \" /LoadDLL \") and (FolderPath endswith \"\\\\certoc.exe\" or ProcessVersionInfoOriginalFileName =~ \"CertOC.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects when a user installs certificates by using CertOC.exe to loads the target DLL fil"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
