{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/DLL_Execution_via_Rasautou.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "DLL Execution via Rasautou.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -d \" and ProcessCommandLine contains \" -p \") and (FolderPath endswith \"\\\\rasautou.exe\" or ProcessVersionInfoOriginalFileName =~ \"rasdlui.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects using Rasautou.exe for loading arbitrary .DLL specified in -d option and executes the export specified in -p."
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
