{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/DLL_Sideloading_Of_ShellChromeAPI.DLL')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "DLL Sideloading Of ShellChromeAPI.DLL",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\ShellChromeAPI.dll\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects processes loading the non-existent DLL \"ShellChromeAPI\". One known example is the \"DeviceEnroller\" binary in combination with the \"PhoneDeepLink\" flag tries to load this DLL.\nAdversaries can drop their own renamed DLL and execute it via DeviceEnr"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Persistence,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
