{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Dllhost.EXE_Initiated_Network_Connection_To_Non-Local_IP_Address')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Dllhost.EXE Initiated Network Connection To Non-Local IP Address",
        "category": "Hunting Queries",
        "query": "DeviceNetworkEvents\n| where InitiatingProcessFolderPath endswith \"\\\\dllhost.exe\" and (not(((ipv4_is_in_range(RemoteIP, \"::1/128\") or ipv4_is_in_range(RemoteIP, \"10.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"127.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"172.16.0.0/12\") or ipv4_is_in_range(RemoteIP, \"192.168.0.0/16\") or ipv4_is_in_range(RemoteIP, \"169.254.0.0/16\") or ipv4_is_in_range(RemoteIP, \"fc00::/7\") or ipv4_is_in_range(RemoteIP, \"fe80::/10\")) or (ipv4_is_in_range(RemoteIP, \"20.184.0.0/13\") or ipv4_is_in_range(RemoteIP, \"20.192.0.0/10\") or ipv4_is_in_range(RemoteIP, \"23.72.0.0/13\") or ipv4_is_in_range(RemoteIP, \"51.10.0.0/15\") or ipv4_is_in_range(RemoteIP, \"51.103.0.0/16\") or ipv4_is_in_range(RemoteIP, \"51.104.0.0/15\") or ipv4_is_in_range(RemoteIP, \"52.224.0.0/11\") or ipv4_is_in_range(RemoteIP, \"204.79.197.0/24\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects dllhost initiating a network connection to a non-local IP address.\nAside from Microsoft own IP range that needs to be excluded. Network communication from Dllhost will depend entirely on the hosted DLL.\nAn initial baseline is recomme"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218,T1559"
          }
        ]
      }
    }
  ]
}
