{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/DNS-over-HTTPS_Enabled_by_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "DNS-over-HTTPS Enabled by Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryValueData =~ \"secure\" and RegistryKey endswith \"\\\\SOFTWARE\\\\Google\\\\Chrome\\\\DnsOverHttpsMode\") or (RegistryValueData =~ \"DWORD (0x00000001)\" and RegistryKey endswith \"\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Edge\\\\BuiltInDnsClientEnabled\") or (RegistryValueData =~ \"DWORD (0x00000001)\" and RegistryKey endswith \"\\\\SOFTWARE\\\\Policies\\\\Mozilla\\\\Firefox\\\\DNSOverHTTPS\\\\Enabled\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects when a user enables DNS-over-HTTPS.\nThis can be used to hide internet activity or be used to hide the process of exfiltrating data.\nWith this enabled organization will lose visibility into data such as query type, response and originating IP that"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112,T1140"
          }
        ]
      }
    }
  ]
}
