{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Domain_Trust_Discovery_Via_Dsquery')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Domain Trust Discovery Via Dsquery",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"trustedDomain\" and (FolderPath endswith \"\\\\dsquery.exe\" or ProcessVersionInfoOriginalFileName =~ \"dsquery.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"dsquery.exe\" for domain trust discov"
          },
          {
            "name": "tactics",
            "value": "discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1482"
          }
        ]
      }
    }
  ]
}
