{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/DotNet_CLR_DLL_Loaded_By_Scripting_Applications')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "DotNet CLR DLL Loaded By Scripting Applications",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\clr.dll\" or FolderPath endswith \"\\\\mscoree.dll\" or FolderPath endswith \"\\\\mscorlib.dll\") and (InitiatingProcessFolderPath endswith \"\\\\cmstp.exe\" or InitiatingProcessFolderPath endswith \"\\\\cscript.exe\" or InitiatingProcessFolderPath endswith \"\\\\mshta.exe\" or InitiatingProcessFolderPath endswith \"\\\\msxsl.exe\" or InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\" or InitiatingProcessFolderPath endswith \"\\\\wmic.exe\" or InitiatingProcessFolderPath endswith \"\\\\wscript.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects .NET CLR DLLs being loaded by scripting applications such as wscript or cscript. This could be an indication of potential suspicious execution."
          },
          {
            "name": "tactics",
            "value": "Execution,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1055"
          }
        ]
      }
    }
  ]
}
