{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Dropping_Of_Password_Filter_DLL')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Dropping Of Password Filter DLL",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\Lsa\" and ProcessCommandLine contains \"scecli\\\\0\" and ProcessCommandLine contains \"reg add\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects dropping of dll files in system32 that may be used to retrieve user credentials from LS"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1556"
          }
        ]
      }
    }
  ]
}
