{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Dumping_of_Sensitive_Hives_Via_Reg.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Dumping of Sensitive Hives Via Reg.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" save \" or ProcessCommandLine contains \" export \" or ProcessCommandLine contains \" ˢave \" or ProcessCommandLine contains \" eˣport \") and (ProcessCommandLine contains \"\\\\system\" or ProcessCommandLine contains \"\\\\sam\" or ProcessCommandLine contains \"\\\\security\" or ProcessCommandLine contains \"\\\\ˢystem\" or ProcessCommandLine contains \"\\\\syˢtem\" or ProcessCommandLine contains \"\\\\ˢyˢtem\" or ProcessCommandLine contains \"\\\\ˢam\" or ProcessCommandLine contains \"\\\\ˢecurity\") and (ProcessCommandLine contains \"hklm\" or ProcessCommandLine contains \"hk˪m\" or ProcessCommandLine contains \"hkey_local_machine\" or ProcessCommandLine contains \"hkey_˪ocal_machine\" or ProcessCommandLine contains \"hkey_loca˪_machine\" or ProcessCommandLine contains \"hkey_˪oca˪_machine\") and (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the usage of \"reg.exe\" in order to dump sensitive registry hives. This includes SAM, SYSTEM and SECURITY hives."
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
