{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Email_Exifiltration_Via_Powershell')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Email Exifiltration Via Powershell",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Add-PSSnapin\" and ProcessCommandLine contains \"Get-Recipient\" and ProcessCommandLine contains \"-ExpandProperty\" and ProcessCommandLine contains \"EmailAddresses\" and ProcessCommandLine contains \"SmtpAddress\" and ProcessCommandLine contains \"-hidetableheaders\") and (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects email exfiltration via powershell cmdl"
          },
          {
            "name": "tactics",
            "value": "exfiltration"
          }
        ]
      }
    }
  ]
}
