{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Enable_Local_Manifest_Installation_With_Winget')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Enable Local Manifest Installation With Winget",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000001)\" and RegistryKey endswith \"\\\\AppInstaller\\\\EnableLocalManifestFiles\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to the AppInstaller (winget) policy. Specifically the activation of the local manifest installation, which allows a user to install new packages via custom manifests."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Persistence"
          }
        ]
      }
    }
  ]
}
