{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Enable_Microsoft_Dynamic_Data_Exchange')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Enable Microsoft Dynamic Data Exchange",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryValueData =~ \"DWORD (0x00000000)\" and (RegistryKey endswith \"\\\\Excel\\\\Security\\\\DisableDDEServerLaunch\" or RegistryKey endswith \"\\\\Excel\\\\Security\\\\DisableDDEServerLookup\")) or ((RegistryValueData in~ (\"DWORD (0x00000001)\", \"DWORD (0x00000002)\")) and RegistryKey endswith \"\\\\Word\\\\Security\\\\AllowDDE\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Enable Dynamic Data Exchange protocol (DDE) in all supported editions of Microsoft Word or Excel."
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1559"
          }
        ]
      }
    }
  ]
}
