{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Esentutl_Volume_Shadow_Copy_Service_Keys')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Esentutl Volume Shadow Copy Service Keys",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (InitiatingProcessFolderPath endswith \"esentutl.exe\" and RegistryKey contains \"System\\\\CurrentControlSet\\\\Services\\\\VSS\") and (not(RegistryKey contains \"System\\\\CurrentControlSet\\\\Services\\\\VSS\\\\Start\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the volume shadow copy service initialization and processing via esentutl. Registry keys such as HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\VSS\\\\Diag\\\\VolSnap\\\\Volume are captured."
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
