{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/ETW_Logging_Disabled_For_rpcrt4.dll')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "ETW Logging Disabled For rpcrt4.dll",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryValueData in~ (\"DWORD (0x00000000)\", \"DWORD (0x00000002)\")) and RegistryKey endswith \"\\\\Microsoft\\\\Windows NT\\\\Rpc\\\\ExtErrorInformation\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to the \"ExtErrorInformation\" key in order to disable ETW logging for rpcrt4.dll"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112,T1562"
          }
        ]
      }
    }
  ]
}
