{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/EVTX_Created_In_Uncommon_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "EVTX Created In Uncommon Location",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \".evtx\" and (not(((FolderPath endswith \"\\\\Windows\\\\System32\\\\winevt\\\\Logs\\\\\" and FolderPath startswith \"C:\\\\ProgramData\\\\Microsoft\\\\Windows\\\\Containers\\\\BaseImages\\\\\") or FolderPath startswith \"C:\\\\Windows\\\\System32\\\\winevt\\\\Logs\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of new files with the \".evtx\" extension in non-common or non-standard location.\nThis could indicate tampering with default EVTX locations in order to evade security controls or simply exfiltration of event log to search for sensitive"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
