{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Exchange_PowerShell_Cmdlet_History_Deleted')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Exchange PowerShell Cmdlet History Deleted",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath contains \"_Cmdlet_\" and FolderPath startswith \"\\\\Logging\\\\CmdletInfra\\\\LocalPowerShell\\\\Cmdlet\\\\\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the deletion of the Exchange PowerShell cmdlet History logs which may indicate an attempt to destroy forensic evidence"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1070"
          }
        ]
      }
    }
  ]
}
