{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Execution_from_Suspicious_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Execution from Suspicious Folder",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath contains \"\\\\$Recycle.bin\\\\\" or FolderPath contains \"\\\\config\\\\systemprofile\\\\\" or FolderPath contains \"\\\\Intel\\\\Logs\\\\\" or FolderPath contains \"\\\\RSA\\\\MachineKeys\\\\\" or FolderPath contains \"\\\\Users\\\\All Users\\\\\" or FolderPath contains \"\\\\Users\\\\Default\\\\\" or FolderPath contains \"\\\\Users\\\\NetworkService\\\\\" or FolderPath contains \"\\\\Users\\\\Public\\\\\" or FolderPath contains \"\\\\Windows\\\\addins\\\\\" or FolderPath contains \"\\\\Windows\\\\debug\\\\\" or FolderPath contains \"\\\\Windows\\\\Fonts\\\\\" or FolderPath contains \"\\\\Windows\\\\Help\\\\\" or FolderPath contains \"\\\\Windows\\\\IME\\\\\" or FolderPath contains \"\\\\Windows\\\\Media\\\\\" or FolderPath contains \"\\\\Windows\\\\repair\\\\\" or FolderPath contains \"\\\\Windows\\\\security\\\\\" or FolderPath contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\" or FolderPath contains \"\\\\Windows\\\\Tasks\\\\\") or FolderPath startswith \"C:\\\\Perflogs\\\\\") and (not(((FolderPath endswith \"\\\\CitrixReceiverUpdater.exe\" and FolderPath startswith \"C:\\\\Windows\\\\SysWOW64\\\\config\\\\systemprofile\\\\Citrix\\\\UpdaterBinaries\\\\\") or FolderPath startswith \"C:\\\\Users\\\\Public\\\\IBM\\\\ClientSolutions\\\\Start_Programs\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious execution from an uncommon fol"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
