{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Execute_Code_with_Pester.bat_as_Parent')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Execute Code with Pester.bat as Parent",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessCommandLine contains \"{ Invoke-Pester -EnableExit ;\" or InitiatingProcessCommandLine contains \"{ Get-Help \\\"\") and (InitiatingProcessCommandLine contains \"\\\\WindowsPowerShell\\\\Modules\\\\Pester\\\\\" and (InitiatingProcessFolderPath endswith \"\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \"\\\\pwsh.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects code execution via Pester.bat (Pester - Powershell Modulte for testi"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1216"
          }
        ]
      }
    }
  ]
}
