{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Execution_Of_Non-Existing_File')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Execution Of Non-Existing File",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (not(FolderPath contains \"\\\\\")) and (not((((FolderPath in~ (\"System\", \"Registry\", \"MemCompression\", \"vmmem\")) or (ProcessCommandLine in~ (\"Registry\", \"MemCompression\", \"vmmem\"))) or (FolderPath in~ (\"-\", \"\")) or isnull(FolderPath))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Checks whether the image specified in a process creation event is not a full, absolute path (caused by process ghosting or other unorthodox methods to start a process)"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
