{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Execute_Files_with_Msdeploy.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Execute Files with Msdeploy.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"verb:sync\" and ProcessCommandLine contains \"-source:RunCommand\" and ProcessCommandLine contains \"-dest:runCommand\") and FolderPath endswith \"\\\\msdeploy.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects file execution using the msdeploy.exe lolbin"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
