{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Execution_via_WorkFolders.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Execution via WorkFolders.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\control.exe\" and InitiatingProcessFolderPath endswith \"\\\\WorkFolders.exe\") and (not(FolderPath =~ \"C:\\\\Windows\\\\System32\\\\control.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects using WorkFolders.exe to execute an arbitrary control."
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
