{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Execution_of_Suspicious_File_Type_Extension')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Execution of Suspicious File Type Extension",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (not((FolderPath endswith \".bin\" or FolderPath endswith \".cgi\" or FolderPath endswith \".com\" or FolderPath endswith \".exe\" or FolderPath endswith \".scr\" or FolderPath endswith \".tmp\"))) and (not((FolderPath contains \":\\\\$Extend\\\\$Deleted\\\\\" or FolderPath contains \":\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\\" or (FolderPath in~ (\"-\", \"\")) or (FolderPath in~ (\"System\", \"Registry\", \"MemCompression\", \"vmmem\")) or FolderPath contains \":\\\\Windows\\\\Installer\\\\MSI\" or (FolderPath contains \":\\\\Config.Msi\\\\\" and (FolderPath endswith \".rbf\" or FolderPath endswith \".rbs\")) or isnull(FolderPath) or (InitiatingProcessFolderPath contains \":\\\\Windows\\\\Temp\\\\\" or FolderPath contains \":\\\\Windows\\\\Temp\\\\\")))) and (not((InitiatingProcessFolderPath contains \":\\\\ProgramData\\\\Avira\\\\\" or (FolderPath endswith \"com.docker.service\" and InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\services.exe\") or FolderPath contains \":\\\\Program Files\\\\Mozilla Firefox\\\\\" or FolderPath endswith \"\\\\LZMA_EXE\" or (FolderPath endswith \":\\\\Program Files (x86)\\\\MyQ\\\\Server\\\\pcltool.dll\" or FolderPath endswith \":\\\\Program Files\\\\MyQ\\\\Server\\\\pcltool.dll\") or (FolderPath contains \"NVIDIA\\\\NvBackend\\\\\" and FolderPath endswith \".dat\") or ((FolderPath contains \":\\\\Program Files (x86)\\\\WINPAKPRO\\\\\" or FolderPath contains \":\\\\Program Files\\\\WINPAKPRO\\\\\") and FolderPath endswith \".ngn\") or (FolderPath contains \"\\\\AppData\\\\Local\\\\Packages\\\\\" and FolderPath contains \"\\\\LocalState\\\\rootfs\\\\\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects whether the image specified in a process creation event doesn't refer to an \".exe\" (or other known executable extension) file. This can be caused by process ghosting or other unorthodox methods to start a process.\nThis rule might re"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
