{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Execute_MSDT_Via_Answer_File')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Execute MSDT Via Answer File",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -af \" or ProcessCommandLine contains \" /af \") and (ProcessCommandLine contains \"\\\\WINDOWS\\\\diagnostics\\\\index\\\\PCWDiagnostic.xml\" and FolderPath endswith \"\\\\msdt.exe\")) and (not(InitiatingProcessFolderPath endswith \"\\\\pcwrun.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"msdt.exe\" using an answer file which is simulating the legitimate way of calling msdt via \"pcwrun.exe\" (For example from the compatibility t"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
