{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Execute_From_Alternate_Data_Streams')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Execute From Alternate Data Streams",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"txt:\" and ((ProcessCommandLine contains \"esentutl \" and ProcessCommandLine contains \" /y \" and ProcessCommandLine contains \" /d \" and ProcessCommandLine contains \" /o \") or (ProcessCommandLine contains \"makecab \" and ProcessCommandLine contains \".cab\") or (ProcessCommandLine contains \"reg \" and ProcessCommandLine contains \" export \") or (ProcessCommandLine contains \"regedit \" and ProcessCommandLine contains \" /E \") or (ProcessCommandLine contains \"type \" and ProcessCommandLine contains \" > \"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution from an Alternate Data Stream (ADS). Adversaries may use NTFS file attributes to hide their malicious data in order to evade detect"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
