{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Fax_Service_DLL_Search_Order_Hijack')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Fax Service DLL Search Order Hijack",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"ualapi.dll\" and InitiatingProcessFolderPath endswith \"\\\\fxssvc.exe\") and (not(FolderPath startswith \"C:\\\\Windows\\\\WinSxS\\\\\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "The Fax service attempts to load ualapi.dll, which is non-existent. An attacker can then (side)load their own malicious DLL using this service."
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
