{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/File_Download_Using_Notepad++_GUP_Utility')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "File Download Using Notepad++ GUP Utility",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -unzipTo \" and ProcessCommandLine contains \"http\") and (FolderPath endswith \"\\\\GUP.exe\" or ProcessVersionInfoOriginalFileName =~ \"gup.exe\")) and (not(InitiatingProcessFolderPath endswith \"\\\\notepad++.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of the Notepad++ updater (gup) from a process other than Notepad++ to download fil"
          },
          {
            "name": "tactics",
            "value": "CommandAndControl"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105"
          }
        ]
      }
    }
  ]
}
