{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/File_Download_Via_Windows_Defender_MpCmpRun.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "File Download Via Windows Defender MpCmpRun.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"DownloadFile\" and ProcessCommandLine contains \"url\") and (ProcessVersionInfoOriginalFileName =~ \"MpCmdRun.exe\" or FolderPath endswith \"\\\\MpCmdRun.exe\" or ProcessCommandLine contains \"MpCmdRun.exe\" or ProcessVersionInfoFileDescription =~ \"Microsoft Malware Protection Command Line Utility\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of Windows Defender MpCmdRun.EXE to download files"
          },
          {
            "name": "tactics",
            "value": "Command And Control,Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105,T1218"
          }
        ]
      }
    }
  ]
}
