{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/File_Download_From_IP_Based_URL_Via_CertOC.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "File Download From IP Based URL Via CertOC.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"-GetCACAPS\" and (FolderPath endswith \"\\\\certoc.exe\" or ProcessVersionInfoOriginalFileName =~ \"CertOC.exe\") and ProcessCommandLine matches regex \"://[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects when a user downloads a file from an IP based URL using CertOC.e"
          },
          {
            "name": "tactics",
            "value": "command_and_control,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105"
          }
        ]
      }
    }
  ]
}
