{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Filter_Driver_Unloaded_Via_Fltmc.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Filter Driver Unloaded Via Fltmc.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"unload\" and (FolderPath endswith \"\\\\fltMC.exe\" or ProcessVersionInfoOriginalFileName =~ \"fltMC.exe\")) and (not(ProcessCommandLine endswith \"unload rtp_filesystem_filter\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect filter driver unloading activity via fltmc."
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1070,T1562"
          }
        ]
      }
    }
  ]
}
