{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Firewall_Rule_Deleted_Via_Netsh.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Firewall Rule Deleted Via Netsh.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"firewall\" and ProcessCommandLine contains \"delete \") and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")) and (not((ProcessCommandLine contains \"name=Dropbox\" and InitiatingProcessFolderPath endswith \"\\\\Dropbox.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the removal of a port or application rule in the Windows Firewall configuration using ne"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
