{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Firewall_Configuration_Discovery_Via_Netsh.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Firewall Configuration Discovery Via Netsh.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"config \" or ProcessCommandLine contains \"state \" or ProcessCommandLine contains \"rule \" or ProcessCommandLine contains \"name=all\") and (ProcessCommandLine contains \"netsh \" and ProcessCommandLine contains \"show \" and ProcessCommandLine contains \"firewall \")) and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems"
          },
          {
            "name": "tactics",
            "value": "Discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1016"
          }
        ]
      }
    }
  ]
}
