{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Firewall_Disabled_via_Netsh.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Firewall Disabled via Netsh.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\") and ((ProcessCommandLine contains \"firewall\" and ProcessCommandLine contains \"set\" and ProcessCommandLine contains \"opmode\" and ProcessCommandLine contains \"disable\") or (ProcessCommandLine contains \"advfirewall\" and ProcessCommandLine contains \"set\" and ProcessCommandLine contains \"state\" and ProcessCommandLine contains \"off\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects netsh commands that turns off the Windows firew"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,S0108"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
