{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Folder_Compress_To_Potentially_Suspicious_Output_Via_Compress-Archive_Cmdlet')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Folder Compress To Potentially Suspicious Output Via Compress-Archive Cmdlet",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Compress-Archive -Path\" and ProcessCommandLine contains \"-DestinationPath $env:TEMP\") or (ProcessCommandLine contains \"Compress-Archive -Path\" and ProcessCommandLine contains \"-DestinationPath\" and ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\") or (ProcessCommandLine contains \"Compress-Archive -Path\" and ProcessCommandLine contains \"-DestinationPath\" and ProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects PowerShell scripts that make use of the \"Compress-Archive\" Cmdlet in order to compress folders and files where the output is stored in a potentially suspicious location that is used often by malware for exfiltration.\nAn adversary mi"
          },
          {
            "name": "tactics",
            "value": "Collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1074"
          }
        ]
      }
    }
  ]
}
