{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Forfiles.EXE_Child_Process_Masquerading')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Forfiles.EXE Child Process Masquerading",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine startswith \"/c echo \\\"\" and FolderPath endswith \"\\\\cmd.exe\" and (InitiatingProcessCommandLine endswith \".exe\" or InitiatingProcessCommandLine endswith \".exe\\\"\")) and (not(((FolderPath contains \":\\\\Windows\\\\System32\\\\\" or FolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\") and FolderPath endswith \"\\\\cmd.exe\" and (InitiatingProcessFolderPath contains \":\\\\Windows\\\\System32\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\") and InitiatingProcessFolderPath endswith \"\\\\forfiles.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of \"forfiles\" from a non-default location, in order to potentially spawn a custom \"cmd.exe\" from the current working director"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
