{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/GatherNetworkInfo.VBS_Reconnaissance_Script_Output')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "GatherNetworkInfo.VBS Reconnaissance Script Output",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath endswith \"\\\\Hotfixinfo.txt\" or FolderPath endswith \"\\\\netiostate.txt\" or FolderPath endswith \"\\\\sysportslog.txt\" or FolderPath endswith \"\\\\VmSwitchLog.evtx\") and FolderPath startswith \"C:\\\\Windows\\\\System32\\\\config\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects creation of files which are the results of executing the built-in reconnaissance script \"C:\\Windows\\System32\\gatherNetworkInfo.vbs\"."
          },
          {
            "name": "tactics",
            "value": "Discovery"
          }
        ]
      }
    }
  ]
}
