{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Gpresult_Display_Group_Policy_Information')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Gpresult Display Group Policy Information",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/z\" or ProcessCommandLine contains \"/v\") and FolderPath endswith \"\\\\gpresult.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects cases in which a user uses the built-in Windows utility gpresult to display the Resultant Set of Policy (RSoP) informat"
          },
          {
            "name": "tactics",
            "value": "discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1615"
          }
        ]
      }
    }
  ]
}
