{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Gpscript_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Gpscript Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" /logon\" or ProcessCommandLine contains \" /startup\") and (FolderPath endswith \"\\\\gpscript.exe\" or ProcessVersionInfoOriginalFileName =~ \"GPSCRIPT.EXE\")) and (not(InitiatingProcessCommandLine =~ \"C:\\\\windows\\\\system32\\\\svchost.exe -k netsvcs -p -s gpsvc\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the execution of the LOLBIN gpscript, which executes logon or startup scripts configured in Group Poli"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
