{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_Hashcat_Password_Cracker_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - Hashcat Password Cracker Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-a \" and ProcessCommandLine contains \"-m 1000 \" and ProcessCommandLine contains \"-r \") or FolderPath endswith \"\\\\hashcat.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Execute Hashcat.exe with provided SAM file from registry of Windows and Password list to crack against"
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1110"
          }
        ]
      }
    }
  ]
}
