{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_Stracciatella_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - Stracciatella Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\Stracciatella.exe\" or ProcessVersionInfoOriginalFileName =~ \"Stracciatella.exe\" or ProcessVersionInfoFileDescription =~ \"Stracciatella\" or (SHA256 startswith \"9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\" or SHA256 startswith \"fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\") or (SHA256 in~ (\"9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\", \"fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects Stracciatella which executes a Powershell runspace from within C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled based on PE metadata characteristi"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1562"
          }
        ]
      }
    }
  ]
}
