{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_Empire_PowerShell_UAC_Bypass')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - Empire PowerShell UAC Bypass",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" -NoP -NonI -w Hidden -c $x=$((gp HKCU:Software\\\\Microsoft\\\\Windows Update).Update)\" or ProcessCommandLine contains \" -NoP -NonI -c $x=$((gp HKCU:Software\\\\Microsoft\\\\Windows Update).Update);\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects some Empire PowerShell UAC bypass meth"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
