{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_SharpImpersonation_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - SharpImpersonation Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" user:\" and ProcessCommandLine contains \" binary:\") or (ProcessCommandLine contains \" user:\" and ProcessCommandLine contains \" shellcode:\") or (ProcessCommandLine contains \" technique:CreateProcessAsUserW\" or ProcessCommandLine contains \" technique:ImpersonateLoggedOnuser\")) or (FolderPath endswith \"\\\\SharpImpersonation.exe\" or ProcessVersionInfoOriginalFileName =~ \"SharpImpersonation.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects execution of the SharpImpersonation tool. Which can be used to manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactive"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,privilege_escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1134"
          }
        ]
      }
    }
  ]
}
