{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_Potential_Impacket_Lateral_Movement_Activity')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - Potential Impacket Lateral Movement Activity",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"cmd.exe\" and ProcessCommandLine contains \"/C\" and ProcessCommandLine contains \"Windows\\\\Temp\\\\\" and ProcessCommandLine contains \"&1\") and (InitiatingProcessCommandLine contains \"svchost.exe -k netsvcs\" or InitiatingProcessCommandLine contains \"taskeng.exe\")) or ((ProcessCommandLine contains \"cmd.exe\" and ProcessCommandLine contains \"/Q\" and ProcessCommandLine contains \"/c\" and ProcessCommandLine contains \"\\\\\\\\127.0.0.1\\\\\" and ProcessCommandLine contains \"&1\") and (InitiatingProcessFolderPath endswith \"\\\\wmiprvse.exe\" or InitiatingProcessFolderPath endswith \"\\\\mmc.exe\" or InitiatingProcessFolderPath endswith \"\\\\explorer.exe\" or InitiatingProcessFolderPath endswith \"\\\\services.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects wmiexec/dcomexec/atexec/smbexec from Impacket framew"
          },
          {
            "name": "tactics",
            "value": "execution,lateral_movement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1021,T1047"
          }
        ]
      }
    }
  ]
}
