{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_SharpLdapWhoami_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - SharpLdapWhoami Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \" /method:ntlm\" or ProcessCommandLine endswith \" /method:kerb\" or ProcessCommandLine endswith \" /method:nego\" or ProcessCommandLine endswith \" /m:nego\" or ProcessCommandLine endswith \" /m:ntlm\" or ProcessCommandLine endswith \" /m:kerb\") or FolderPath endswith \"\\\\SharpLdapWhoami.exe\" or (ProcessVersionInfoOriginalFileName contains \"SharpLdapWhoami\" or ProcessVersionInfoProductName =~ \"SharpLdapWhoami\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects SharpLdapWhoami, a whoami alternative that queries the LDAP service on a domain control"
          },
          {
            "name": "tactics",
            "value": "Discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1033"
          }
        ]
      }
    }
  ]
}
