{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_winPEAS_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - winPEAS Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"https://github.com/carlospolop/PEASS-ng/releases/latest/download/\" or (ProcessCommandLine contains \" applicationsinfo\" or ProcessCommandLine contains \" browserinfo\" or ProcessCommandLine contains \" eventsinfo\" or ProcessCommandLine contains \" fileanalysis\" or ProcessCommandLine contains \" filesinfo\" or ProcessCommandLine contains \" processinfo\" or ProcessCommandLine contains \" servicesinfo\" or ProcessCommandLine contains \" windowscreds\") or (InitiatingProcessCommandLine endswith \" -linpeas\" or ProcessCommandLine endswith \" -linpeas\") or (ProcessVersionInfoOriginalFileName =~ \"winPEAS.exe\" or (FolderPath endswith \"\\\\winPEASany_ofs.exe\" or FolderPath endswith \"\\\\winPEASany.exe\" or FolderPath endswith \"\\\\winPEASx64_ofs.exe\" or FolderPath endswith \"\\\\winPEASx64.exe\" or FolderPath endswith \"\\\\winPEASx86_ofs.exe\" or FolderPath endswith \"\\\\winPEASx86.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "WinPEAS is a script that search for possible paths to escalate privileges on Windows hosts. The checks are explained on book.hacktricks."
          },
          {
            "name": "tactics",
            "value": "privilege_escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1046,T1082,T1087"
          }
        ]
      }
    }
  ]
}
