{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_PowerTool_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - PowerTool Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\PowerTool.exe\" or FolderPath endswith \"\\\\PowerTool64.exe\") or ProcessVersionInfoOriginalFileName =~ \"PowerTool.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the execution of the tool PowerTool which has the ability to kill a process, delete its process file, unload drivers, and delete the driver fil"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
