{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_KrbRelay_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - KrbRelay Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -spn \" and ProcessCommandLine contains \" -clsid \" and ProcessCommandLine contains \" -rbcd \") or (ProcessCommandLine contains \"shadowcred\" and ProcessCommandLine contains \"clsid\" and ProcessCommandLine contains \"spn\") or (ProcessCommandLine contains \"spn \" and ProcessCommandLine contains \"session \" and ProcessCommandLine contains \"clsid \") or (FolderPath endswith \"\\\\KrbRelay.exe\" or ProcessVersionInfoOriginalFileName =~ \"KrbRelay.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of KrbRelay, a Kerberos relaying t"
          },
          {
            "name": "tactics",
            "value": "credential_access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1558"
          }
        ]
      }
    }
  ]
}
