{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_F-Secure_C3_Load_by_Rundll32')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - F-Secure C3 Load by Rundll32",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"rundll32.exe\" and ProcessCommandLine contains \".dll\" and ProcessCommandLine contains \"StartNodeRelay\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "-Secure C3 produces DLLs with a default exported StartNodeRelay functio"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
