{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_Dumpert_Process_Dumper_Default_File')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - Dumpert Process Dumper Default File",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \"dumpert.dmp\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of the default dump file used by Outflank Dumpert tool. A process dumper, which dumps the lsass process memory"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
