{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HackTool_-_SharpUp_PrivEsc_Tool_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HackTool - SharpUp PrivEsc Tool Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\SharpUp.exe\" or ProcessVersionInfoFileDescription =~ \"SharpUp\" or (ProcessCommandLine contains \"HijackablePaths\" or ProcessCommandLine contains \"UnquotedServicePath\" or ProcessCommandLine contains \"ProcessDLLHijack\" or ProcessCommandLine contains \"ModifiableServiceBinaries\" or ProcessCommandLine contains \"ModifiableScheduledTask\" or ProcessCommandLine contains \"DomainGPPPassword\" or ProcessCommandLine contains \"CachedGPPPassword\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of SharpUp, a tool for local privilege escalat"
          },
          {
            "name": "tactics",
            "value": "PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1569,T1574,T1615"
          }
        ]
      }
    }
  ]
}
