{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Harvesting_Of_Wifi_Credentials_Via_Netsh.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Harvesting Of Wifi Credentials Via Netsh.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"wlan\" and ProcessCommandLine contains \" s\" and ProcessCommandLine contains \" p\" and ProcessCommandLine contains \" k\" and ProcessCommandLine contains \"=clear\") and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect the harvesting of wifi credentials using netsh."
          },
          {
            "name": "tactics",
            "value": "credential_access,discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1040"
          }
        ]
      }
    }
  ]
}
