{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Hiding_User_Account_Via_SpecialAccounts_Registry_Key')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Hiding User Account Via SpecialAccounts Registry Key",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000000)\" and ActionType =~ \"RegistryValueSet\" and RegistryKey contains \"\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\\\\SpecialAccounts\\\\UserList\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects modifications to the registry key \"HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\Userlist\" where the value is set to \"0\" in order to hide user account from being listed on the logon screen."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
