{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Hiding_Files_with_Attrib.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Hiding Files with Attrib.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" +h \" and (FolderPath endswith \"\\\\attrib.exe\" or ProcessVersionInfoOriginalFileName =~ \"ATTRIB.EXE\")) and (not(ProcessCommandLine contains \"\\\\desktop.ini \")) and (not((ProcessCommandLine =~ \"+R +H +S +A \\\\*.cui\" and InitiatingProcessCommandLine =~ \"C:\\\\WINDOWS\\\\system32\\\\*.bat\" and InitiatingProcessFolderPath endswith \"\\\\cmd.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of attrib.exe to hide files from use"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
