{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/HTML_Help_HH.EXE_Suspicious_Child_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "HTML Help HH.EXE Suspicious Child Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\CertReq.exe\" or FolderPath endswith \"\\\\CertUtil.exe\" or FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\installutil.exe\" or FolderPath endswith \"\\\\MSbuild.exe\" or FolderPath endswith \"\\\\MSHTA.EXE\" or FolderPath endswith \"\\\\msiexec.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\wmic.exe\" or FolderPath endswith \"\\\\wscript.exe\") and InitiatingProcessFolderPath endswith \"\\\\hh.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious child process of a Microsoft HTML Help (HH.e"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution,InitialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1047,T1059,T1218,T1566"
          }
        ]
      }
    }
  ]
}
