{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/IE_ZoneMap_Setting_Downgraded_To_MyComputer_Zone_For_HTTP_Protocols')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "IE ZoneMap Setting Downgraded To MyComputer Zone For HTTP Protocols",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData contains \"DWORD (0x00000000)\" and RegistryKey contains \"\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet Settings\\\\ZoneMap\\\\ProtocolDefaults\" and (RegistryKey endswith \"\\\\http\" or RegistryKey endswith \"\\\\https\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to Internet Explorer's (IE / Windows Internet properties) ZoneMap configuration of the \"HTTP\" and \"HTTPS\" protocols to point to the \"My Computer\" zone. This allows downloaded files from the Internet to be granted the same level of trust a"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          }
        ]
      }
    }
  ]
}
