{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Import_LDAP_Data_Interchange_Format_File_Via_Ldifde.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Import LDAP Data Interchange Format File Via Ldifde.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-i\" and ProcessCommandLine contains \"-f\") and (FolderPath endswith \"\\\\ldifde.exe\" or ProcessVersionInfoOriginalFileName =~ \"ldifde.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of \"Ldifde.exe\" with the import flag \"-i\". The can be abused to include HTTP-based arguments which will allow the arbitrary download of files from a remote serve"
          },
          {
            "name": "tactics",
            "value": "Command And Control,Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105,T1218"
          }
        ]
      }
    }
  ]
}
