{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Imports_Registry_Key_From_an_ADS')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Imports Registry Key From an ADS",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (((ProcessCommandLine contains \" /i \" or ProcessCommandLine contains \".reg\") and ProcessCommandLine matches regex \":[^ \\\\\\\\]\") and (FolderPath endswith \"\\\\regedit.exe\" or ProcessVersionInfoOriginalFileName =~ \"REGEDIT.EXE\")) and (not((ProcessCommandLine contains \" -e \" or ProcessCommandLine contains \" /e \" or ProcessCommandLine contains \" -a \" or ProcessCommandLine contains \" /a \" or ProcessCommandLine contains \" -c \" or ProcessCommandLine contains \" /c \")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the import of a alternate datastream to the registry with regedit.e"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
