{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Imports_Registry_Key_From_a_File')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Imports Registry Key From a File",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" /i \" or ProcessCommandLine contains \" /s \" or ProcessCommandLine contains \".reg\") and (FolderPath endswith \"\\\\regedit.exe\" or ProcessVersionInfoOriginalFileName =~ \"REGEDIT.EXE\")) and (not(((ProcessCommandLine contains \" -e \" or ProcessCommandLine contains \" /e \" or ProcessCommandLine contains \" -a \" or ProcessCommandLine contains \" /a \" or ProcessCommandLine contains \" -c \" or ProcessCommandLine contains \" /c \") and ProcessCommandLine matches regex \":[^ \\\\\\\\]\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the import of the specified file to the registry with regedit.ex"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
