{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Insecure_Transfer_Via_Curl.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Insecure Transfer Via Curl.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine matches regex \"\\\\s-k\\\\s\" or ProcessCommandLine contains \"--insecure\") and (FolderPath endswith \"\\\\curl.exe\" or ProcessVersionInfoOriginalFileName =~ \"curl.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"curl.exe\" with the \"--insecure\" fl"
          },
          {
            "name": "tactics",
            "value": "Execution"
          }
        ]
      }
    }
  ]
}
