{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Insensitive_Subfolder_Search_Via_Findstr.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Insensitive Subfolder Search Via Findstr.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"findstr\" or FolderPath endswith \"findstr.exe\" or ProcessVersionInfoOriginalFileName =~ \"FINDSTR.EXE\") and ((ProcessCommandLine contains \" -i \" or ProcessCommandLine contains \" /i \") and (ProcessCommandLine contains \" -s \" or ProcessCommandLine contains \" /s \"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of findstr with the \"s\" and \"i\" flags for a \"subfolder\" and \"insensitive\" search respectively. Attackers sometimes leverage this built-in utility to search the system for interesting files or filter through results of commands.\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105,T1218,T1552,T1564"
          }
        ]
      }
    }
  ]
}
