{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Internet_Explorer_DisableFirstRunCustomize_Enabled')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Internet Explorer DisableFirstRunCustomize Enabled",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where ((RegistryValueData in~ (\"DWORD (0x00000001)\", \"DWORD (0x00000002)\")) and RegistryKey endswith \"\\\\Microsoft\\\\Internet Explorer\\\\Main\\\\DisableFirstRunCustomize\") and (not((InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\explorer.exe\", \"C:\\\\Windows\\\\System32\\\\ie4uinit.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to the Internet Explorer \"DisableFirstRunCustomize\" value, which prevents Internet Explorer from running the first run wizard the first time a user starts the browser after installing Internet Explorer or Windows.\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          }
        ]
      }
    }
  ]
}
