{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Inveigh_Execution_Artefacts')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Inveigh Execution Artefacts",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \"\\\\Inveigh-Log.txt\" or FolderPath endswith \"\\\\Inveigh-Cleartext.txt\" or FolderPath endswith \"\\\\Inveigh-NTLMv1Users.txt\" or FolderPath endswith \"\\\\Inveigh-NTLMv2Users.txt\" or FolderPath endswith \"\\\\Inveigh-NTLMv1.txt\" or FolderPath endswith \"\\\\Inveigh-NTLMv2.txt\" or FolderPath endswith \"\\\\Inveigh-FormInput.txt\" or FolderPath endswith \"\\\\Inveigh.dll\" or FolderPath endswith \"\\\\Inveigh.exe\" or FolderPath endswith \"\\\\Inveigh.ps1\" or FolderPath endswith \"\\\\Inveigh-Relay.ps1\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the presence and execution of Inveigh via dropped artefacts"
          },
          {
            "name": "tactics",
            "value": "Command And Control"
          },
          {
            "name": "relevantTechniques",
            "value": "T1219"
          }
        ]
      }
    }
  ]
}
