{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Invoke-Obfuscation_VAR++_LAUNCHER_OBFUSCATION')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"{0}\" or ProcessCommandLine contains \"{1}\" or ProcessCommandLine contains \"{2}\" or ProcessCommandLine contains \"{3}\" or ProcessCommandLine contains \"{4}\" or ProcessCommandLine contains \"{5}\") and (ProcessCommandLine contains \"&&set\" and ProcessCommandLine contains \"cmd\" and ProcessCommandLine contains \"/c\" and ProcessCommandLine contains \"-f\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects Obfuscated Powershell via VAR++ LAUNC"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1027,T1059"
          }
        ]
      }
    }
  ]
}
