{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/ISO_File_Created_Within_Temp_Folders')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "ISO File Created Within Temp Folders",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where ((FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and FolderPath contains \".zip\\\\\") and FolderPath endswith \".iso\") or (FolderPath contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\INetCache\\\\Content.Outlook\\\\\" and FolderPath endswith \".iso\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of a ISO file in the Outlook temp folder or in the Appdata temp folder. Typical of Qakbot TTP from end-July 2022."
          },
          {
            "name": "tactics",
            "value": "InitialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1566"
          }
        ]
      }
    }
  ]
}
