{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Launch-VsDevShell.PS1_Proxy_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Launch-VsDevShell.PS1 Proxy Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"VsWherePath \" or ProcessCommandLine contains \"VsInstallationPath \") and ProcessCommandLine contains \"Launch-VsDevShell.ps1\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of the 'Launch-VsDevShell.ps1' Microsoft signed script to execute comman"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1216"
          }
        ]
      }
    }
  ]
}
