{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/LiveKD_Kernel_Memory_Dump_File_Created')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "LiveKD Kernel Memory Dump File Created",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath =~ \"C:\\\\Windows\\\\livekd.dmp\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of a file that has the same name as the default LiveKD kernel memory dump."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Privilege Escalation"
          }
        ]
      }
    }
  ]
}
