{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Load_Of_RstrtMgr.DLL_By_An_Uncommon_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Load Of RstrtMgr.DLL By An Uncommon Process",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\RstrtMgr.dll\" or InitiatingProcessVersionInfoOriginalFileName =~ \"RstrtMgr.dll\") and (not((InitiatingProcessFolderPath contains \":\\\\Windows\\\\Temp\\\\\" or (InitiatingProcessFolderPath contains \":\\\\$WINDOWS.~BT\\\\\" or InitiatingProcessFolderPath contains \":\\\\$WinREAgent\\\\\" or InitiatingProcessFolderPath contains \":\\\\Program Files (x86)\\\\\" or InitiatingProcessFolderPath contains \":\\\\Program Files\\\\\" or InitiatingProcessFolderPath contains \":\\\\ProgramData\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\explorer.exe\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SoftwareDistribution\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysNative\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\System32\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\" or InitiatingProcessFolderPath contains \":\\\\Windows\\\\WinSxS\\\\\" or InitiatingProcessFolderPath contains \":\\\\WUDownloadCache\\\\\") or ((InitiatingProcessFolderPath contains \":\\\\Users\\\\\" and InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\is-\" and InitiatingProcessFolderPath contains \".tmp\\\\\") and InitiatingProcessFolderPath endswith \".tmp\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the load of RstrtMgr DLL (Restart Manager) by an uncommon process.\nThis library has been used during ransomware campaigns to kill processes that would prevent file encryption by locking them (e.g. Conti ransomware, Cactus ransomware"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1486,T1562"
          }
        ]
      }
    }
  ]
}
