{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Logged-On_User_Password_Change_Via_Ksetup.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Logged-On User Password Change Via Ksetup.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" /ChangePassword \" and (FolderPath endswith \"\\\\ksetup.exe\" or ProcessVersionInfoOriginalFileName =~ \"ksetup.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects password change for the logged-on user's via \"ksetup.e"
          },
          {
            "name": "tactics",
            "value": "execution"
          }
        ]
      }
    }
  ]
}
