{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/LOL-Binary_Copied_From_System_Directory')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "LOL-Binary Copied From System Directory",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"copy \" and FolderPath endswith \"\\\\cmd.exe\") or ((FolderPath endswith \"\\\\robocopy.exe\" or FolderPath endswith \"\\\\xcopy.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"robocopy.exe\", \"XCOPY.EXE\"))) or ((ProcessCommandLine contains \"copy-item\" or ProcessCommandLine contains \" copy \" or ProcessCommandLine contains \"cpi \" or ProcessCommandLine contains \" cp \") and (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\"))) and ((ProcessCommandLine contains \"\\\\bitsadmin.exe\" or ProcessCommandLine contains \"\\\\calc.exe\" or ProcessCommandLine contains \"\\\\certutil.exe\" or ProcessCommandLine contains \"\\\\cmdl32.exe\" or ProcessCommandLine contains \"\\\\cscript.exe\" or ProcessCommandLine contains \"\\\\mshta.exe\" or ProcessCommandLine contains \"\\\\rundll32.exe\" or ProcessCommandLine contains \"\\\\wscript.exe\") and (ProcessCommandLine contains \"\\\\System32\" or ProcessCommandLine contains \"\\\\SysWOW64\" or ProcessCommandLine contains \"\\\\WinSxS\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious copy operation that tries to copy a known LOLBIN from system (System32, SysWOW64, WinSxS) directories to another on disk in order to bypass detections based on location"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
