{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Lolbin_Ssh.exe_Use_As_Proxy')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Lolbin Ssh.exe Use As Proxy",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\OpenSSH\\\\sshd.exe\" or ((ProcessCommandLine contains \"ProxyCommand=\" or (ProcessCommandLine contains \"PermitLocalCommand\" and ProcessCommandLine contains \"LocalCommand\")) and FolderPath endswith \"\\\\ssh.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect usage of the \"ssh.exe\" binary as a proxy to launch other progr"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1202"
          }
        ]
      }
    }
  ]
}
