{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/LSASS_Process_Memory_Dump_Files')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "LSASS Process Memory Dump Files",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath endswith \"\\\\lsass.dmp\" or FolderPath endswith \"\\\\lsass.zip\" or FolderPath endswith \"\\\\lsass.rar\" or FolderPath endswith \"\\\\Andrew.dmp\" or FolderPath endswith \"\\\\Coredump.dmp\" or FolderPath endswith \"\\\\NotLSASS.zip\" or FolderPath endswith \"\\\\PPLBlade.dmp\") or (FolderPath contains \"\\\\lsass_2\" or FolderPath contains \"\\\\lsassdump\" or FolderPath contains \"\\\\lsassdmp\") or (FolderPath contains \"\\\\lsass\" and FolderPath contains \".dmp\") or (FolderPath contains \"SQLDmpr\" and FolderPath endswith \".mdmp\") or (FolderPath endswith \".dmp\" and FolderPath startswith \"nanodump\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects creation of files with names used by different memory dumping tools to create a memory dump of the LSASS process memory, which contains user credentials."
          },
          {
            "name": "tactics",
            "value": "CredentialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
