{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Microsoft_Sync_Center_Suspicious_Network_Connections')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Microsoft Sync Center Suspicious Network Connections",
        "category": "Hunting Queries",
        "query": "DeviceNetworkEvents\n| where InitiatingProcessFolderPath endswith \"\\\\mobsync.exe\" and (not((ipv4_is_in_range(RemoteIP, \"127.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"10.0.0.0/8\") or ipv4_is_in_range(RemoteIP, \"172.16.0.0/12\") or ipv4_is_in_range(RemoteIP, \"192.168.0.0/16\") or ipv4_is_in_range(RemoteIP, \"169.254.0.0/16\") or ipv4_is_in_range(RemoteIP, \"::1/128\") or ipv4_is_in_range(RemoteIP, \"fe80::/10\") or ipv4_is_in_range(RemoteIP, \"fc00::/7\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious connections from Microsoft Sync Center to non-private I"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1055,T1218"
          }
        ]
      }
    }
  ]
}
