{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Microsoft_Workflow_Compiler_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Microsoft Workflow Compiler Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\Microsoft.Workflow.Compiler.exe\" or ProcessVersionInfoOriginalFileName =~ \"Microsoft.Workflow.Compiler.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects invocation of Microsoft Workflow Compiler, which may permit the execution of arbitrary unsigned cod"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1127,T1218"
          }
        ]
      }
    }
  ]
}
