{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Modification_of_IE_Registry_Settings')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Modification of IE Registry Settings",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey contains \"\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet Settings\" and (not((RegistryKey contains \"\\\\Accepted Documents\" or RegistryValueData =~ \"Binary Data\" or RegistryValueData startswith \"DWORD\" or (RegistryValueData in~ (\"Cookie:\", \"Visited:\", \"(Empty)\")) or (RegistryKey contains \"\\\\Cache\" or RegistryKey contains \"\\\\ZoneMap\" or RegistryKey contains \"\\\\WpadDecision\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects modification of the registry settings used for Internet Explorer and other Windows components that use these settings. An attacker can abuse this registry key to add a domain to the trusted sites Zone or insert javascript for persistence"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
