{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MSHTA_Suspicious_Execution_01')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MSHTA Suspicious Execution 01",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"vbscript\" or ProcessCommandLine contains \".jpg\" or ProcessCommandLine contains \".png\" or ProcessCommandLine contains \".lnk\" or ProcessCommandLine contains \".xls\" or ProcessCommandLine contains \".doc\" or ProcessCommandLine contains \".zip\" or ProcessCommandLine contains \".dll\") and FolderPath endswith \"\\\\mshta.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detection for mshta.exe suspicious execution patterns sometimes involving file polyglotism"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1140,T1218"
          }
        ]
      }
    }
  ]
}
