{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Mshtml.DLL_RunHTMLApplication_Suspicious_Usage')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Mshtml.DLL RunHTMLApplication Suspicious Usage",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"#135\" or ProcessCommandLine contains \"RunHTMLApplication\") and (ProcessCommandLine contains \"\\\\..\\\\\" and ProcessCommandLine contains \"mshtml\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of commands that leverage the \"mshtml.dll\" RunHTMLApplication export to run arbitrary code via different protocol handlers (vbscript, javascript, file, http.."
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          }
        ]
      }
    }
  ]
}
