{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MsiExec_Web_Install')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MsiExec Web Install",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" msiexec\" and ProcessCommandLine contains \"://\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects suspicious msiexec process starts with web addresses as paramet"
          },
          {
            "name": "tactics",
            "value": "command_and_control,defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105,T1218"
          }
        ]
      }
    }
  ]
}
