{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Network_Connection_Initiated_To_Cloudflared_Tunnels_Domains')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Network Connection Initiated To Cloudflared Tunnels Domains",
        "category": "Hunting Queries",
        "query": "DeviceNetworkEvents\n| where RemoteUrl endswith \".v2.argotunnel.com\" or RemoteUrl endswith \"protocol-v2.argotunnel.com\" or RemoteUrl endswith \"trycloudflare.com\" or RemoteUrl endswith \"update.argotunnel.com\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects network connections to Cloudflared tunnels domains initiated by a process on the system.\nAttackers can abuse that feature to establish a reverse shell or persistence on a machin"
          },
          {
            "name": "tactics",
            "value": "Command And Control,Exfiltration"
          },
          {
            "name": "relevantTechniques",
            "value": "T1567"
          }
        ]
      }
    }
  ]
}
