{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Network_Connection_Initiated_By_Eqnedt32.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Network Connection Initiated By Eqnedt32.EXE",
        "category": "Hunting Queries",
        "query": "DeviceNetworkEvents\n| where InitiatingProcessFolderPath endswith \"\\\\eqnedt32.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects network connections from the Equation Editor process \"eqnedt32.ex"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1203"
          }
        ]
      }
    }
  ]
}
