{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Network_Connection_Initiated_To_Mega.nz')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Network Connection Initiated To Mega.nz",
        "category": "Hunting Queries",
        "query": "DeviceNetworkEvents\n| where RemoteUrl endswith \"mega.co.nz\" or RemoteUrl endswith \"mega.nz\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a network connection initiated by a binary to \"api.mega.co.nz\".\nAttackers were seen abusing file sharing websites similar to \"mega.nz\" in order to upload/download additional payloads"
          },
          {
            "name": "tactics",
            "value": "exfiltration"
          },
          {
            "name": "relevantTechniques",
            "value": "T1567"
          }
        ]
      }
    }
  ]
}
