{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_Netsh_Helper_DLL_Registered_From_A_Suspicious_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New Netsh Helper DLL Registered From A Suspicious Location",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey contains \"\\\\SOFTWARE\\\\Microsoft\\\\NetSh\" and ((RegistryValueData contains \":\\\\Perflogs\\\\\" or RegistryValueData contains \":\\\\Users\\\\Public\\\\\" or RegistryValueData contains \":\\\\Windows\\\\Temp\\\\\" or RegistryValueData contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or RegistryValueData contains \"\\\\Temporary Internet\") or ((RegistryValueData contains \":\\\\Users\\\\\" and RegistryValueData contains \"\\\\Favorites\\\\\") or (RegistryValueData contains \":\\\\Users\\\\\" and RegistryValueData contains \"\\\\Favourites\\\\\") or (RegistryValueData contains \":\\\\Users\\\\\" and RegistryValueData contains \"\\\\Contacts\\\\\") or (RegistryValueData contains \":\\\\Users\\\\\" and RegistryValueData contains \"\\\\Pictures\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to the Netsh registry key to add a new DLL value that is located on a suspicious location. This change might be an indication of a potential persistence attempt by adding a malicious Netsh helper\n"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1546"
          }
        ]
      }
    }
  ]
}
