{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_Firewall_Rule_Added_Via_Netsh.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New Firewall Rule Added Via Netsh.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" firewall \" and ProcessCommandLine contains \" add \") and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")) and (not(((ProcessCommandLine contains \"advfirewall firewall add rule name=Dropbox dir=in action=allow \\\"program=\" and ProcessCommandLine contains \":\\\\Program Files (x86)\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\" enable=yes profile=Any\") or (ProcessCommandLine contains \"advfirewall firewall add rule name=Dropbox dir=in action=allow \\\"program=\" and ProcessCommandLine contains \":\\\\Program Files\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\" enable=yes profile=Any\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the addition of a new rule to the Windows firewall via ne"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,S0246"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
