{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_Generic_Credentials_Added_Via_Cmdkey.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New Generic Credentials Added Via Cmdkey.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -g\" or ProcessCommandLine contains \" /g\") and (ProcessCommandLine contains \" -p\" or ProcessCommandLine contains \" /p\") and (ProcessCommandLine contains \" -u\" or ProcessCommandLine contains \" /u\") and (FolderPath endswith \"\\\\cmdkey.exe\" or ProcessVersionInfoOriginalFileName =~ \"cmdkey.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of \"cmdkey.exe\" to add generic credentials.\nAs an example, this can be used before connecting to an RDP session via command line interfac"
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
