{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_Service_Creation_Using_PowerShell')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New Service Creation Using PowerShell",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"New-Service\" and ProcessCommandLine contains \"-BinaryPathName\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of a new service using powershell."
          },
          {
            "name": "tactics",
            "value": "Persistence,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1543"
          }
        ]
      }
    }
  ]
}
