{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_ODBC_Driver_Registered')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New ODBC Driver Registered",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey contains \"\\\\SOFTWARE\\\\ODBC\\\\ODBCINST.INI\" and RegistryKey endswith \"\\\\Driver\") and (not((RegistryValueData =~ \"%WINDIR%\\\\System32\\\\SQLSRV32.dll\" and RegistryKey contains \"\\\\SQL Server\"))) and (not(((RegistryValueData endswith \"\\\\ACEODBC.DLL\" and RegistryValueData startswith \"C:\\\\Progra\" and RegistryKey contains \"\\\\Microsoft Access \") or (RegistryValueData endswith \"\\\\ACEODBC.DLL\" and RegistryValueData startswith \"C:\\\\Progra\" and RegistryKey contains \"\\\\Microsoft Excel Driver\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the registration of a new ODBC driver."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          }
        ]
      }
    }
  ]
}
