{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_Remote_Desktop_Connection_Initiated_Via_Mstsc.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New Remote Desktop Connection Initiated Via Mstsc.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -v:\" or ProcessCommandLine contains \" /v:\") and (FolderPath endswith \"\\\\mstsc.exe\" or ProcessVersionInfoOriginalFileName =~ \"mstsc.exe\")) and (not((ProcessCommandLine contains \"C:\\\\ProgramData\\\\Microsoft\\\\WSL\\\\wslg.rdp\" and InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\lxss\\\\wslhost.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the usage of \"mstsc.exe\" with the \"/v\" flag to initiate a connection to a remote server.\nAdversaries may use valid accounts to log into a computer using the Remote Desktop Protocol (RDP). The adversary may then perform actions as the logged-on us"
          },
          {
            "name": "tactics",
            "value": "LateralMovement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1021"
          }
        ]
      }
    }
  ]
}
