{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_BgInfo.EXE_Custom_VBScript_Registry_Configuration')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New BgInfo.EXE Custom VBScript Registry Configuration",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData startswith \"4\" and ActionType =~ \"RegistryValueSet\" and RegistryKey contains \"\\\\Software\\\\Winternals\\\\BGInfo\\\\UserFields\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects setting of a new registry value related to BgInfo configuration, which can be abused to execute custom VBScript via \"BgInfo.exe\""
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
