{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_Kernel_Driver_Via_SC.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New Kernel Driver Via SC.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"create\" or ProcessCommandLine contains \"config\") and (ProcessCommandLine contains \"binPath\" and ProcessCommandLine contains \"type\" and ProcessCommandLine contains \"kernel\") and FolderPath endswith \"\\\\sc.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects creation of a new service (kernel driver) with the type \"kerne"
          },
          {
            "name": "tactics",
            "value": "persistence,privilege_escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1543"
          }
        ]
      }
    }
  ]
}
