{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/New_TimeProviders_Registered_With_Uncommon_DLL_Name')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "New TimeProviders Registered With Uncommon DLL Name",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey contains \"\\\\Services\\\\W32Time\\\\TimeProviders\" and RegistryKey endswith \"\\\\DllName\") and (not((RegistryValueData in~ (\"%SystemRoot%\\\\System32\\\\vmictimeprovider.dll\", \"%systemroot%\\\\system32\\\\w32time.dll\", \"C:\\\\Windows\\\\SYSTEM32\\\\w32time.DLL\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects processes setting a new DLL in DllName in under HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\W32Time\\TimeProvider.\nAdversaries may abuse time providers to execute DLLs when the system boots.\nThe Windows Time service (W32Time) enables time"
          },
          {
            "name": "tactics",
            "value": "Persistence,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
