{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Node_Process_Executions')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Node Process Executions",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\Adobe Creative Cloud Experience\\\\libs\\\\node.exe\" and (not(ProcessCommandLine contains \"Adobe Creative Cloud Experience\\\\js\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of other scripts using the Node executable packaged with Adobe Creative Cl"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1127"
          }
        ]
      }
    }
  ]
}
