{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/NPPSpy_Hacktool_Usage')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "NPPSpy Hacktool Usage",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \"\\\\NPPSpy.txt\" or FolderPath endswith \"\\\\NPPSpy.dll\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of NPPSpy hacktool that stores cleartext passwords of users that logged in to a local file"
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          }
        ]
      }
    }
  ]
}
