{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Nslookup_PowerShell_Download_Cradle_-_ProcessCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Nslookup PowerShell Download Cradle - ProcessCreation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -q=txt \" or ProcessCommandLine contains \" -querytype=txt \") and (InitiatingProcessFolderPath endswith \"\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \"\\\\pwsh.exe\")) and (FolderPath contains \"\\\\nslookup.exe\" or ProcessVersionInfoOriginalFileName =~ \"\\\\nslookup.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious powershell download cradle using nslookup. This cradle uses nslookup to extract payloads from DNS reco"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
