{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Office_Macro_File_Creation_From_Suspicious_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Office Macro File Creation From Suspicious Process",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where ((InitiatingProcessFolderPath endswith \"\\\\cscript.exe\" or InitiatingProcessFolderPath endswith \"\\\\mshta.exe\" or InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\" or InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" or InitiatingProcessFolderPath endswith \"\\\\wscript.exe\") or (InitiatingProcessParentFileName in~ (\"cscript.exe\", \"mshta.exe\", \"regsvr32.exe\", \"rundll32.exe\", \"wscript.exe\"))) and (FolderPath endswith \".docm\" or FolderPath endswith \".dotm\" or FolderPath endswith \".xlsm\" or FolderPath endswith \".xltm\" or FolderPath endswith \".potm\" or FolderPath endswith \".pptm\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of a office macro file from a a suspicious process"
          },
          {
            "name": "tactics",
            "value": "Initial Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1566"
          }
        ]
      }
    }
  ]
}
