{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/OilRig_APT_Registry_Persistence')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "OilRig APT Registry Persistence",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey endswith \"SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\UMe\" or RegistryKey endswith \"SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\UT\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects OilRig registry persistence as reported by Nyotron in their March 2018 report"
          },
          {
            "name": "tactics",
            "value": "Command And Control,Defense Evasion,G0049,Persistence,S0111"
          },
          {
            "name": "relevantTechniques",
            "value": "T1053,T1071,T1112,T1543"
          }
        ]
      }
    }
  ]
}
