{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Operator_Bloopers_Cobalt_Strike_Modules')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Operator Bloopers Cobalt Strike Modules",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Invoke-UserHunter\" or ProcessCommandLine contains \"Invoke-ShareFinder\" or ProcessCommandLine contains \"Invoke-Kerberoast\" or ProcessCommandLine contains \"Invoke-SMBAutoBrute\" or ProcessCommandLine contains \"Invoke-Nightmare\" or ProcessCommandLine contains \"zerologon\" or ProcessCommandLine contains \"av_query\") and (ProcessVersionInfoOriginalFileName =~ \"Cmd.Exe\" or FolderPath endswith \"\\\\cmd.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects Cobalt Strike module/commands accidentally entered in CMD sh"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
