{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Outlook_EnableUnsafeClientMailRules_Setting_Enabled_-_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Outlook EnableUnsafeClientMailRules Setting Enabled - Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000001)\" and RegistryKey endswith \"\\\\Outlook\\\\Security\\\\EnableUnsafeClientMailRules\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects an attacker trying to enable the outlook security setting \"EnableUnsafeClientMailRules\" which allows outlook to run applications or execute macros"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
