{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Parent_in_Public_Folder_Suspicious_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Parent in Public Folder Suspicious Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"powershell\" or ProcessCommandLine contains \"cmd.exe /c \" or ProcessCommandLine contains \"cmd.exe /r \" or ProcessCommandLine contains \"cmd.exe /k \" or ProcessCommandLine contains \"cmd /c \" or ProcessCommandLine contains \"cmd /r \" or ProcessCommandLine contains \"cmd /k \" or ProcessCommandLine contains \"wscript.exe\" or ProcessCommandLine contains \"cscript.exe\" or ProcessCommandLine contains \"bitsadmin\" or ProcessCommandLine contains \"certutil\" or ProcessCommandLine contains \"mshta.exe\") and InitiatingProcessFolderPath startswith \"C:\\\\Users\\\\Public\\\\\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "This rule detects suspicious processes with parent images located in the C:\\Users\\Public fol"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1564"
          }
        ]
      }
    }
  ]
}
