{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Password_Protected_Compressed_File_Extraction_Via_7Zip')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Password Protected Compressed File Extraction Via 7Zip",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessVersionInfoFileDescription contains \"7-Zip\" or (FolderPath endswith \"\\\\7z.exe\" or FolderPath endswith \"\\\\7zr.exe\" or FolderPath endswith \"\\\\7za.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"7z.exe\", \"7za.exe\"))) and (ProcessCommandLine contains \" -p\" and ProcessCommandLine contains \" x \" and ProcessCommandLine contains \" -o\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of 7zip utilities (7z.exe, 7za.exe and 7zr.exe) to extract password protected zip fil"
          },
          {
            "name": "tactics",
            "value": "Collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1560"
          }
        ]
      }
    }
  ]
}
