{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Suspicious_Registry_File_Imported_Via_Reg.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Suspicious Registry File Imported Via Reg.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" import \" and (FolderPath endswith \"\\\\reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\") and (ProcessCommandLine contains \"C:\\\\Users\\\\\" or ProcessCommandLine contains \"%temp%\" or ProcessCommandLine contains \"%tmp%\" or ProcessCommandLine contains \"%appdata%\" or ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or ProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\" or ProcessCommandLine contains \"C:\\\\ProgramData\\\\\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the import of '.reg' files from suspicious paths using the 'reg.exe' utility"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
