{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_DLL_Sideloading_Of_Libcurl.DLL_Via_GUP.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential DLL Sideloading Of Libcurl.DLL Via GUP.EXE",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\libcurl.dll\" and InitiatingProcessFolderPath endswith \"\\\\gup.exe\") and (not(InitiatingProcessFolderPath endswith \"\\\\Notepad++\\\\updater\\\\GUP.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential DLL sideloading of \"libcurl.dll\" by the \"gup.exe\" process from an uncommon locat"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Persistence,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
