{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_Visual_Studio_Tools_for_Office')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via Visual Studio Tools for Office",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey contains \"\\\\Software\\\\Microsoft\\\\Office\\\\Outlook\\\\Addins\" or RegistryKey contains \"\\\\Software\\\\Microsoft\\\\Office\\\\Word\\\\Addins\" or RegistryKey contains \"\\\\Software\\\\Microsoft\\\\Office\\\\Excel\\\\Addins\" or RegistryKey contains \"\\\\Software\\\\Microsoft\\\\Office\\\\Powerpoint\\\\Addins\" or RegistryKey contains \"\\\\Software\\\\Microsoft\\\\VSTO\\\\Security\\\\Inclusion\") and (not(((InitiatingProcessFolderPath =~ \"C:\\\\Program Files\\\\AVG\\\\Antivirus\\\\RegSvr.exe\" and RegistryKey contains \"\\\\Microsoft\\\\Office\\\\Outlook\\\\Addins\\\\Antivirus.AsOutExt\") or (InitiatingProcessFolderPath endswith \"\\\\msiexec.exe\" or InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\") or (InitiatingProcessFolderPath endswith \"\\\\excel.exe\" or InitiatingProcessFolderPath endswith \"\\\\integrator.exe\" or InitiatingProcessFolderPath endswith \"\\\\OfficeClickToRun.exe\" or InitiatingProcessFolderPath endswith \"\\\\winword.exe\" or InitiatingProcessFolderPath endswith \"\\\\visio.exe\") or InitiatingProcessFolderPath endswith \"\\\\Teams.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects persistence via Visual Studio Tools for Office (VSTO) add-ins in Office applications."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1137"
          }
        ]
      }
    }
  ]
}
