{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potentially_Suspicious_Usage_Of_Qemu')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potentially Suspicious Usage Of Qemu",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"-m 1M\" or ProcessCommandLine contains \"-m 2M\" or ProcessCommandLine contains \"-m 3M\") and (ProcessCommandLine contains \"restrict=off\" and ProcessCommandLine contains \"-netdev \" and ProcessCommandLine contains \"connect=\" and ProcessCommandLine contains \"-nographic\")) and (not((ProcessCommandLine contains \" -cdrom \" or ProcessCommandLine contains \" type=virt \" or ProcessCommandLine contains \" -blockdev \")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potentially suspicious execution of the Qemu utility in a Windows environment.\nThreat actors have leveraged this utility and this technique for achieving network access as reported by Kaspersk"
          },
          {
            "name": "tactics",
            "value": "Command And Control"
          },
          {
            "name": "relevantTechniques",
            "value": "T1090,T1572"
          }
        ]
      }
    }
  ]
}
