{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Binary_Proxy_Execution_Via_VSDiagnostics.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Binary Proxy Execution Via VSDiagnostics.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" /launch:\" or ProcessCommandLine contains \" -launch:\") and ProcessCommandLine contains \"start\" and (FolderPath endswith \"\\\\VSDiagnostics.exe\" or ProcessVersionInfoOriginalFileName =~ \"VSDiagnostics.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"VSDiagnostics.exe\" with the \"start\" command in order to launch and proxy arbitrary binaries."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
