{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Antivirus_Software_DLL_Sideloading')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Antivirus Software DLL Sideloading",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\log.dll\" and (not(((FolderPath startswith \"C:\\\\Program Files\\\\Bitdefender Antivirus Free\\\\\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\Bitdefender Antivirus Free\\\\\") or FolderPath startswith \"C:\\\\Program Files\\\\Canon\\\\MyPrinter\\\\\" or (InitiatingProcessFolderPath =~ \"C:\\\\Program Files\\\\Dell\\\\SARemediation\\\\audit\\\\TelemetryUtility.exe\" and (FolderPath in~ (\"C:\\\\Program Files\\\\Dell\\\\SARemediation\\\\plugin\\\\log.dll\", \"C:\\\\Program Files\\\\Dell\\\\SARemediation\\\\audit\\\\log.dll\"))))))) or (FolderPath endswith \"\\\\qrt.dll\" and (not((FolderPath startswith \"C:\\\\Program Files\\\\F-Secure\\\\Anti-Virus\\\\\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\F-Secure\\\\Anti-Virus\\\\\")))) or ((FolderPath endswith \"\\\\ashldres.dll\" or FolderPath endswith \"\\\\lockdown.dll\" or FolderPath endswith \"\\\\vsodscpl.dll\") and (not((FolderPath startswith \"C:\\\\Program Files\\\\McAfee\\\\\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\McAfee\\\\\")))) or (FolderPath endswith \"\\\\vftrace.dll\" and (not((FolderPath startswith \"C:\\\\Program Files\\\\CyberArk\\\\Endpoint Privilege Manager\\\\Agent\\\\x32\\\\\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\CyberArk\\\\Endpoint Privilege Manager\\\\Agent\\\\x32\\\\\")))) or (FolderPath endswith \"\\\\wsc.dll\" and (not((FolderPath startswith \"C:\\\\program Files\\\\AVAST Software\\\\Avast\\\\\" or FolderPath startswith \"C:\\\\program Files (x86)\\\\AVAST Software\\\\Avast\\\\\")))) or (FolderPath endswith \"\\\\tmdbglog.dll\" and (not((FolderPath startswith \"C:\\\\program Files\\\\Trend Micro\\\\Titanium\\\\\" or FolderPath startswith \"C:\\\\program Files (x86)\\\\Trend Micro\\\\Titanium\\\\\")))) or (FolderPath endswith \"\\\\DLPPREM32.dll\" and (not((FolderPath startswith \"C:\\\\program Files\\\\ESET\" or FolderPath startswith \"C:\\\\program Files (x86)\\\\ESET\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential DLL sideloading of DLLs that are part of antivirus software suchas McAfee, Symantec..."
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
