{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Winnti_Dropper_Activity')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Winnti Dropper Activity",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \"\\\\gthread-3.6.dll\" or FolderPath endswith \"\\\\sigcmm-2.4.dll\" or FolderPath endswith \"\\\\Windows\\\\Temp\\\\tmp.bat\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects files dropped by Winnti as described in RedMimicry Winnti playbook"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1027"
          }
        ]
      }
    }
  ]
}
