{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Adplus.EXE_Abuse')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Adplus.EXE Abuse",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -hang \" or ProcessCommandLine contains \" -pn \" or ProcessCommandLine contains \" -pmn \" or ProcessCommandLine contains \" -p \" or ProcessCommandLine contains \" -po \" or ProcessCommandLine contains \" -c \" or ProcessCommandLine contains \" -sc \") and (FolderPath endswith \"\\\\adplus.exe\" or ProcessVersionInfoOriginalFileName =~ \"Adplus.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"AdPlus.exe\", a binary that is part of the Windows SDK that can be used as a LOLBIN in order to dump process memory and execute arbitrary commands."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
