{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_Outlook_Form')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via Outlook Form",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where InitiatingProcessFolderPath endswith \"\\\\outlook.exe\" and (FolderPath contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\FORMS\\\\IPM\" or FolderPath contains \"\\\\Local Settings\\\\Application Data\\\\Microsoft\\\\Forms\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of a new Outlook form which can contain malicious code"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1137"
          }
        ]
      }
    }
  ]
}
