{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Binary_Or_Script_Dropper_Via_PowerShell')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Binary Or Script Dropper Via PowerShell",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where ((InitiatingProcessFolderPath endswith \"\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \"\\\\pwsh.exe\") and (FolderPath endswith \".bat\" or FolderPath endswith \".chm\" or FolderPath endswith \".cmd\" or FolderPath endswith \".com\" or FolderPath endswith \".dll\" or FolderPath endswith \".exe\" or FolderPath endswith \".hta\" or FolderPath endswith \".jar\" or FolderPath endswith \".js\" or FolderPath endswith \".ocx\" or FolderPath endswith \".scr\" or FolderPath endswith \".sys\" or FolderPath endswith \".vbe\" or FolderPath endswith \".vbs\" or FolderPath endswith \".wsf\")) and (not((((FolderPath endswith \".dll\" or FolderPath endswith \".exe\") and FolderPath startswith \"C:\\\\Windows\\\\Temp\\\\\") or (FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and (FolderPath endswith \".dll\" or FolderPath endswith \".exe\") and FolderPath startswith \"C:\\\\Users\\\\\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects PowerShell creating a binary executable or a script file."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          }
        ]
      }
    }
  ]
}
