{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Remote_Credential_Dumping_Activity')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Remote Credential Dumping Activity",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where InitiatingProcessFolderPath endswith \"\\\\svchost.exe\" and FolderPath matches regex \"\\\\\\\\Windows\\\\\\\\System32\\\\\\\\[a-zA-Z0-9]{8}\\\\.tmp$\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects default filenames output from the execution of CrackMapExec and Impacket-secretsdump against an endpoint."
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
