{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_CCleanerReactivator.DLL_Sideloading')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential CCleanerReactivator.DLL Sideloading",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\CCleanerReactivator.dll\" and (not((InitiatingProcessFolderPath endswith \"\\\\CCleanerReactivator.exe\" and (InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\CCleaner\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Program Files (x86)\\\\CCleaner\\\\\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential DLL sideloading of \"CCleanerReactivator.d"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
