{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Signing_Bypass_Via_Windows_Developer_Features_-_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Signing Bypass Via Windows Developer Features - Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000001)\" and (RegistryKey contains \"\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\AppModelUnlock\" or RegistryKey contains \"\\\\Policies\\\\Microsoft\\\\Windows\\\\Appx\") and (RegistryKey endswith \"\\\\AllowAllTrustedApps\" or RegistryKey endswith \"\\\\AllowDevelopmentWithoutDevLicense\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects when the enablement of developer features such as \"Developer Mode\" or \"Application Sideloading\". Which allows the user to install untrusted packages."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          }
        ]
      }
    }
  ]
}
