{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Process_Injection_Via_Msra.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Process Injection Via Msra.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\arp.exe\" or FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\netstat.exe\" or FolderPath endswith \"\\\\nslookup.exe\" or FolderPath endswith \"\\\\route.exe\" or FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\whoami.exe\") and InitiatingProcessCommandLine endswith \"msra.exe\" and InitiatingProcessFolderPath endswith \"\\\\msra.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential process injection via Microsoft Remote Asssistance (Msra.exe) by looking at suspicious child processes spawned from the aforementioned process. It has been a target used by many threat actors and used for discovery and per"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1055"
          }
        ]
      }
    }
  ]
}
