{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Application_Whitelisting_Bypass_via_Dnx.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Application Whitelisting Bypass via Dnx.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\dnx.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of Dnx.EXE. The Dnx utility allows for the execution of C# code.\nAttackers might abuse this in order to bypass application whitelisting.\n"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1027,T1218"
          }
        ]
      }
    }
  ]
}
