{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Unquoted_Service_Path_Reconnaissance_Via_Wmic.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Unquoted Service Path Reconnaissance Via Wmic.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" service get \" and ProcessCommandLine contains \"name,displayname,pathname,startmode\") and (ProcessVersionInfoOriginalFileName =~ \"wmic.exe\" or FolderPath endswith \"\\\\WMIC.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects known WMI recon method to look for unquoted service paths using wmic. Often used by pentester and attacker enumeration scripts"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1047"
          }
        ]
      }
    }
  ]
}
