{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potentially_Suspicious_Desktop_Background_Change_Via_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potentially Suspicious Desktop Background Change Via Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey contains \"Control Panel\\\\Desktop\" or RegistryKey contains \"CurrentVersion\\\\Policies\\\\ActiveDesktop\" or RegistryKey contains \"CurrentVersion\\\\Policies\\\\System\") and ((RegistryValueData =~ \"DWORD (0x00000001)\" and RegistryKey endswith \"NoChangingWallpaper\") or RegistryKey endswith \"\\\\Wallpaper\" or (RegistryValueData =~ \"2\" and RegistryKey endswith \"\\\\WallpaperStyle\")) and (not(InitiatingProcessFolderPath endswith \"\\\\svchost.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects registry value settings that would replace the user's desktop background.\nThis is a common technique used by malware to change the desktop background to a ransom note or other image.\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112,T1491"
          }
        ]
      }
    }
  ]
}
