{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_Notepad++_Plugins')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via Notepad++ Plugins",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath contains \"\\\\Notepad++\\\\plugins\\\\\" and FolderPath endswith \".dll\") and (not((InitiatingProcessFolderPath endswith \"\\\\Notepad++\\\\updater\\\\gup.exe\" or (InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and (InitiatingProcessFolderPath endswith \"\\\\target.exe\" or InitiatingProcessFolderPath endswith \"Installer.x64.exe\") and InitiatingProcessFolderPath startswith \"C:\\\\Users\\\\\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects creation of new \".dll\" files inside the plugins directory of a notepad++ installation by a process other than \"gup.exe\". Which could indicates possible persistence"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          }
        ]
      }
    }
  ]
}
