{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Chrome_Frame_Helper_DLL_Sideloading')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Chrome Frame Helper DLL Sideloading",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\chrome_frame_helper.dll\" and (not((FolderPath startswith \"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\\"))) and (not(FolderPath contains \"\\\\AppData\\\\local\\\\Google\\\\Chrome\\\\Application\\\\\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential DLL sideloading of \"chrome_frame_helper.dll\""
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Persistence,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
