{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Privilege_Escalation_To_LOCAL_SYSTEM')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Privilege Escalation To LOCAL SYSTEM",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -s cmd\" or ProcessCommandLine contains \" /s cmd\" or ProcessCommandLine contains \" -s -i cmd\" or ProcessCommandLine contains \" -s /i cmd\" or ProcessCommandLine contains \" /s -i cmd\" or ProcessCommandLine contains \" /s /i cmd\" or ProcessCommandLine contains \" -i -s cmd\" or ProcessCommandLine contains \" -i /s cmd\" or ProcessCommandLine contains \" /i -s cmd\" or ProcessCommandLine contains \" /i /s cmd\" or ProcessCommandLine contains \" -s pwsh\" or ProcessCommandLine contains \" /s pwsh\" or ProcessCommandLine contains \" -s -i pwsh\" or ProcessCommandLine contains \" -s /i pwsh\" or ProcessCommandLine contains \" /s -i pwsh\" or ProcessCommandLine contains \" /s /i pwsh\" or ProcessCommandLine contains \" -i -s pwsh\" or ProcessCommandLine contains \" -i /s pwsh\" or ProcessCommandLine contains \" /i -s pwsh\" or ProcessCommandLine contains \" /i /s pwsh\" or ProcessCommandLine contains \" -s powershell\" or ProcessCommandLine contains \" /s powershell\" or ProcessCommandLine contains \" -s -i powershell\" or ProcessCommandLine contains \" -s /i powershell\" or ProcessCommandLine contains \" /s -i powershell\" or ProcessCommandLine contains \" /s /i powershell\" or ProcessCommandLine contains \" -i -s powershell\" or ProcessCommandLine contains \" -i /s powershell\" or ProcessCommandLine contains \" /i -s powershell\" or ProcessCommandLine contains \" /i /s powershell\") and (not((ProcessCommandLine contains \"paexec\" or ProcessCommandLine contains \"PsExec\" or ProcessCommandLine contains \"accepteula\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects unknown program using commandline flags usually used by tools such as PsExec and PAExec to start programs with SYSTEM Privile"
          },
          {
            "name": "tactics",
            "value": "ResourceDevelopment"
          },
          {
            "name": "relevantTechniques",
            "value": "T1587"
          }
        ]
      }
    }
  ]
}
