{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Webshell_Creation_On_Static_Website')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Webshell Creation On Static Website",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (((FolderPath contains \".ashx\" or FolderPath contains \".asp\" or FolderPath contains \".ph\" or FolderPath contains \".soap\") and FolderPath contains \"\\\\inetpub\\\\wwwroot\\\\\") or (FolderPath contains \".ph\" and (FolderPath contains \"\\\\www\\\\\" or FolderPath contains \"\\\\htdocs\\\\\" or FolderPath contains \"\\\\html\\\\\"))) and (not((FolderPath contains \"\\\\xampp\" or InitiatingProcessFolderPath =~ \"System\" or (FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or FolderPath contains \"\\\\Windows\\\\Temp\\\\\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of files with certain extensions on a static web site. This can be indicative of potential uploads of a web shell."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1505"
          }
        ]
      }
    }
  ]
}
