{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_WMI_Lateral_Movement_WmiPrvSE_Spawned_PowerShell')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential WMI Lateral Movement WmiPrvSE Spawned PowerShell",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and InitiatingProcessFolderPath endswith \"\\\\WmiPrvSE.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects Powershell as a child of the WmiPrvSE process. Which could be a sign of lateral movement via WMI."
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1047,T1059"
          }
        ]
      }
    }
  ]
}
