{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Commandline_Obfuscation_Using_Unicode_Characters')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Commandline Obfuscation Using Unicode Characters",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"â\" or ProcessCommandLine contains \"€\" or ProcessCommandLine contains \"£\" or ProcessCommandLine contains \"¯\" or ProcessCommandLine contains \"®\" or ProcessCommandLine contains \"µ\" or ProcessCommandLine contains \"¶\") or (ProcessCommandLine contains \"ˣ\" or ProcessCommandLine contains \"˪\" or ProcessCommandLine contains \"ˢ\") or (ProcessCommandLine contains \"―\" or ProcessCommandLine contains \"—\") or (ProcessCommandLine contains \"∕\" or ProcessCommandLine contains \"⁄\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential commandline obfuscation using unicode characters.\nAdversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit.\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1027"
          }
        ]
      }
    }
  ]
}
