{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_PowerShell_Execution_Policy_Tampering_-_ProcCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential PowerShell Execution Policy Tampering - ProcCreation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"\\\\ShellIds\\\\Microsoft.PowerShell\\\\ExecutionPolicy\" or ProcessCommandLine contains \"\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ExecutionPolicy\") and (ProcessCommandLine contains \"Bypass\" or ProcessCommandLine contains \"RemoteSigned\" or ProcessCommandLine contains \"Unrestricted\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to the PowerShell execution policy registry key in order to bypass signing requirements for script execution from the CommandL"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
