{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_PowerShell_Downgrade_Attack')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential PowerShell Downgrade Attack",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -version 2 \" or ProcessCommandLine contains \" -versio 2 \" or ProcessCommandLine contains \" -versi 2 \" or ProcessCommandLine contains \" -vers 2 \" or ProcessCommandLine contains \" -ver 2 \" or ProcessCommandLine contains \" -ve 2 \" or ProcessCommandLine contains \" -v 2 \") and FolderPath endswith \"\\\\powershell.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects PowerShell downgrade attack by comparing the host versions with the actually used engine version 2.0"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
