{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Registry_Persistence_Attempt_Via_DbgManagedDebugger')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Registry Persistence Attempt Via DbgManagedDebugger",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey endswith \"\\\\Microsoft\\\\.NETFramework\\\\DbgManagedDebugger\" and (not(RegistryValueData =~ \"\\\"C:\\\\Windows\\\\system32\\\\vsjitdebugger.exe\\\" PID %d APPDOM %d EXTEXT \\\"%s\\\" EVTHDL %d\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the addition of the \"Debugger\" value to the \"DbgManagedDebugger\" key in order to achieve persistence. Which will get invoked when an application crashes"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
