{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_SAM_Database_Dump')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential SAM Database Dump",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath endswith \"\\\\Temp\\\\sam\" or FolderPath endswith \"\\\\sam.sav\" or FolderPath endswith \"\\\\Intel\\\\sam\" or FolderPath endswith \"\\\\sam.hive\" or FolderPath endswith \"\\\\Perflogs\\\\sam\" or FolderPath endswith \"\\\\ProgramData\\\\sam\" or FolderPath endswith \"\\\\Users\\\\Public\\\\sam\" or FolderPath endswith \"\\\\AppData\\\\Local\\\\sam\" or FolderPath endswith \"\\\\AppData\\\\Roaming\\\\sam\" or FolderPath endswith \"_ShadowSteal.zip\" or FolderPath endswith \"\\\\Documents\\\\SAM.export\" or FolderPath endswith \":\\\\sam\") or (FolderPath contains \"\\\\hive_sam_\" or FolderPath contains \"\\\\sam.save\" or FolderPath contains \"\\\\sam.export\" or FolderPath contains \"\\\\~reg_sam.save\" or FolderPath contains \"\\\\sam_backup\" or FolderPath contains \"\\\\sam.bck\" or FolderPath contains \"\\\\sam.backup\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of files that look like exports of the local SAM (Security Account Manager)"
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
