{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Attempt_Via_Run_Keys_Using_Reg.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Attempt Via Run Keys Using Reg.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"reg\" and ProcessCommandLine contains \" ADD \" and ProcessCommandLine contains \"Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious command line reg.exe tool adding key to RUN key in Regis"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
