{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Password_Spraying_Attempt_Using_Dsacls.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Password Spraying Attempt Using Dsacls.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/user:\" and ProcessCommandLine contains \"/passwd:\") and (FolderPath endswith \"\\\\dsacls.exe\" or ProcessVersionInfoOriginalFileName =~ \"DSACLS.EXE\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects possible password spraying attempts using Dsacls"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
