{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Signing_Bypass_Via_Windows_Developer_Features')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Signing Bypass Via Windows Developer Features",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"TurnOnDeveloperFeatures\" and (FolderPath endswith \"\\\\SystemSettingsAdminFlows.exe\" or ProcessVersionInfoOriginalFileName =~ \"SystemSettingsAdminFlows.EXE\") and (ProcessCommandLine contains \"DeveloperUnlock\" or ProcessCommandLine contains \"EnableSideloading\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects when a user enable developer features such as \"Developer Mode\" or \"Application Sideloading\". Which allows the user to install untrusted packag"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          }
        ]
      }
    }
  ]
}
