{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_DLL_File_Download_Via_PowerShell_Invoke-WebRequest')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential DLL File Download Via PowerShell Invoke-WebRequest",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Invoke-WebRequest \" or ProcessCommandLine contains \"IWR \") and (ProcessCommandLine contains \"http\" and ProcessCommandLine contains \"OutFile\" and ProcessCommandLine contains \".dll\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential DLL files being downloaded using the PowerShell Invoke-WebRequest cmdlet"
          },
          {
            "name": "tactics",
            "value": "CommandAndControl,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1105"
          }
        ]
      }
    }
  ]
}
