{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_VMwareToolBoxCmd.EXE_VM_State_Change_Script')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via VMwareToolBoxCmd.EXE VM State Change Script",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" script \" and ProcessCommandLine contains \" set \") and (FolderPath endswith \"\\\\VMwareToolBoxCmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"toolbox-cmd.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of the \"VMwareToolBoxCmd.exe\" with the \"script\" and \"set\" flag to setup a specific script to run for a specific VM st"
          },
          {
            "name": "tactics",
            "value": "Execution,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
