{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Startup_Shortcut_Persistence_Via_PowerShell.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Startup Shortcut Persistence Via PowerShell.EXE",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (InitiatingProcessFolderPath endswith \"\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \"\\\\pwsh.exe\") and FolderPath contains \"\\\\start menu\\\\programs\\\\startup\\\\\" and FolderPath endswith \".lnk\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects PowerShell writing startup shortcuts.\nThis procedure was highlighted in Red Canary Intel Insights Oct. 2021, \"We frequently observe adversaries using PowerShell to write malicious .lnk files into the startup directory to establish persistence.\nAc"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
