{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Amazon_SSM_Agent_Hijacking')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Amazon SSM Agent Hijacking",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-register \" and ProcessCommandLine contains \"-code \" and ProcessCommandLine contains \"-id \" and ProcessCommandLine contains \"-region \") and FolderPath endswith \"\\\\amazon-ssm-agent.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential Amazon SSM agent hijack attempts as outlined in the Mitiga research report."
          },
          {
            "name": "tactics",
            "value": "CommandAndControl,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1219"
          }
        ]
      }
    }
  ]
}
