{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_EACore.DLL_Sideloading')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential EACore.DLL Sideloading",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\EACore.dll\" and (not((FolderPath startswith \"C:\\\\Program Files\\\\Electronic Arts\\\\EA Desktop\\\\\" and (InitiatingProcessFolderPath contains \"C:\\\\Program Files\\\\Electronic Arts\\\\EA Desktop\\\\\" and InitiatingProcessFolderPath contains \"\\\\EACoreServer.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential DLL sideloading of \"EACore.d"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
