{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potentially_Suspicious_Office_Document_Executed_From_Trusted_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potentially Suspicious Office Document Executed From Trusted Location",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (((FolderPath endswith \"\\\\EXCEL.EXE\" or FolderPath endswith \"\\\\POWERPNT.EXE\" or FolderPath endswith \"\\\\WINWORD.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"Excel.exe\", \"POWERPNT.EXE\", \"WinWord.exe\"))) and (InitiatingProcessFolderPath endswith \"\\\\explorer.exe\" or InitiatingProcessFolderPath endswith \"\\\\dopus.exe\") and (ProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Microsoft\\\\Templates\" or ProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Microsoft\\\\Word\\\\Startup\\\\\" or ProcessCommandLine contains \"\\\\Microsoft Office\\\\root\\\\Templates\\\\\" or ProcessCommandLine contains \"\\\\Microsoft Office\\\\Templates\\\\\")) and (not((ProcessCommandLine endswith \".dotx\" or ProcessCommandLine endswith \".xltx\" or ProcessCommandLine endswith \".potx\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of an Office application that points to a document that is located in a trusted location. Attackers often used this to avoid macro security and execute their malicious code."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1202"
          }
        ]
      }
    }
  ]
}
