{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Active_Directory_Enumeration_Using_AD_Module_-_ProcCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Active Directory Enumeration Using AD Module - ProcCreation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Import-Module \" or ProcessCommandLine contains \"ipmo \") and ProcessCommandLine contains \"Microsoft.ActiveDirectory.Management.dll\" and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of the \"Import-Module\" cmdlet to load the \"Microsoft.ActiveDirectory.Management.dl\" DLL. Which is often used by attackers to perform AD enumerati"
          },
          {
            "name": "tactics",
            "value": "Discovery,Impact,Reconnaissance"
          }
        ]
      }
    }
  ]
}
