{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_App_Paths_Default_Property')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via App Paths Default Property",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryValueData contains \"\\\\Users\\\\Public\" or RegistryValueData contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or RegistryValueData contains \"\\\\Windows\\\\Temp\\\\\" or RegistryValueData contains \"\\\\Desktop\\\\\" or RegistryValueData contains \"\\\\Downloads\\\\\" or RegistryValueData contains \"%temp%\" or RegistryValueData contains \"%tmp%\" or RegistryValueData contains \"iex\" or RegistryValueData contains \"Invoke-\" or RegistryValueData contains \"rundll32\" or RegistryValueData contains \"regsvr32\" or RegistryValueData contains \"mshta\" or RegistryValueData contains \"cscript\" or RegistryValueData contains \"wscript\" or RegistryValueData contains \".bat\" or RegistryValueData contains \".hta\" or RegistryValueData contains \".dll\" or RegistryValueData contains \".ps1\") and RegistryKey contains \"\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\App Paths\" and (RegistryKey endswith \"(Default)\" or RegistryKey endswith \"Path\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to the \"Default\" property for keys located in the \\Software\\Microsoft\\Windows\\CurrentVersion\\App Paths\\ registry. Which might be used as a method of persistence\nThe entries found under App Paths are used primarily for the following purpos"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1546"
          }
        ]
      }
    }
  ]
}
