{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_Event_Viewer_Events.asp')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via Event Viewer Events.asp",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey contains \"\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Event Viewer\\\\MicrosoftRedirectionProgram\" or RegistryKey contains \"\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Event Viewer\\\\MicrosoftRedirectionURL\") and (not((RegistryValueData =~ \"(Empty)\" or (RegistryValueData =~ \"%%SystemRoot%%\\\\PCHealth\\\\HelpCtr\\\\Binaries\\\\HelpCtr.exe\" and InitiatingProcessFolderPath endswith \"C:\\\\WINDOWS\\\\system32\\\\svchost.exe\" and RegistryKey endswith \"\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Event Viewer\\\\MicrosoftRedirectionProgram\") or (RegistryValueData =~ \"-url hcp://services/centers/support*topic=%%s\" and InitiatingProcessFolderPath endswith \"C:\\\\WINDOWS\\\\system32\\\\svchost.exe\" and RegistryKey endswith \"\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Event Viewer\\\\MicrosoftRedirectionProgramCommandLineParameters\") or RegistryValueData =~ \"http://go.microsoft.com/fwlink/events.asp\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential registry persistence technique using the Event Viewer \"Events.asp\" technique"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
