{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_Microsoft_Compatibility_Appraiser')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via Microsoft Compatibility Appraiser",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"run \" and ProcessCommandLine contains \"\\\\Application Experience\\\\Microsoft Compatibility Appraiser\") and (FolderPath endswith \"\\\\schtasks.exe\" or ProcessVersionInfoOriginalFileName =~ \"schtasks.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects manual execution of the \"Microsoft Compatibility Appraiser\" task via schtasks.\nIn order to trigger persistence stored in the \"\\AppCompatFlags\\TelemetryController\" registry key.\n"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1053"
          }
        ]
      }
    }
  ]
}
