{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_Logon_Scripts_-_CommandLine')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via Logon Scripts - CommandLine",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"UserInitMprLogonScript\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the addition of a new LogonScript to the registry value \"UserInitMprLogonScript\" for potential persiste"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1037"
          }
        ]
      }
    }
  ]
}
