{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Reconnaissance_Activity_Via_GatherNetworkInfo.VBS')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Reconnaissance Activity Via GatherNetworkInfo.VBS",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"gatherNetworkInfo.vbs\" and ((FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\wscript.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"cscript.exe\", \"wscript.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of the built-in script located in \"C:\\Windows\\System32\\gatherNetworkInfo.vbs\". Which can be used to gather information about the target mach"
          },
          {
            "name": "tactics",
            "value": "Discovery,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1615"
          }
        ]
      }
    }
  ]
}
