{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_Microsoft_Office_Add-In')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via Microsoft Office Add-In",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath contains \"\\\\Microsoft\\\\Addins\\\\\" and (FolderPath endswith \".xlam\" or FolderPath endswith \".xla\" or FolderPath endswith \".ppam\")) or (FolderPath contains \"\\\\Microsoft\\\\Word\\\\Startup\\\\\" and FolderPath endswith \".wll\") or (FolderPath contains \"Microsoft\\\\Excel\\\\XLSTART\\\\\" and FolderPath endswith \".xlam\") or (FolderPath contains \"\\\\Microsoft\\\\Excel\\\\Startup\\\\\" and FolderPath endswith \".xll\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential persistence activity via startup add-ins that load when Microsoft Office starts (.wll/.xll are simply .dll fit for Word or Excel)."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1137"
          }
        ]
      }
    }
  ]
}
