{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Libvlc.DLL_Sideloading')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Libvlc.DLL Sideloading",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\libvlc.dll\" and (not((FolderPath startswith \"C:\\\\Program Files (x86)\\\\VideoLAN\\\\VLC\\\\\" or FolderPath startswith \"C:\\\\Program Files\\\\VideoLAN\\\\VLC\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential DLL sideloading of \"libvlc.dll\", a DLL that is legitimately used by \"VLC.e"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
