{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Recon_Activity_Using_DriverQuery.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Recon Activity Using DriverQuery.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"driverquery.exe\" or ProcessVersionInfoOriginalFileName =~ \"drvqry.exe\") and ((InitiatingProcessFolderPath endswith \"\\\\cscript.exe\" or InitiatingProcessFolderPath endswith \"\\\\mshta.exe\" or InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\" or InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" or InitiatingProcessFolderPath endswith \"\\\\wscript.exe\") or (InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\\" or InitiatingProcessFolderPath contains \"\\\\Users\\\\Public\\\\\" or InitiatingProcessFolderPath contains \"\\\\Windows\\\\Temp\\\\\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect usage of the \"driverquery\" utility to perform reconnaissance on installed drivers"
          },
          {
            "name": "tactics",
            "value": "Discovery"
          }
        ]
      }
    }
  ]
}
