{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_EventLog_File_Location_Tampering')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential EventLog File Location Tampering",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey contains \"\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\EventLog\" and RegistryKey endswith \"\\\\File\") and (not(RegistryValueData contains \"\\\\System32\\\\Winevt\\\\Logs\\\\\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects tampering with EventLog service \"file\" key. In order to change the default location of an Evtx file. This technique is used to tamper with log collection and alerting"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
