{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Commandline_Obfuscation_Using_Escape_Characters')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Commandline Obfuscation Using Escape Characters",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"h^t^t^p\" or ProcessCommandLine contains \"h\\\"t\\\"t\\\"p\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential commandline obfuscation using known escape charact"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1140"
          }
        ]
      }
    }
  ]
}
