{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Reconnaissance_For_Cached_Credentials_Via_Cmdkey.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Reconnaissance For Cached Credentials Via Cmdkey.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -l\" or ProcessCommandLine contains \" /l\") and (FolderPath endswith \"\\\\cmdkey.exe\" or ProcessVersionInfoOriginalFileName =~ \"cmdkey.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of cmdkey to look for cached credentials on the sys"
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
