{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potentially_Suspicious_Electron_Application_CommandLine')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potentially Suspicious Electron Application CommandLine",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"--browser-subprocess-path\" or ProcessCommandLine contains \"--gpu-launcher\" or ProcessCommandLine contains \"--renderer-cmd-prefix\" or ProcessCommandLine contains \"--utility-cmd-prefix\") and ((FolderPath endswith \"\\\\chrome.exe\" or FolderPath endswith \"\\\\code.exe\" or FolderPath endswith \"\\\\discord.exe\" or FolderPath endswith \"\\\\GitHubDesktop.exe\" or FolderPath endswith \"\\\\keybase.exe\" or FolderPath endswith \"\\\\msedge_proxy.exe\" or FolderPath endswith \"\\\\msedge.exe\" or FolderPath endswith \"\\\\msedgewebview2.exe\" or FolderPath endswith \"\\\\msteams.exe\" or FolderPath endswith \"\\\\slack.exe\" or FolderPath endswith \"\\\\Teams.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"chrome.exe\", \"code.exe\", \"discord.exe\", \"GitHubDesktop.exe\", \"keybase.exe\", \"msedge_proxy.exe\", \"msedge.exe\", \"msedgewebview2.exe\", \"msteams.exe\", \"slack.exe\", \"Teams.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potentially suspicious CommandLine of electron apps (teams, discord, slack, etc.). This could be a sign of abuse to proxy execution through a signed binary."
          },
          {
            "name": "tactics",
            "value": "Execution"
          }
        ]
      }
    }
  ]
}
