{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Persistence_Via_Microsoft_Office_Startup_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Persistence Via Microsoft Office Startup Folder",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (((FolderPath endswith \".doc\" or FolderPath endswith \".docm\" or FolderPath endswith \".docx\" or FolderPath endswith \".dot\" or FolderPath endswith \".dotm\" or FolderPath endswith \".rtf\") and (FolderPath contains \"\\\\Microsoft\\\\Word\\\\STARTUP\" or (FolderPath contains \"\\\\Office\" and FolderPath contains \"\\\\Program Files\" and FolderPath contains \"\\\\STARTUP\"))) or ((FolderPath endswith \".xls\" or FolderPath endswith \".xlsm\" or FolderPath endswith \".xlsx\" or FolderPath endswith \".xlt\" or FolderPath endswith \".xltm\") and (FolderPath contains \"\\\\Microsoft\\\\Excel\\\\XLSTART\" or (FolderPath contains \"\\\\Office\" and FolderPath contains \"\\\\Program Files\" and FolderPath contains \"\\\\XLSTART\")))) and (not((InitiatingProcessFolderPath endswith \"\\\\WINWORD.exe\" or InitiatingProcessFolderPath endswith \"\\\\EXCEL.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects creation of Microsoft Office files inside of one of the default startup folders in order to achieve persistence."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1137"
          }
        ]
      }
    }
  ]
}
