{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_CobaltStrike_Process_Patterns')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential CobaltStrike Process Patterns",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \"conhost.exe 0xffffffff -ForceV1\" and (InitiatingProcessCommandLine contains \"cmd.exe /C echo\" and InitiatingProcessCommandLine contains \" > \\\\\\\\.\\\\pipe\")) or (ProcessCommandLine endswith \"conhost.exe 0xffffffff -ForceV1\" and InitiatingProcessCommandLine endswith \"/C whoami\") or (ProcessCommandLine endswith \"cmd.exe /C whoami\" and InitiatingProcessFolderPath startswith \"C:\\\\Temp\\\\\") or ((ProcessCommandLine contains \"cmd.exe /c echo\" and ProcessCommandLine contains \"> \\\\\\\\.\\\\pipe\") and (InitiatingProcessFolderPath endswith \"\\\\runonce.exe\" or InitiatingProcessFolderPath endswith \"\\\\dllhost.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential process patterns related to Cobalt Strike beacon activ"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
