{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Potential_Suspicious_Windows_Feature_Enabled_-_ProcCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Potential Suspicious Windows Feature Enabled - ProcCreation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Enable-WindowsOptionalFeature\" and ProcessCommandLine contains \"-Online\" and ProcessCommandLine contains \"-FeatureName\") and (ProcessCommandLine contains \"TelnetServer\" or ProcessCommandLine contains \"Internet-Explorer-Optional-amd64\" or ProcessCommandLine contains \"TFTP\" or ProcessCommandLine contains \"SMB1Protocol\" or ProcessCommandLine contains \"Client-ProjFS\" or ProcessCommandLine contains \"Microsoft-Windows-Subsystem-Linux\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of the built-in PowerShell cmdlet \"Enable-WindowsOptionalFeature\" used as a Deployment Image Servicing and Management tool.\nSimilar to DISM.exe, this cmdlet is used to enumerate, install, uninstall, configure, and update features and packag"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
