{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Base64_Encoded_FromBase64String_Cmdlet')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Base64 Encoded FromBase64String Cmdlet",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"OjpGcm9tQmFzZTY0U3RyaW5n\" or ProcessCommandLine contains \"o6RnJvbUJhc2U2NFN0cmluZ\" or ProcessCommandLine contains \"6OkZyb21CYXNlNjRTdHJpbm\" or (ProcessCommandLine contains \"OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA\" or ProcessCommandLine contains \"oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA\" or ProcessCommandLine contains \"6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of a base64 encoded \"FromBase64String\" cmdlet in a process command l"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1140"
          }
        ]
      }
    }
  ]
}
