{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Logging_Disabled_Via_Registry_Key_Tampering')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Logging Disabled Via Registry Key Tampering",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000000)\" and (RegistryKey contains \"\\\\Microsoft\\\\Windows\\\\PowerShell\" or RegistryKey contains \"\\\\Microsoft\\\\PowerShellCore\") and (RegistryKey endswith \"\\\\ModuleLogging\\\\EnableModuleLogging\" or RegistryKey endswith \"\\\\ScriptBlockLogging\\\\EnableScriptBlockLogging\" or RegistryKey endswith \"\\\\ScriptBlockLogging\\\\EnableScriptBlockInvocationLogging\" or RegistryKey endswith \"\\\\Transcription\\\\EnableTranscripting\" or RegistryKey endswith \"\\\\Transcription\\\\EnableInvocationHeader\" or RegistryKey endswith \"\\\\EnableScripts\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to the registry for the currently logged-in user. In order to disable PowerShell module logging, script block logging or transcription and script execution logging"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
