{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Execution_With_Potential_Decryption_Capabilities')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Execution With Potential Decryption Capabilities",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Get-ChildItem \" or ProcessCommandLine contains \"dir \" or ProcessCommandLine contains \"gci \" or ProcessCommandLine contains \"ls \") and (ProcessCommandLine contains \"Get-Content \" or ProcessCommandLine contains \"gc \" or ProcessCommandLine contains \"cat \" or ProcessCommandLine contains \"type \" or ProcessCommandLine contains \"ReadAllBytes\") and ((ProcessCommandLine contains \" ^| \" and ProcessCommandLine contains \"*.lnk\" and ProcessCommandLine contains \"-Recurse\" and ProcessCommandLine contains \"-Skip \") or (ProcessCommandLine contains \" -ExpandProperty \" and ProcessCommandLine contains \"*.lnk\" and ProcessCommandLine contains \"WriteAllBytes\" and ProcessCommandLine contains \" .length \")) and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") and (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects PowerShell commands that decrypt an \".LNK\" \"file to drop the next stage of the malwa"
          },
          {
            "name": "tactics",
            "value": "Execution"
          }
        ]
      }
    }
  ]
}
