{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Script_Change_Permission_Via_Set-Acl')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Script Change Permission Via Set-Acl",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Set-Acl \" and ProcessCommandLine contains \"-AclObject \" and ProcessCommandLine contains \"-Path \") and ((ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")) or (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects PowerShell execution to set the ACL of a file or a fol"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
