{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Profile_Modification')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Profile Modification",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath endswith \"\\\\Microsoft.PowerShell_profile.ps1\" or FolderPath endswith \"\\\\PowerShell\\\\profile.ps1\" or FolderPath endswith \"\\\\Program Files\\\\PowerShell\\\\7-preview\\\\profile.ps1\" or FolderPath endswith \"\\\\Program Files\\\\PowerShell\\\\7\\\\profile.ps1\" or FolderPath endswith \"\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\profile.ps1\" or FolderPath endswith \"\\\\WindowsPowerShell\\\\profile.ps1\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation or modification of a powershell profile which could indicate suspicious activity as the profile can be used as a mean of persistence"
          },
          {
            "name": "tactics",
            "value": "Persistence,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1546"
          }
        ]
      }
    }
  ]
}
