{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Base64_Encoded_IEX_Cmdlet')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Base64 Encoded IEX Cmdlet",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"SUVYIChb\" or ProcessCommandLine contains \"lFWCAoW\" or ProcessCommandLine contains \"JRVggKF\" or ProcessCommandLine contains \"aWV4IChb\" or ProcessCommandLine contains \"lleCAoW\" or ProcessCommandLine contains \"pZXggKF\" or ProcessCommandLine contains \"aWV4IChOZX\" or ProcessCommandLine contains \"lleCAoTmV3\" or ProcessCommandLine contains \"pZXggKE5ld\" or ProcessCommandLine contains \"SUVYIChOZX\" or ProcessCommandLine contains \"lFWCAoTmV3\" or ProcessCommandLine contains \"JRVggKE5ld\" or ProcessCommandLine contains \"SUVYKF\" or ProcessCommandLine contains \"lFWChb\" or ProcessCommandLine contains \"JRVgoW\" or ProcessCommandLine contains \"aWV4KF\" or ProcessCommandLine contains \"lleChb\" or ProcessCommandLine contains \"pZXgoW\" or ProcessCommandLine contains \"aWV4KE5ld\" or ProcessCommandLine contains \"lleChOZX\" or ProcessCommandLine contains \"pZXgoTmV3\" or ProcessCommandLine contains \"SUVYKE5ld\" or ProcessCommandLine contains \"lFWChOZX\" or ProcessCommandLine contains \"JRVgoTmV3\" or ProcessCommandLine contains \"SUVYKCgn\" or ProcessCommandLine contains \"lFWCgoJ\" or ProcessCommandLine contains \"JRVgoKC\" or ProcessCommandLine contains \"aWV4KCgn\" or ProcessCommandLine contains \"lleCgoJ\" or ProcessCommandLine contains \"pZXgoKC\") or (ProcessCommandLine contains \"SQBFAFgAIAAoAFsA\" or ProcessCommandLine contains \"kARQBYACAAKABbA\" or ProcessCommandLine contains \"JAEUAWAAgACgAWw\" or ProcessCommandLine contains \"aQBlAHgAIAAoAFsA\" or ProcessCommandLine contains \"kAZQB4ACAAKABbA\" or ProcessCommandLine contains \"pAGUAeAAgACgAWw\" or ProcessCommandLine contains \"aQBlAHgAIAAoAE4AZQB3A\" or ProcessCommandLine contains \"kAZQB4ACAAKABOAGUAdw\" or ProcessCommandLine contains \"pAGUAeAAgACgATgBlAHcA\" or ProcessCommandLine contains \"SQBFAFgAIAAoAE4AZQB3A\" or ProcessCommandLine contains \"kARQBYACAAKABOAGUAdw\" or ProcessCommandLine contains \"JAEUAWAAgACgATgBlAHcA\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of a base64 encoded \"IEX\" cmdlet in a process command l"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
