{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_as_a_Service_in_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell as a Service in Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryValueData contains \"powershell\" or RegistryValueData contains \"pwsh\") and RegistryKey contains \"\\\\Services\" and RegistryKey endswith \"\\\\ImagePath\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects that a powershell code is written to the registry as a service."
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1569"
          }
        ]
      }
    }
  ]
}
