{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Powershell_Token_Obfuscation_-_Process_Creation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Powershell Token Obfuscation - Process Creation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine matches regex \"\\\\w+`(\\\\w+|-|.)`[\\\\w+|\\\\s]\" or ProcessCommandLine matches regex \"\"(\\\\{\\\\d\\\\})+\"\\\\s*-f\" or ProcessCommandLine matches regex \"\\\\$\\\\{((e|n|v)*`(e|n|v)*)+:path\\\\}|\\\\$\\\\{((e|n|v)*`(e|n|v)*)+:((p|a|t|h)*`(p|a|t|h)*)+\\\\}|\\\\$\\\\{env:((p|a|t|h)*`(p|a|t|h)*)+\\\\}\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects TOKEN OBFUSCATION technique from Invoke-Obfuscat"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1027"
          }
        ]
      }
    }
  ]
}
