{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Script_Dropped_Via_PowerShell.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Script Dropped Via PowerShell.EXE",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where ((InitiatingProcessFolderPath endswith \"\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \"\\\\pwsh.exe\") and FolderPath endswith \".ps1\") and (not(((FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and FolderPath startswith \"C:\\\\Users\\\\\") or FolderPath contains \"__PSScriptPolicyTest_\" or FolderPath startswith \"C:\\\\Windows\\\\Temp\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects PowerShell creating a PowerShell file (.ps1). While often times this behavior is benign, sometimes it can be a sign of a dropper script trying to achieve persistence."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          }
        ]
      }
    }
  ]
}
