{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Base64_Encoded_Invoke_Keyword')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Base64 Encoded Invoke Keyword",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" -e\" and (ProcessCommandLine contains \"SQBuAHYAbwBrAGUALQ\" or ProcessCommandLine contains \"kAbgB2AG8AawBlAC0A\" or ProcessCommandLine contains \"JAG4AdgBvAGsAZQAtA\" or ProcessCommandLine contains \"SW52b2tlL\" or ProcessCommandLine contains \"ludm9rZS\" or ProcessCommandLine contains \"JbnZva2Ut\") and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects UTF-8 and UTF-16 Base64 encoded powershell 'Invoke-' ca"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1027,T1059"
          }
        ]
      }
    }
  ]
}
