{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Script_Run_in_AppData')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Script Run in AppData",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"powershell.exe\" or ProcessCommandLine contains \"\\\\powershell\" or ProcessCommandLine contains \"\\\\pwsh\" or ProcessCommandLine contains \"pwsh.exe\") and ((ProcessCommandLine contains \"Local\\\\\" or ProcessCommandLine contains \"Roaming\\\\\") and (ProcessCommandLine contains \"/c \" and ProcessCommandLine contains \"\\\\AppData\\\\\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious command line execution that invokes PowerShell with reference to an AppData fol"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
