{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PowerShell_Module_File_Created_By_Non-PowerShell_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PowerShell Module File Created By Non-PowerShell Process",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath contains \"\\\\WindowsPowerShell\\\\Modules\\\\\" or FolderPath contains \"\\\\PowerShell\\\\7\\\\Modules\\\\\") and (not((InitiatingProcessFolderPath endswith \":\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe\" or InitiatingProcessFolderPath endswith \":\\\\Program Files\\\\PowerShell\\\\7\\\\pwsh.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\poqexec.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\poqexec.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of a new PowerShell module \".psm1\", \".psd1\", \".dll\", \".ps1\", etc. by a non-PowerShell process"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          }
        ]
      }
    }
  ]
}
