{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PrintBrm_ZIP_Creation_of_Extraction')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PrintBrm ZIP Creation of Extraction",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -f\" and ProcessCommandLine contains \".zip\") and FolderPath endswith \"\\\\PrintBrm.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of the LOLBIN PrintBrm.exe, which can be used to create or extract ZIP files. PrintBrm.exe should not be run on a normal workstation."
          },
          {
            "name": "tactics",
            "value": "CommandAndControl,DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105,T1564"
          }
        ]
      }
    }
  ]
}
