{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Privilege_Escalation_via_Named_Pipe_Impersonation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Privilege Escalation via Named Pipe Impersonation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"echo\" and ProcessCommandLine contains \">\" and ProcessCommandLine contains \"\\\\\\\\.\\\\pipe\\\\\") and ((FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\powershell.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"Cmd.Exe\", \"PowerShell.EXE\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a remote file copy attempt to a hidden network share. This may indicate lateral movement or data staging activit"
          },
          {
            "name": "tactics",
            "value": "lateral_movement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1021"
          }
        ]
      }
    }
  ]
}
