{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Private_Keys_Reconnaissance_Via_CommandLine_Tools')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Private Keys Reconnaissance Via CommandLine Tools",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \".key\" or ProcessCommandLine contains \".pgp\" or ProcessCommandLine contains \".gpg\" or ProcessCommandLine contains \".ppk\" or ProcessCommandLine contains \".p12\" or ProcessCommandLine contains \".pem\" or ProcessCommandLine contains \".pfx\" or ProcessCommandLine contains \".cer\" or ProcessCommandLine contains \".p7b\" or ProcessCommandLine contains \".asc\") and ((ProcessCommandLine contains \"dir \" and (FolderPath endswith \"\\\\cmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"Cmd.Exe\")) or (ProcessCommandLine contains \"Get-ChildItem \" and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))) or (FolderPath endswith \"\\\\findstr.exe\" or ProcessVersionInfoOriginalFileName =~ \"FINDSTR.EXE\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "dversaries may search for private key certificate files on compromised systems for insecurely stored credenti"
          },
          {
            "name": "tactics",
            "value": "credential_access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1552"
          }
        ]
      }
    }
  ]
}
