{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Proxy_Execution_Via_Wuauclt.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Proxy Execution Via Wuauclt.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"UpdateDeploymentProvider\" and ProcessCommandLine contains \"RunHandlerComServer\") and (FolderPath endswith \"\\\\wuauclt.exe\" or ProcessVersionInfoOriginalFileName =~ \"wuauclt.exe\")) and (not((ProcessCommandLine contains \" /UpdateDeploymentProvider UpdateDeploymentProvider.dll \" or (ProcessCommandLine contains \":\\\\Windows\\\\UUS\\\\Packages\\\\Preview\\\\amd64\\\\updatedeploy.dll /ClassId\" or ProcessCommandLine contains \":\\\\Windows\\\\UUS\\\\amd64\\\\UpdateDeploy.dll /ClassId\") or (ProcessCommandLine contains \":\\\\Windows\\\\WinSxS\\\\\" and ProcessCommandLine contains \"\\\\UpdateDeploy.dll /ClassId \") or ProcessCommandLine contains \" wuaueng.dll \")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the use of the Windows Update Client binary (wuauclt.exe) for proxy executio"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
