{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PSScriptPolicyTest_Creation_By_Uncommon_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PSScriptPolicyTest Creation By Uncommon Process",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath contains \"__PSScriptPolicyTest_\" and (not((InitiatingProcessFolderPath endswith \":\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe\" or InitiatingProcessFolderPath endswith \":\\\\Program Files\\\\PowerShell\\\\7\\\\pwsh.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\dsac.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\sdiagnhost.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\ServerManager.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\System32\\\\wsmprovhost.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\sdiagnhost.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe\" or InitiatingProcessFolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of the \"PSScriptPolicyTest\" PowerShell script by an uncommon process. This file is usually generated by Microsoft Powershell to test against Applocker."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          }
        ]
      }
    }
  ]
}
