{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PUA_-_Chisel_Tunneling_Tool_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PUA - Chisel Tunneling Tool Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\chisel.exe\" or ((ProcessCommandLine contains \"exe client \" or ProcessCommandLine contains \"exe server \") and (ProcessCommandLine contains \"-socks5\" or ProcessCommandLine contains \"-reverse\" or ProcessCommandLine contains \" r:\" or ProcessCommandLine contains \":127.0.0.1:\" or ProcessCommandLine contains \"-tls-skip-verify \" or ProcessCommandLine contains \":socks\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of the Chisel tunneling tool via the commandline argume"
          },
          {
            "name": "tactics",
            "value": "command_and_control"
          },
          {
            "name": "relevantTechniques",
            "value": "T1090"
          }
        ]
      }
    }
  ]
}
