{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PUA_-_NirCmd_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PUA - NirCmd Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" execmd \" or ProcessCommandLine contains \".exe script \" or ProcessCommandLine contains \".exe shexec \" or ProcessCommandLine contains \" runinteractive \") or (FolderPath endswith \"\\\\NirCmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"NirCmd.exe\")) or ((ProcessCommandLine contains \" exec \" or ProcessCommandLine contains \" exec2 \") and (ProcessCommandLine contains \" show \" or ProcessCommandLine contains \" hide \"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of NirCmd tool for command execution, which could be the result of legitimate administrative activ"
          },
          {
            "name": "tactics",
            "value": "execution,s0029"
          },
          {
            "name": "relevantTechniques",
            "value": "T1569"
          }
        ]
      }
    }
  ]
}
