{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PUA_-_AdvancedRun_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PUA - AdvancedRun Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoOriginalFileName =~ \"AdvancedRun.exe\" or (ProcessCommandLine contains \" /EXEFilename \" and ProcessCommandLine contains \" /Run\") or (ProcessCommandLine contains \" /WindowState 0\" and ProcessCommandLine contains \" /RunAs \" and ProcessCommandLine contains \" /CommandLine \")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of AdvancedRun utility"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1134,T1564"
          }
        ]
      }
    }
  ]
}
