{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PUA_-_AdvancedRun_Suspicious_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PUA - AdvancedRun Suspicious Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/EXEFilename\" or ProcessCommandLine contains \"/CommandLine\") and ((ProcessCommandLine contains \" /RunAs 8 \" or ProcessCommandLine contains \" /RunAs 4 \" or ProcessCommandLine contains \" /RunAs 10 \" or ProcessCommandLine contains \" /RunAs 11 \") or (ProcessCommandLine endswith \"/RunAs 8\" or ProcessCommandLine endswith \"/RunAs 4\" or ProcessCommandLine endswith \"/RunAs 10\" or ProcessCommandLine endswith \"/RunAs 11\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of AdvancedRun utility in the context of the TrustedInstaller, SYSTEM, Local Service or Network Service accounts"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1134"
          }
        ]
      }
    }
  ]
}
