{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PUA_-_Sysinternal_Tool_Execution_-_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PUA - Sysinternal Tool Execution - Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where ActionType =~ \"RegistryKeyCreated\" and RegistryKey endswith \"\\\\EulaAccepted\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of a Sysinternals Tool via the creation of the \"accepteula\" registry key"
          },
          {
            "name": "tactics",
            "value": "ResourceDevelopment"
          },
          {
            "name": "relevantTechniques",
            "value": "T1588"
          }
        ]
      }
    }
  ]
}
