{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PUA_-_AdFind_Suspicious_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PUA - AdFind Suspicious Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"domainlist\" or ProcessCommandLine contains \"trustdmp\" or ProcessCommandLine contains \"dcmodes\" or ProcessCommandLine contains \"adinfo\" or ProcessCommandLine contains \" dclist \" or ProcessCommandLine contains \"computer_pwdnotreqd\" or ProcessCommandLine contains \"objectcategory=\" or ProcessCommandLine contains \"-subnets -f\" or ProcessCommandLine contains \"name=\\\"Domain Admins\\\"\" or ProcessCommandLine contains \"-sc u:\" or ProcessCommandLine contains \"domainncs\" or ProcessCommandLine contains \"dompol\" or ProcessCommandLine contains \" oudmp \" or ProcessCommandLine contains \"subnetdmp\" or ProcessCommandLine contains \"gpodmp\" or ProcessCommandLine contains \"fspdmp\" or ProcessCommandLine contains \"users_noexpire\" or ProcessCommandLine contains \"computers_active\" or ProcessCommandLine contains \"computers_pwdnotreqd\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects AdFind execution with common flags seen used during atta"
          },
          {
            "name": "tactics",
            "value": "discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1018,T1069,T1087,T1482"
          }
        ]
      }
    }
  ]
}
