{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PUA_-_Radmin_Viewer_Utility_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PUA - Radmin Viewer Utility Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoFileDescription =~ \"Radmin Viewer\" or ProcessVersionInfoProductName =~ \"Radmin Viewer\" or ProcessVersionInfoOriginalFileName =~ \"Radmin.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of Radmin which can be abused by an adversary to remotely control Windows machi"
          },
          {
            "name": "tactics",
            "value": "Execution,LateralMovement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1072"
          }
        ]
      }
    }
  ]
}
