{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/PUA_-_Sysinternals_Tools_Execution_-_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "PUA - Sysinternals Tools Execution - Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where ActionType =~ \"RegistryKeyCreated\" and (RegistryKey contains \"\\\\Active Directory Explorer\" or RegistryKey contains \"\\\\Handle\" or RegistryKey contains \"\\\\LiveKd\" or RegistryKey contains \"\\\\Process Explorer\" or RegistryKey contains \"\\\\ProcDump\" or RegistryKey contains \"\\\\PsExec\" or RegistryKey contains \"\\\\PsLoglist\" or RegistryKey contains \"\\\\PsPasswd\" or RegistryKey contains \"\\\\SDelete\" or RegistryKey contains \"\\\\Sysinternals\") and RegistryKey endswith \"\\\\EulaAccepted\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of some potentially unwanted tools such as PsExec, Procdump, etc. (part of the Sysinternals suite) via the creation of the \"accepteula\" registry key."
          },
          {
            "name": "tactics",
            "value": "Resource Development"
          },
          {
            "name": "relevantTechniques",
            "value": "T1588"
          }
        ]
      }
    }
  ]
}
