{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Publisher_Attachment_File_Dropped_In_Suspicious_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Publisher Attachment File Dropped In Suspicious Location",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or FolderPath contains \"\\\\Users\\\\Public\\\\\" or FolderPath contains \"\\\\Windows\\\\Temp\\\\\" or FolderPath contains \"C:\\\\Temp\\\\\") and FolderPath endswith \".pub\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects creation of files with the \".pub\" extension in suspicious or uncommon locations. This could be a sign of attackers abusing Publisher documents"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          }
        ]
      }
    }
  ]
}
