{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Pubprn.vbs_Proxy_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Pubprn.vbs Proxy Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"\\\\pubprn.vbs\" and ProcessCommandLine contains \"script:\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of the 'Pubprn.vbs' Microsoft signed script to execute commands."
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1216"
          }
        ]
      }
    }
  ]
}
