{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Python_Spawning_Pretty_TTY_on_Windows')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Python Spawning Pretty TTY on Windows",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"python.exe\" or FolderPath endswith \"python3.exe\" or FolderPath endswith \"python2.exe\") and ((ProcessCommandLine contains \"import pty\" and ProcessCommandLine contains \".spawn(\") or ProcessCommandLine contains \"from pty import spawn\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects python spawning a pretty tty"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
