{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Raccine_Uninstall')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Raccine Uninstall",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"taskkill \" and ProcessCommandLine contains \"RaccineSettings.exe\") or (ProcessCommandLine contains \"reg.exe\" and ProcessCommandLine contains \"delete\" and ProcessCommandLine contains \"Raccine Tray\") or (ProcessCommandLine contains \"schtasks\" and ProcessCommandLine contains \"/DELETE\" and ProcessCommandLine contains \"Raccine Rules Updater\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects commands that indicate a Raccine removal from an end system. Raccine is a free ransomware protection to"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
