{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Rar_Usage_with_Password_and_Compression_Level')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Rar Usage with Password and Compression Level",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" -hp\" and (ProcessCommandLine contains \" -m\" or ProcessCommandLine contains \" a \")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of rar.exe, on the command line, to create an archive with password protection or with a specific compression level. This is pretty indicative of malicious actio"
          },
          {
            "name": "tactics",
            "value": "Collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1560"
          }
        ]
      }
    }
  ]
}
