{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/RDP_Connection_Allowed_Via_Netsh.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "RDP Connection Allowed Via Netsh.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"portopening\" or ProcessCommandLine contains \"allow\") and (ProcessCommandLine contains \"firewall \" and ProcessCommandLine contains \"add \" and ProcessCommandLine contains \"tcp \" and ProcessCommandLine contains \"3389\")) and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of the netsh command to open and allow connections to port 3389 (RDP). As seen used by Sarwent Malw"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
