{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/RDP_Port_Forwarding_Rule_Added_Via_Netsh.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "RDP Port Forwarding Rule Added Via Netsh.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" i\" and ProcessCommandLine contains \" p\" and ProcessCommandLine contains \"=3389\" and ProcessCommandLine contains \" c\") and (FolderPath endswith \"\\\\netsh.exe\" or ProcessVersionInfoOriginalFileName =~ \"netsh.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of netsh to configure a port forwarding of port 3389 (RDP) r"
          },
          {
            "name": "tactics",
            "value": "command_and_control,defense_evasion,lateral_movement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1090"
          }
        ]
      }
    }
  ]
}
