{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Read_Contents_From_Stdin_Via_Cmd.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Read Contents From Stdin Via Cmd.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"<\" and (ProcessVersionInfoOriginalFileName =~ \"Cmd.Exe\" or FolderPath endswith \"\\\\cmd.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etect the use of \"<\" to read and potentially execute a file via cmd.e"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
