{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Rebuild_Performance_Counter_Values_Via_Lodctr.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Rebuild Performance Counter Values Via Lodctr.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -r\" or ProcessCommandLine contains \" /r\") and (FolderPath endswith \"\\\\lodctr.exe\" and ProcessVersionInfoOriginalFileName =~ \"LODCTR.EXE\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of \"lodctr.exe\" to rebuild the performance counter registry values. This can be abused by attackers by providing a malicious config file to overwrite performance counter configuration to confuse and evade monitoring and security sol"
          },
          {
            "name": "tactics",
            "value": "Execution"
          }
        ]
      }
    }
  ]
}
