{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Regedit_as_Trusted_Installer')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Regedit as Trusted Installer",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\regedit.exe\" and (InitiatingProcessFolderPath endswith \"\\\\TrustedInstaller.exe\" or InitiatingProcessFolderPath endswith \"\\\\ProcessHacker.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a regedit started with TrustedInstaller privileges or by ProcessHacker."
          },
          {
            "name": "tactics",
            "value": "privilege_escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
