{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Registry_Persistence_via_Service_in_Safe_Mode')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Registry Persistence via Service in Safe Mode",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryValueData =~ \"Service\" and (RegistryKey contains \"\\\\Control\\\\SafeBoot\\\\Minimal\" or RegistryKey contains \"\\\\Control\\\\SafeBoot\\\\Network\") and RegistryKey endswith \"\\\\(Default)\") and (not((InitiatingProcessFolderPath =~ \"C:\\\\WINDOWS\\\\system32\\\\msiexec.exe\" and (RegistryKey endswith \"\\\\Control\\\\SafeBoot\\\\Minimal\\\\SAVService\\\\(Default)\" or RegistryKey endswith \"\\\\Control\\\\SafeBoot\\\\Network\\\\SAVService\\\\(Default)\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the modification of the registry to allow a driver or service to persist in Safe Mode."
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
