{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Registry_Modification_to_Hidden_File_Extension')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Registry Modification to Hidden File Extension",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryValueData =~ \"DWORD (0x00000002)\" and RegistryKey endswith \"\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\\\\Hidden\") or (RegistryValueData =~ \"DWORD (0x00000001)\" and RegistryKey endswith \"\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\\\\HideFileExt\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Hides the file extension through modification of the registry"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1137"
          }
        ]
      }
    }
  ]
}
