{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Registry_Disable_System_Restore')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Registry Disable System Restore",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000001)\" and (RegistryKey contains \"\\\\Policies\\\\Microsoft\\\\Windows NT\\\\SystemRestore\" or RegistryKey contains \"\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\SystemRestore\") and (RegistryKey endswith \"DisableConfig\" or RegistryKey endswith \"DisableSR\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the modification of the registry to disable a system restore on the computer"
          },
          {
            "name": "tactics",
            "value": "Impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1490"
          }
        ]
      }
    }
  ]
}
