{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Regsvr32_DLL_Execution_With_Uncommon_Extension')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Regsvr32 DLL Execution With Uncommon Extension",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\regsvr32.exe\" or ProcessVersionInfoOriginalFileName =~ \"REGSVR32.EXE\") and (not((ProcessCommandLine =~ \"\" or (ProcessCommandLine contains \".ax\" or ProcessCommandLine contains \".cpl\" or ProcessCommandLine contains \".dll\" or ProcessCommandLine contains \".ocx\") or isnull(ProcessCommandLine)))) and (not((ProcessCommandLine contains \".bav\" or ProcessCommandLine contains \".ppl\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a \"regsvr32\" execution where the DLL doesn't contain a common file extensi"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
