{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Remote_Access_Tool_-_RURAT_Execution_From_Unusual_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Remote Access Tool - RURAT Execution From Unusual Location",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\rutserv.exe\" or FolderPath endswith \"\\\\rfusclient.exe\") or ProcessVersionInfoProductName =~ \"Remote Utilities\") and (not((FolderPath startswith \"C:\\\\Program Files\\\\Remote Utilities\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\Remote Utilities\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects execution of Remote Utilities RAT (RURAT) from an unusual location (outside of 'C:\\Program Files"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          }
        ]
      }
    }
  ]
}
