{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Remote_Access_Tool_-_AnyDesk_Silent_Installation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Remote Access Tool - AnyDesk Silent Installation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"--install\" and ProcessCommandLine contains \"--start-with-win\" and ProcessCommandLine contains \"--silent\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects AnyDesk Remote Desktop silent installation. Which can be used by attackers to gain remote access."
          },
          {
            "name": "tactics",
            "value": "Command And Control"
          },
          {
            "name": "relevantTechniques",
            "value": "T1219"
          }
        ]
      }
    }
  ]
}
