{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Remote_Access_Tool_-_AnyDesk_Execution_With_Known_Revoked_Signing_Certificate')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Remote Access Tool - AnyDesk Execution With Known Revoked Signing Certificate",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\AnyDesk.exe\" or ProcessVersionInfoFileDescription =~ \"AnyDesk\" or ProcessVersionInfoProductName =~ \"AnyDesk\" or ProcessVersionInfoCompanyName =~ \"AnyDesk Software GmbH\") and (ProcessVersionInfoProductVersion startswith \"7.0.\" or ProcessVersionInfoProductVersion startswith \"7.1.\" or ProcessVersionInfoProductVersion startswith \"8.0.1\" or ProcessVersionInfoProductVersion startswith \"8.0.2\" or ProcessVersionInfoProductVersion startswith \"8.0.3\" or ProcessVersionInfoProductVersion startswith \"8.0.4\" or ProcessVersionInfoProductVersion startswith \"8.0.5\" or ProcessVersionInfoProductVersion startswith \"8.0.6\" or ProcessVersionInfoProductVersion startswith \"8.0.7\")) and (not((ProcessCommandLine contains \" --remove\" or ProcessCommandLine contains \" --uninstall\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of an AnyDesk binary with a version prior to 8.0.8.\nPrior to version 8.0.8, the Anydesk application used a signing certificate that got compromised by threat actors.\nUse this rule to detect instances of older versions of Anydesk usi"
          },
          {
            "name": "tactics",
            "value": "Execution,Initial Access"
          }
        ]
      }
    }
  ]
}
