{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Remote_Access_Tool_-_ScreenConnect_Server_Web_Shell_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Remote Access Tool - ScreenConnect Server Web Shell Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\csc.exe\") and InitiatingProcessFolderPath endswith \"\\\\ScreenConnect.Service.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potential web shell execution from the ScreenConnect server process."
          },
          {
            "name": "tactics",
            "value": "InitialAccess"
          },
          {
            "name": "relevantTechniques",
            "value": "T1190"
          }
        ]
      }
    }
  ]
}
