{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Remote_Access_Tool_-_ScreenConnect_Installation_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Remote Access Tool - ScreenConnect Installation Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"e=Access&\" and ProcessCommandLine contains \"y=Guest&\" and ProcessCommandLine contains \"&p=\" and ProcessCommandLine contains \"&c=\" and ProcessCommandLine contains \"&k=\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects ScreenConnect program starts that establish a remote access to a syst"
          },
          {
            "name": "tactics",
            "value": "initial_access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1133"
          }
        ]
      }
    }
  ]
}
