{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Renamed_Mavinject.EXE_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Renamed Mavinject.EXE Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessVersionInfoOriginalFileName in~ (\"mavinject32.exe\", \"mavinject64.exe\")) and (not((FolderPath endswith \"\\\\mavinject32.exe\" or FolderPath endswith \"\\\\mavinject64.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of a renamed version of the \"Mavinject\" process. Which can be abused to perform process injection using the \"/INJECTRUNNING\" flag"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1055,T1218"
          }
        ]
      }
    }
  ]
}
