{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Renamed_PsExec_Service_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Renamed PsExec Service Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoOriginalFileName =~ \"psexesvc.exe\" and (not(FolderPath =~ \"C:\\\\Windows\\\\PSEXESVC.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious launch of a renamed version of the PSEXESVC service with, which is not often used by legitimate administrat"
          },
          {
            "name": "tactics",
            "value": "Execution"
          }
        ]
      }
    }
  ]
}
