{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Renamed_Remote_Utilities_RAT_(RURAT)_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Renamed Remote Utilities RAT (RURAT) Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoProductName =~ \"Remote Utilities\" and (not((FolderPath endswith \"\\\\rutserv.exe\" or FolderPath endswith \"\\\\rfusclient.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of renamed Remote Utilities (RURAT) via Product PE header fi"
          },
          {
            "name": "tactics",
            "value": "Collection,CommandAndControl,DefenseEvasion,Discovery,S0592"
          }
        ]
      }
    }
  ]
}
