{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Renamed_SysInternals_DebugView_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Renamed SysInternals DebugView Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoProductName =~ \"Sysinternals DebugView\" and (not((FolderPath endswith \"\\\\Dbgview.exe\" and ProcessVersionInfoOriginalFileName =~ \"Dbgview.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious renamed SysInternals DebugView execut"
          },
          {
            "name": "tactics",
            "value": "ResourceDevelopment"
          },
          {
            "name": "relevantTechniques",
            "value": "T1588"
          }
        ]
      }
    }
  ]
}
