{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Rundll32_Registered_COM_Objects')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Rundll32 Registered COM Objects",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"-sta \" or ProcessCommandLine contains \"-localserver \") and (ProcessCommandLine contains \"{\" and ProcessCommandLine contains \"}\")) and (FolderPath endswith \"\\\\rundll32.exe\" or ProcessVersionInfoOriginalFileName =~ \"RUNDLL32.EXE\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "load malicious registered COM obje"
          },
          {
            "name": "tactics",
            "value": "persistence,privilege_escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1546"
          }
        ]
      }
    }
  ]
}
