{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/ScreenSaver_Registry_Key_Set')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "ScreenSaver Registry Key Set",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" and (RegistryValueData endswith \".scr\" and RegistryKey contains \"\\\\Control Panel\\\\Desktop\\\\SCRNSAVE.EXE\") and (not((RegistryValueData contains \"C:\\\\Windows\\\\System32\\\\\" or RegistryValueData contains \"C:\\\\Windows\\\\SysWOW64\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects registry key established after masqueraded .scr file execution using Rundll32 through desk.cpl"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
