{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Screen_Capture_Activity_Via_Psr.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Screen Capture Activity Via Psr.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/start\" or ProcessCommandLine contains \"-start\") and FolderPath endswith \"\\\\Psr.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of Windows Problem Steps Recorder (psr.exe), a utility used to record the user screen and clic"
          },
          {
            "name": "tactics",
            "value": "collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1113"
          }
        ]
      }
    }
  ]
}
