{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Script_Event_Consumer_Spawning_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Script Event Consumer Spawning Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\svchost.exe\" or FolderPath endswith \"\\\\dllhost.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\wscript.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\msiexec.exe\" or FolderPath endswith \"\\\\msbuild.exe\") and InitiatingProcessFolderPath endswith \"\\\\scrcons.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious child process of Script Event Consumer (scrcons.exe)."
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1047"
          }
        ]
      }
    }
  ]
}
