{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Script_Interpreter_Execution_From_Suspicious_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Script Interpreter Execution From Suspicious Folder",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" -ep bypass \" or ProcessCommandLine contains \" -ExecutionPolicy bypass \" or ProcessCommandLine contains \" -w hidden \" or ProcessCommandLine contains \"/e:javascript \" or ProcessCommandLine contains \"/e:Jscript \" or ProcessCommandLine contains \"/e:vbscript \") or (FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\wscript.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"cscript.exe\", \"mshta.exe\", \"wscript.exe\"))) and ((ProcessCommandLine contains \":\\\\Perflogs\\\\\" or ProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\" or ProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Temp\" or ProcessCommandLine contains \"\\\\Temporary Internet\" or ProcessCommandLine contains \"\\\\Windows\\\\Temp\") or ((ProcessCommandLine contains \":\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\Favorites\\\\\") or (ProcessCommandLine contains \":\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\Favourites\\\\\") or (ProcessCommandLine contains \":\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\Contacts\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a suspicious script execution in temporary folders or folders accessible by environment variabl"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
