{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Sdiagnhost_Calling_Suspicious_Child_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Sdiagnhost Calling Suspicious Child Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\wscript.exe\" or FolderPath endswith \"\\\\taskkill.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\calc.exe\") and InitiatingProcessFolderPath endswith \"\\\\sdiagnhost.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects sdiagnhost.exe calling a suspicious child process (e.g. used in exploits for Follina / CVE-2022-301"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036,T1218"
          }
        ]
      }
    }
  ]
}
