{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Security_Support_Provider_(SSP)_Added_to_LSA_Configuration')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Security Support Provider (SSP) Added to LSA Configuration",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey endswith \"\\\\Control\\\\Lsa\\\\Security Packages\" or RegistryKey endswith \"\\\\Control\\\\Lsa\\\\OSConfig\\\\Security Packages\") and (not((InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\system32\\\\msiexec.exe\", \"C:\\\\Windows\\\\syswow64\\\\MsiExec.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the addition of a SSP to the registry. Upon a reboot or API call, SSP DLLs gain access to encrypted and plaintext passwords stored in Windows.\n"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
