{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Security_Service_Disabled_Via_Reg.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Security Service Disabled Via Reg.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"\\\\AppIDSvc\" or ProcessCommandLine contains \"\\\\MsMpSvc\" or ProcessCommandLine contains \"\\\\NisSrv\" or ProcessCommandLine contains \"\\\\SecurityHealthService\" or ProcessCommandLine contains \"\\\\Sense\" or ProcessCommandLine contains \"\\\\UsoSvc\" or ProcessCommandLine contains \"\\\\WdBoot\" or ProcessCommandLine contains \"\\\\WdFilter\" or ProcessCommandLine contains \"\\\\WdNisDrv\" or ProcessCommandLine contains \"\\\\WdNisSvc\" or ProcessCommandLine contains \"\\\\WinDefend\" or ProcessCommandLine contains \"\\\\wscsvc\" or ProcessCommandLine contains \"\\\\wuauserv\") and (ProcessCommandLine contains \"d 4\" and ProcessCommandLine contains \"v Start\")) and (ProcessCommandLine contains \"reg\" and ProcessCommandLine contains \"add\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"reg.exe\" to disable security services such as Windows Defend"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
