{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Security_Privileges_Enumeration_Via_Whoami.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Security Privileges Enumeration Via Whoami.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" /priv\" or ProcessCommandLine contains \" -priv\") and (FolderPath endswith \"\\\\whoami.exe\" or ProcessVersionInfoOriginalFileName =~ \"whoami.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a whoami.exe executed with the /priv command line flag instructing the tool to show all current user privileges. This is often used after a privilege escalation attem"
          },
          {
            "name": "tactics",
            "value": "Discovery,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1033"
          }
        ]
      }
    }
  ]
}
