{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Self_Extraction_Directive_File_Created_In_Potentially_Suspicious_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Self Extraction Directive File Created In Potentially Suspicious Location",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath contains \":\\\\ProgramData\\\\\" or FolderPath contains \":\\\\Temp\\\\\" or FolderPath contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or FolderPath contains \":\\\\Windows\\\\Tasks\\\\\" or FolderPath contains \":\\\\Windows\\\\Temp\\\\\" or FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\") and FolderPath endswith \".sed\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of Self Extraction Directive files (.sed) in a potentially suspicious location.\nThese files are used by the \"iexpress.exe\" utility in order to create self extracting packages.\nAttackers were seen abusing this utility and creating PE "
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
