{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Service_Binary_in_Suspicious_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Service Binary in Suspicious Folder",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (((RegistryValueData in~ (\"DWORD (0x00000000)\", \"DWORD (0x00000001)\", \"DWORD (0x00000002)\")) and (InitiatingProcessFolderPath contains \"\\\\Users\\\\Public\\\\\" or InitiatingProcessFolderPath contains \"\\\\Perflogs\\\\\" or InitiatingProcessFolderPath contains \"\\\\ADMIN$\\\\\" or InitiatingProcessFolderPath contains \"\\\\Temp\\\\\") and RegistryKey endswith \"\\\\Start\" and RegistryKey startswith \"HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet001\\\\Services\") or ((RegistryValueData contains \"\\\\Users\\\\Public\\\\\" or RegistryValueData contains \"\\\\Perflogs\\\\\" or RegistryValueData contains \"\\\\ADMIN$\\\\\" or RegistryValueData contains \"\\\\Temp\\\\\") and RegistryKey endswith \"\\\\ImagePath\" and RegistryKey startswith \"HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet001\\\\Services\")) and (not((InitiatingProcessFolderPath contains \"\\\\Common Files\\\\\" and InitiatingProcessFolderPath contains \"\\\\Temp\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect the creation of a service with a service binary located in a suspicious directory"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1112"
          }
        ]
      }
    }
  ]
}
