{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Service_StartupType_Change_Via_Sc.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Service StartupType Change Via Sc.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"disabled\" or ProcessCommandLine contains \"demand\") and (ProcessCommandLine contains \" config \" and ProcessCommandLine contains \"start\")) and (FolderPath endswith \"\\\\sc.exe\" or ProcessVersionInfoOriginalFileName =~ \"sc.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect the use of \"sc.exe\" to change the startup type of a service to \"disabled\" or \"demand\""
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
