{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Service_Registry_Key_Deleted_Via_Reg.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Service Registry Key Deleted Via Reg.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" delete \" and (FolderPath endswith \"reg.exe\" or ProcessVersionInfoOriginalFileName =~ \"reg.exe\") and ProcessCommandLine contains \"\\\\SYSTEM\\\\CurrentControlSet\\\\services\\\\\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"reg.exe\" commands with the \"delete\" flag on services registry key. Often used by attacker to remove AV software servi"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
