{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/ServiceDll_Hijack')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "ServiceDll Hijack",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where ((RegistryKey contains \"\\\\System\" and RegistryKey contains \"ControlSet\" and RegistryKey contains \"\\\\Services\") and RegistryKey endswith \"\\\\Parameters\\\\ServiceDll\") and (not(((RegistryValueData =~ \"%%systemroot%%\\\\system32\\\\ntdsa.dll\" and InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\system32\\\\lsass.exe\" and RegistryKey endswith \"\\\\Services\\\\NTDS\\\\Parameters\\\\ServiceDll\") or InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\poqexec.exe\" or RegistryValueData =~ \"C:\\\\Windows\\\\system32\\\\spool\\\\drivers\\\\x64\\\\3\\\\PrintConfig.dll\"))) and (not((RegistryValueData =~ \"C:\\\\Windows\\\\System32\\\\STAgent.dll\" and InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects changes to the \"ServiceDLL\" value related to a service in the registry.\nThis is often used as a method of persistence.\n"
          },
          {
            "name": "tactics",
            "value": "Persistence,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1543"
          }
        ]
      }
    }
  ]
}
