{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Set_Suspicious_Files_as_System_Files_Using_Attrib.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Set Suspicious Files as System Files Using Attrib.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" +s\" and (ProcessCommandLine contains \".bat\" or ProcessCommandLine contains \".dll\" or ProcessCommandLine contains \".exe\" or ProcessCommandLine contains \".hta\" or ProcessCommandLine contains \".ps1\" or ProcessCommandLine contains \".vbe\" or ProcessCommandLine contains \".vbs\") and (FolderPath endswith \"\\\\attrib.exe\" or ProcessVersionInfoOriginalFileName =~ \"ATTRIB.EXE\") and (ProcessCommandLine contains \" %\" or ProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or ProcessCommandLine contains \"\\\\ProgramData\\\\\" or ProcessCommandLine contains \"\\\\Downloads\\\\\" or ProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\")) and (not((ProcessCommandLine contains \"\\\\Windows\\\\TEMP\\\\\" and ProcessCommandLine contains \".exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the usage of attrib with the \"+s\" option to set scripts or executables located in suspicious locations as system files to hide them from users and make them unable to be deleted with simple rights. The rule limits the search to spec"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
