{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Shadow_Copies_Deletion_Using_Operating_Systems_Utilities')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Shadow Copies Deletion Using Operating Systems Utilities",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"shadow\" and ProcessCommandLine contains \"delete\") and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\wmic.exe\" or FolderPath endswith \"\\\\vssadmin.exe\" or FolderPath endswith \"\\\\diskshadow.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\", \"wmic.exe\", \"VSSADMIN.EXE\", \"diskshadow.exe\")))) or ((ProcessCommandLine contains \"delete\" and ProcessCommandLine contains \"catalog\" and ProcessCommandLine contains \"quiet\") and (FolderPath endswith \"\\\\wbadmin.exe\" or ProcessVersionInfoOriginalFileName =~ \"WBADMIN.EXE\")) or (((ProcessCommandLine contains \"unbounded\" or ProcessCommandLine contains \"/MaxSize=\") and (ProcessCommandLine contains \"resize\" and ProcessCommandLine contains \"shadowstorage\")) and (FolderPath endswith \"\\\\vssadmin.exe\" or ProcessVersionInfoOriginalFileName =~ \"VSSADMIN.EXE\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Shadow Copies deletion using operating systems utilit"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1070,T1490"
          }
        ]
      }
    }
  ]
}
