{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/SQL_Client_Tools_PowerShell_Session_Detection')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "SQL Client Tools PowerShell Session Detection",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\sqltoolsps.exe\" or InitiatingProcessFolderPath endswith \"\\\\sqltoolsps.exe\" or ProcessVersionInfoOriginalFileName =~ \"\\\\sqltoolsps.exe\") and (not(InitiatingProcessFolderPath endswith \"\\\\smss.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "This rule detects execution of a PowerShell code through the sqltoolsps.exe utility, which is included in the standard set of utilities supplied with the Microsoft SQL Server Management studio.\nScript blocks are not logged in this case, so "
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1127"
          }
        ]
      }
    }
  ]
}
