{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Startup_Folder_File_Write')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Startup Folder File Write",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath contains \"\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\StartUp\" and (not((InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\wuauclt.exe\" or FolderPath startswith \"C:\\\\$WINDOWS.~BT\\\\NewOS\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "A General detection for files being created in the Windows startup directory. This could be an indicator of persistence."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
