{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_File_Execution_From_Internet_Hosted_WebDav_Share')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious File Execution From Internet Hosted WebDav Share",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" net use http\" and ProcessCommandLine contains \"& start /b \" and ProcessCommandLine contains \"\\\\DavWWWRoot\\\\\") and (ProcessCommandLine contains \".exe \" or ProcessCommandLine contains \".dll \" or ProcessCommandLine contains \".bat \" or ProcessCommandLine contains \".vbs \" or ProcessCommandLine contains \".ps1 \") and (FolderPath contains \"\\\\cmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"Cmd.EXE\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of the \"net use\" command to mount a WebDAV server and then immediately execute some content in it. As seen being used in malicious LNK files"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
