{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Plink_Port_Forwarding')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Plink Port Forwarding",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \" -R \" and ProcessVersionInfoFileDescription =~ \"Command-line SSH, Telnet, and Rlogin client\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious Plink tunnel port forwarding to a local port"
          },
          {
            "name": "tactics",
            "value": "CommandAndControl,LateralMovement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1021,T1572"
          }
        ]
      }
    }
  ]
}
