{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Command_Patterns_In_Scheduled_Task_Creation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Command Patterns In Scheduled Task Creation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/Create \" and FolderPath endswith \"\\\\schtasks.exe\") and (((ProcessCommandLine contains \"/sc minute \" or ProcessCommandLine contains \"/ru system \") and (ProcessCommandLine contains \"cmd /c\" or ProcessCommandLine contains \"cmd /k\" or ProcessCommandLine contains \"cmd /r\" or ProcessCommandLine contains \"cmd.exe /c \" or ProcessCommandLine contains \"cmd.exe /k \" or ProcessCommandLine contains \"cmd.exe /r \")) or (ProcessCommandLine contains \" -decode \" or ProcessCommandLine contains \" -enc \" or ProcessCommandLine contains \" -w hidden \" or ProcessCommandLine contains \" bypass \" or ProcessCommandLine contains \" IEX\" or ProcessCommandLine contains \".DownloadData\" or ProcessCommandLine contains \".DownloadFile\" or ProcessCommandLine contains \".DownloadString\" or ProcessCommandLine contains \"/c start /min \" or ProcessCommandLine contains \"FromBase64String\" or ProcessCommandLine contains \"mshta http\" or ProcessCommandLine contains \"mshta.exe http\") or ((ProcessCommandLine contains \":\\\\ProgramData\\\\\" or ProcessCommandLine contains \":\\\\Temp\\\\\" or ProcessCommandLine contains \":\\\\Tmp\\\\\" or ProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\AppData\\\\\" or ProcessCommandLine contains \"%AppData%\" or ProcessCommandLine contains \"%Temp%\" or ProcessCommandLine contains \"%tmp%\") and (ProcessCommandLine contains \"cscript\" or ProcessCommandLine contains \"curl\" or ProcessCommandLine contains \"wscript\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects scheduled task creation using \"schtasks\" that contain potentially suspicious or uncommon comma"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1053"
          }
        ]
      }
    }
  ]
}
