{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Git_Clone')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Git Clone",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" clone \" or ProcessCommandLine contains \"git-remote-https \") and ((FolderPath endswith \"\\\\git.exe\" or FolderPath endswith \"\\\\git-remote-https.exe\") or ProcessVersionInfoOriginalFileName =~ \"git.exe\") and (ProcessCommandLine contains \"exploit\" or ProcessCommandLine contains \"Vulns\" or ProcessCommandLine contains \"vulnerability\" or ProcessCommandLine contains \"RemoteCodeExecution\" or ProcessCommandLine contains \"Invoke-\" or ProcessCommandLine contains \"CVE-\" or ProcessCommandLine contains \"poc-\" or ProcessCommandLine contains \"ProofOfConcept\" or ProcessCommandLine contains \"proxyshell\" or ProcessCommandLine contains \"log4shell\" or ProcessCommandLine contains \"eternalblue\" or ProcessCommandLine contains \"eternal-blue\" or ProcessCommandLine contains \"MS17-\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of \"git\" in order to clone a remote repository that contain suspicious keywords which might be suspici"
          },
          {
            "name": "tactics",
            "value": "Reconnaissance"
          },
          {
            "name": "relevantTechniques",
            "value": "T1593"
          }
        ]
      }
    }
  ]
}
