{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Windows_Trace_ETW_Session_Tamper_Via_Logman.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Windows Trace ETW Session Tamper Via Logman.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"stop \" or ProcessCommandLine contains \"delete \") and (FolderPath endswith \"\\\\logman.exe\" or ProcessVersionInfoOriginalFileName =~ \"Logman.exe\") and (ProcessCommandLine contains \"Circular Kernel Context Logger\" or ProcessCommandLine contains \"EventLog-\" or ProcessCommandLine contains \"SYSMON TRACE\" or ProcessCommandLine contains \"SysmonDnsEtwSession\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of \"logman\" utility in order to disable or delete Windows trace sessi"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1070,T1562"
          }
        ]
      }
    }
  ]
}
