{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Process_Patterns_NTDS.DIT_Exfil')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Process Patterns NTDS.DIT Exfil",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"ac i ntds\" and ProcessCommandLine contains \"create full\") or (ProcessCommandLine contains \"/c copy \" and ProcessCommandLine contains \"\\\\windows\\\\ntds\\\\ntds.dit\") or (ProcessCommandLine contains \"activate instance ntds\" and ProcessCommandLine contains \"create full\") or (ProcessCommandLine contains \"powershell\" and ProcessCommandLine contains \"ntds.dit\") or ((FolderPath endswith \"\\\\NTDSDump.exe\" or FolderPath endswith \"\\\\NTDSDumpEx.exe\") or (ProcessCommandLine contains \"ntds.dit\" and ProcessCommandLine contains \"system.hiv\") or ProcessCommandLine contains \"NTDSgrab.ps1\")) or (((InitiatingProcessFolderPath contains \"\\\\apache\" or InitiatingProcessFolderPath contains \"\\\\tomcat\" or InitiatingProcessFolderPath contains \"\\\\AppData\\\\\" or InitiatingProcessFolderPath contains \"\\\\Temp\\\\\" or InitiatingProcessFolderPath contains \"\\\\Public\\\\\" or InitiatingProcessFolderPath contains \"\\\\PerfLogs\\\\\") or (FolderPath contains \"\\\\apache\" or FolderPath contains \"\\\\tomcat\" or FolderPath contains \"\\\\AppData\\\\\" or FolderPath contains \"\\\\Temp\\\\\" or FolderPath contains \"\\\\Public\\\\\" or FolderPath contains \"\\\\PerfLogs\\\\\")) and ProcessCommandLine contains \"ntds.dit\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects suspicious process patterns used in NTDS.DIT exfiltrati"
          },
          {
            "name": "tactics",
            "value": "credential_access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
