{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Child_Process_Of_Veeam_Dabatase')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Child Process Of Veeam Dabatase",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessCommandLine contains \"VEEAMSQL\" and InitiatingProcessFolderPath endswith \"\\\\sqlservr.exe\") and (((ProcessCommandLine contains \"-ex \" or ProcessCommandLine contains \"bypass\" or ProcessCommandLine contains \"cscript\" or ProcessCommandLine contains \"DownloadString\" or ProcessCommandLine contains \"http://\" or ProcessCommandLine contains \"https://\" or ProcessCommandLine contains \"mshta\" or ProcessCommandLine contains \"regsvr32\" or ProcessCommandLine contains \"rundll32\" or ProcessCommandLine contains \"wscript\" or ProcessCommandLine contains \"copy \") and (FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\wsl.exe\" or FolderPath endswith \"\\\\wt.exe\")) or (FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\net1.exe\" or FolderPath endswith \"\\\\netstat.exe\" or FolderPath endswith \"\\\\nltest.exe\" or FolderPath endswith \"\\\\ping.exe\" or FolderPath endswith \"\\\\tasklist.exe\" or FolderPath endswith \"\\\\whoami.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious child processes of the Veeam service process. This could indicate potential RCE or SQL Injection."
          },
          {
            "name": "tactics",
            "value": "InitialAccess,Persistence,PrivilegeEscalation"
          }
        ]
      }
    }
  ]
}
