{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_HH.EXE_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious HH.EXE Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessVersionInfoOriginalFileName =~ \"HH.exe\" or FolderPath endswith \"\\\\hh.exe\") and (ProcessCommandLine contains \".application\" or ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\Content.Outlook\\\\\" or ProcessCommandLine contains \"\\\\Downloads\\\\\" or ProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious execution of a Microsoft HTML Help (HH.e"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution,Initial Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1047,T1059,T1218,T1566"
          }
        ]
      }
    }
  ]
}
