{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Greedy_Compression_Using_Rar.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Greedy Compression Using Rar.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\rar.exe\" or ProcessVersionInfoFileDescription =~ \"Command line RAR\") or (ProcessCommandLine contains \".exe a \" or ProcessCommandLine contains \" a -m\")) and ((ProcessCommandLine contains \" -hp\" and ProcessCommandLine contains \" -r \") and ((ProcessCommandLine contains \" \" and ProcessCommandLine contains \":*.\") or (ProcessCommandLine contains \" \" and ProcessCommandLine contains \":\\*.\") or (ProcessCommandLine contains \" \" and ProcessCommandLine contains \":\\\\$Recycle.bin\\\\\") or (ProcessCommandLine contains \" \" and ProcessCommandLine contains \":\\\\PerfLogs\\\\\") or (ProcessCommandLine contains \" \" and ProcessCommandLine contains \":\\\\Temp\") or (ProcessCommandLine contains \" \" and ProcessCommandLine contains \":\\\\Users\\\\Public\\\\\") or (ProcessCommandLine contains \" \" and ProcessCommandLine contains \":\\\\Windows\\\\\") or ProcessCommandLine contains \" %public%\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects RAR usage that creates an archive from a suspicious folder, either a system folder or one of the folders often used by attackers for staging purpos"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
