{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_MSHTA_Child_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious MSHTA Child Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\wscript.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\sh.exe\" or FolderPath endswith \"\\\\bash.exe\" or FolderPath endswith \"\\\\reg.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\bitsadmin.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"Cmd.Exe\", \"PowerShell.EXE\", \"pwsh.dll\", \"wscript.exe\", \"cscript.exe\", \"Bash.exe\", \"reg.exe\", \"REGSVR32.EXE\", \"bitsadmin.exe\"))) and InitiatingProcessFolderPath endswith \"\\\\mshta.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious process spawning from an \"mshta.exe\" process, which could be indicative of a malicious HTA script execut"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
