{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Msiexec_Quiet_Install_From_Remote_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Msiexec Quiet Install From Remote Location",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-i\" or ProcessCommandLine contains \"/i\" or ProcessCommandLine contains \"-package\" or ProcessCommandLine contains \"/package\" or ProcessCommandLine contains \"-a\" or ProcessCommandLine contains \"/a\" or ProcessCommandLine contains \"-j\" or ProcessCommandLine contains \"/j\") and (FolderPath endswith \"\\\\msiexec.exe\" or ProcessVersionInfoOriginalFileName =~ \"msiexec.exe\") and (ProcessCommandLine contains \"-q\" or ProcessCommandLine contains \"/q\") and (ProcessCommandLine contains \"http\" or ProcessCommandLine contains \"\\\\\\\\\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of Msiexec.exe to install packages hosted remotely quie"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
