{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Certreq_Command_to_Download')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Certreq Command to Download",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -Post \" and ProcessCommandLine contains \" -config \" and ProcessCommandLine contains \" http\" and ProcessCommandLine contains \" C:\\\\windows\\\\win.ini \") and (FolderPath endswith \"\\\\certreq.exe\" or ProcessVersionInfoOriginalFileName =~ \"CertReq.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a suspicious certreq execution taken from the LOLBAS examples, which can be abused to download (small) fil"
          },
          {
            "name": "tactics",
            "value": "command_and_control"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105"
          }
        ]
      }
    }
  ]
}
