{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Environment_Variable_Has_Been_Registered')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Environment Variable Has Been Registered",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where ((RegistryValueData in~ (\"powershell\", \"pwsh\")) or (RegistryValueData contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or RegistryValueData contains \"C:\\\\Users\\\\Public\\\\\" or RegistryValueData contains \"TVqQAAMAAAAEAAAA\" or RegistryValueData contains \"TVpQAAIAAAAEAA8A\" or RegistryValueData contains \"TVqAAAEAAAAEABAA\" or RegistryValueData contains \"TVoAAAAAAAAAAAAA\" or RegistryValueData contains \"TVpTAQEAAAAEAAAA\" or RegistryValueData contains \"SW52b2tlL\" or RegistryValueData contains \"ludm9rZS\" or RegistryValueData contains \"JbnZva2Ut\" or RegistryValueData contains \"SQBuAHYAbwBrAGUALQ\" or RegistryValueData contains \"kAbgB2AG8AawBlAC0A\" or RegistryValueData contains \"JAG4AdgBvAGsAZQAtA\") or (RegistryValueData startswith \"SUVY\" or RegistryValueData startswith \"SQBFAF\" or RegistryValueData startswith \"SQBuAH\" or RegistryValueData startswith \"cwBhA\" or RegistryValueData startswith \"aWV4\" or RegistryValueData startswith \"aQBlA\" or RegistryValueData startswith \"R2V0\" or RegistryValueData startswith \"dmFy\" or RegistryValueData startswith \"dgBhA\" or RegistryValueData startswith \"dXNpbm\" or RegistryValueData startswith \"H4sIA\" or RegistryValueData startswith \"Y21k\" or RegistryValueData startswith \"cABhAH\" or RegistryValueData startswith \"Qzpc\" or RegistryValueData startswith \"Yzpc\")) and RegistryKey contains \"\\\\Environment\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of user-specific or system-wide environment variables via the registry. Which contains suspicious commands and strings"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence"
          }
        ]
      }
    }
  ]
}
