{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Office_Token_Search_Via_CLI')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Office Token Search Via CLI",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"eyJ0eXAiOi\" or ProcessCommandLine contains \" eyJ0eX\" or ProcessCommandLine contains \" \\\"eyJ0eX\\\"\" or ProcessCommandLine contains \" 'eyJ0eX'\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects possible search for office tokens via CLI by looking for the string \"eyJ0eX\". This string is used as an anchor to look for the start of the JWT token used by office and similar ap"
          },
          {
            "name": "tactics",
            "value": "Credential Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1528"
          }
        ]
      }
    }
  ]
}
