{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Curl.EXE_Download')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Curl.EXE Download",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\curl.exe\" or ProcessVersionInfoProductName =~ \"The curl executable\") and ((ProcessCommandLine endswith \".dll\" or ProcessCommandLine endswith \".gif\" or ProcessCommandLine endswith \".jpeg\" or ProcessCommandLine endswith \".jpg\" or ProcessCommandLine endswith \".png\" or ProcessCommandLine endswith \".temp\" or ProcessCommandLine endswith \".tmp\" or ProcessCommandLine endswith \".txt\" or ProcessCommandLine endswith \".vbe\" or ProcessCommandLine endswith \".vbs\") or (ProcessCommandLine contains \"%AppData%\" or ProcessCommandLine contains \"%Public%\" or ProcessCommandLine contains \"%Temp%\" or ProcessCommandLine contains \"%tmp%\" or ProcessCommandLine contains \"\\\\AppData\\\\\" or ProcessCommandLine contains \"\\\\Desktop\\\\\" or ProcessCommandLine contains \"\\\\Temp\\\\\" or ProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"C:\\\\PerfLogs\\\\\" or ProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or ProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\")) and (not(((ProcessCommandLine contains \"--silent --show-error --output \" and ProcessCommandLine contains \"gfw-httpget-\" and ProcessCommandLine contains \"AppData\") and FolderPath =~ \"C:\\\\Program Files\\\\Git\\\\mingw64\\\\bin\\\\curl.exe\" and InitiatingProcessFolderPath =~ \"C:\\\\Program Files\\\\Git\\\\usr\\\\bin\\\\sh.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious curl process start on Windows and outputs the requested document to a local f"
          },
          {
            "name": "tactics",
            "value": "command_and_control"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105"
          }
        ]
      }
    }
  ]
}
