{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_CustomShellHost_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious CustomShellHost Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\CustomShellHost.exe\" and (not(FolderPath =~ \"C:\\\\Windows\\\\explorer.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of CustomShellHost binary where the child isn't located in 'C:\\Windows\\explorer.exe'"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1216"
          }
        ]
      }
    }
  ]
}
