{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Mshta.EXE_Execution_Patterns')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Mshta.EXE Execution Patterns",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\mshta.exe\" or ProcessVersionInfoOriginalFileName =~ \"MSHTA.EXE\") and ((ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or ProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or ProcessCommandLine contains \"C:\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\") and (InitiatingProcessFolderPath endswith \"\\\\cmd.exe\" or InitiatingProcessFolderPath endswith \"\\\\cscript.exe\" or InitiatingProcessFolderPath endswith \"\\\\powershell.exe\" or InitiatingProcessFolderPath endswith \"\\\\pwsh.exe\" or InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\" or InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" or InitiatingProcessFolderPath endswith \"\\\\wscript.exe\"))) or ((FolderPath endswith \"\\\\mshta.exe\" or ProcessVersionInfoOriginalFileName =~ \"MSHTA.EXE\") and (not(((FolderPath startswith \"C:\\\\Windows\\\\System32\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\SysWOW64\\\\\") or (ProcessCommandLine contains \".htm\" or ProcessCommandLine contains \".hta\") or (ProcessCommandLine endswith \"mshta.exe\" or ProcessCommandLine endswith \"mshta\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects suspicious mshta process execution patter"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1106"
          }
        ]
      }
    }
  ]
}
