{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_PowerShell_Download_and_Execute_Pattern')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious PowerShell Download and Execute Pattern",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"IEX ((New-Object Net.WebClient).DownloadString\" or ProcessCommandLine contains \"IEX (New-Object Net.WebClient).DownloadString\" or ProcessCommandLine contains \"IEX((New-Object Net.WebClient).DownloadString\" or ProcessCommandLine contains \"IEX(New-Object Net.WebClient).DownloadString\" or ProcessCommandLine contains \" -command (New-Object System.Net.WebClient).DownloadFile(\" or ProcessCommandLine contains \" -c (New-Object System.Net.WebClient).DownloadFile(\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious PowerShell download patterns that are often used in malicious scripts, stagers or downloaders (make sure that your backend applies the strings case-insensiti"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
