{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_File_Drop_by_Exchange')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious File Drop by Exchange",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (InitiatingProcessCommandLine contains \"MSExchange\" and InitiatingProcessFolderPath endswith \"\\\\w3wp.exe\") and (FolderPath endswith \".aspx\" or FolderPath endswith \".asp\" or FolderPath endswith \".ashx\" or FolderPath endswith \".ps1\" or FolderPath endswith \".bat\" or FolderPath endswith \".exe\" or FolderPath endswith \".dll\" or FolderPath endswith \".vbs\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious file type dropped by an Exchange component in IIS"
          },
          {
            "name": "tactics",
            "value": "InitialAccess,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1190,T1505"
          }
        ]
      }
    }
  ]
}
