{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Manipulation_Of_Default_Accounts_Via_Net.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Manipulation Of Default Accounts Via Net.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (((FolderPath endswith \"\\\\net.exe\" or FolderPath endswith \"\\\\net1.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"net.exe\", \"net1.exe\"))) and ProcessCommandLine contains \" user \" and (ProcessCommandLine contains \" Järjestelmänvalvoja \" or ProcessCommandLine contains \" Rendszergazda \" or ProcessCommandLine contains \" Администратор \" or ProcessCommandLine contains \" Administrateur \" or ProcessCommandLine contains \" Administrador \" or ProcessCommandLine contains \" Administratör \" or ProcessCommandLine contains \" Administrator \" or ProcessCommandLine contains \" guest \" or ProcessCommandLine contains \" DefaultAccount \" or ProcessCommandLine contains \" \\\"Järjestelmänvalvoja\\\" \" or ProcessCommandLine contains \" \\\"Rendszergazda\\\" \" or ProcessCommandLine contains \" \\\"Администратор\\\" \" or ProcessCommandLine contains \" \\\"Administrateur\\\" \" or ProcessCommandLine contains \" \\\"Administrador\\\" \" or ProcessCommandLine contains \" \\\"Administratör\\\" \" or ProcessCommandLine contains \" \\\"Administrator\\\" \" or ProcessCommandLine contains \" \\\"guest\\\" \" or ProcessCommandLine contains \" \\\"DefaultAccount\\\" \" or ProcessCommandLine contains \" 'Järjestelmänvalvoja' \" or ProcessCommandLine contains \" 'Rendszergazda' \" or ProcessCommandLine contains \" 'Администратор' \" or ProcessCommandLine contains \" 'Administrateur' \" or ProcessCommandLine contains \" 'Administrador' \" or ProcessCommandLine contains \" 'Administratör' \" or ProcessCommandLine contains \" 'Administrator' \" or ProcessCommandLine contains \" 'guest' \" or ProcessCommandLine contains \" 'DefaultAccount' \")) and (not((ProcessCommandLine contains \"guest\" and ProcessCommandLine contains \"/active no\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious manipulations of default accounts such as 'administrator' and 'guest'. For example 'enable' or 'disable' accounts or change the password...etc"
          },
          {
            "name": "tactics",
            "value": "Collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1560"
          }
        ]
      }
    }
  ]
}
