{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_File_Creation_In_Uncommon_AppData_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious File Creation In Uncommon AppData Folder",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath contains \"\\\\AppData\\\\\" and (FolderPath endswith \".bat\" or FolderPath endswith \".cmd\" or FolderPath endswith \".cpl\" or FolderPath endswith \".dll\" or FolderPath endswith \".exe\" or FolderPath endswith \".hta\" or FolderPath endswith \".iso\" or FolderPath endswith \".lnk\" or FolderPath endswith \".msi\" or FolderPath endswith \".ps1\" or FolderPath endswith \".psm1\" or FolderPath endswith \".scr\" or FolderPath endswith \".vbe\" or FolderPath endswith \".vbs\") and FolderPath startswith \"C:\\\\Users\\\\\") and (not(((FolderPath contains \"\\\\AppData\\\\Local\\\\\" or FolderPath contains \"\\\\AppData\\\\LocalLow\\\\\" or FolderPath contains \"\\\\AppData\\\\Roaming\\\\\") and FolderPath startswith \"C:\\\\Users\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of suspicious files and folders inside the user's AppData folder but not inside any of the common and well known directories (Local, Romaing, LocalLow). This method could be used as a method to bypass detection who exclude the AppDat"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          }
        ]
      }
    }
  ]
}
