{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Encoded_PowerShell_Command_Line')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Encoded PowerShell Command Line",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and (((ProcessCommandLine contains \" JAB\" or ProcessCommandLine contains \" SUVYI\" or ProcessCommandLine contains \" SQBFAFgA\" or ProcessCommandLine contains \" aQBlAHgA\" or ProcessCommandLine contains \" aWV4I\" or ProcessCommandLine contains \" IAA\" or ProcessCommandLine contains \" IAB\" or ProcessCommandLine contains \" UwB\" or ProcessCommandLine contains \" cwB\") and ProcessCommandLine contains \" -e\") or (ProcessCommandLine contains \".exe -ENCOD \" or ProcessCommandLine contains \" BA^J e-\")) and (not(ProcessCommandLine contains \" -ExecutionPolicy remotesigned \"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious powershell process starts with base64 encoded commands (e.g. Emot"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
