{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Network_Connection_Binary_No_CommandLine')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Network Connection Binary No CommandLine",
        "category": "Hunting Queries",
        "query": "DeviceNetworkEvents\n| where ((InitiatingProcessCommandLine endswith \"\\\\regsvr32.exe\" or InitiatingProcessCommandLine endswith \"\\\\rundll32.exe\" or InitiatingProcessCommandLine endswith \"\\\\dllhost.exe\") and (InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\" or InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" or InitiatingProcessFolderPath endswith \"\\\\dllhost.exe\")) and (not((InitiatingProcessCommandLine =~ \"\" or isnull(InitiatingProcessCommandLine))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious network connections made by a well-known Windows binary run with no command line parameters"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
