{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_PowerShell_Invocations_-_Specific_-_ProcessCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious PowerShell Invocations - Specific - ProcessCreation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"-nop\" and ProcessCommandLine contains \" -w \" and ProcessCommandLine contains \"hidden\" and ProcessCommandLine contains \" -c \" and ProcessCommandLine contains \"[Convert]::FromBase64String\") or (ProcessCommandLine contains \" -w \" and ProcessCommandLine contains \"hidden\" and ProcessCommandLine contains \"-ep\" and ProcessCommandLine contains \"bypass\" and ProcessCommandLine contains \"-Enc\") or (ProcessCommandLine contains \" -w \" and ProcessCommandLine contains \"hidden\" and ProcessCommandLine contains \"-noni\" and ProcessCommandLine contains \"-nop\" and ProcessCommandLine contains \" -c \" and ProcessCommandLine contains \"iex\" and ProcessCommandLine contains \"New-Object\") or (ProcessCommandLine contains \"iex\" and ProcessCommandLine contains \"New-Object\" and ProcessCommandLine contains \"Net.WebClient\" and ProcessCommandLine contains \".Download\") or (ProcessCommandLine contains \"powershell\" and ProcessCommandLine contains \"reg\" and ProcessCommandLine contains \"add\" and ProcessCommandLine contains \"\\\\software\\\\\") or (ProcessCommandLine contains \"bypass\" and ProcessCommandLine contains \"-noprofile\" and ProcessCommandLine contains \"-windowstyle\" and ProcessCommandLine contains \"hidden\" and ProcessCommandLine contains \"new-object\" and ProcessCommandLine contains \"system.net.webclient\" and ProcessCommandLine contains \".download\")) and (not((ProcessCommandLine contains \"(New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1\" or ProcessCommandLine contains \"Write-ChocolateyWarning\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects suspicious PowerShell invocation command paramete"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          }
        ]
      }
    }
  ]
}
