{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Msbuild_Execution_By_Uncommon_Parent_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Msbuild Execution By Uncommon Parent Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\MSBuild.exe\" or ProcessVersionInfoOriginalFileName =~ \"MSBuild.exe\") and (not((InitiatingProcessFolderPath endswith \"\\\\devenv.exe\" or InitiatingProcessFolderPath endswith \"\\\\cmd.exe\" or InitiatingProcessFolderPath endswith \"\\\\msbuild.exe\" or InitiatingProcessFolderPath endswith \"\\\\python.exe\" or InitiatingProcessFolderPath endswith \"\\\\explorer.exe\" or InitiatingProcessFolderPath endswith \"\\\\nuget.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects suspicious execution of 'Msbuild.exe' by a uncommon parent proce"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          }
        ]
      }
    }
  ]
}
