{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_IIS_URL_GlobalRules_Rewrite_Via_AppCmd')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious IIS URL GlobalRules Rewrite Via AppCmd",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"set\" and ProcessCommandLine contains \"config\" and ProcessCommandLine contains \"section:system.webServer/rewrite/globalRules\" and ProcessCommandLine contains \"commit:\") and (FolderPath endswith \"\\\\appcmd.exe\" or ProcessVersionInfoOriginalFileName =~ \"appcmd.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of \"appcmd\" to create new global URL rewrite rules. This behaviour has been observed being used by threat actors to add new rules so they can access their webshells."
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          }
        ]
      }
    }
  ]
}
