{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Service_Installed')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Service Installed",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (RegistryKey in~ (\"HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet001\\\\Services\\\\NalDrv\\\\ImagePath\", \"HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet001\\\\Services\\\\PROCEXP152\\\\ImagePath\")) and (not((RegistryValueData contains \"\\\\WINDOWS\\\\system32\\\\Drivers\\\\PROCEXP152.SYS\" and (InitiatingProcessFolderPath endswith \"\\\\procexp64.exe\" or InitiatingProcessFolderPath endswith \"\\\\procexp.exe\" or InitiatingProcessFolderPath endswith \"\\\\procmon64.exe\" or InitiatingProcessFolderPath endswith \"\\\\procmon.exe\" or InitiatingProcessFolderPath endswith \"\\\\handle.exe\" or InitiatingProcessFolderPath endswith \"\\\\handle64.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects installation of NalDrv or PROCEXP152 services via registry-keys to non-system32 folders.\nBoth services are used in the tool Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs), which uses KDU (https://github.com/hfiref0x/KDU)\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
