{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Csi.exe_Usage')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Csi.exe Usage",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessVersionInfoCompanyName =~ \"Microsoft Corporation\" and ((FolderPath endswith \"\\\\csi.exe\" or FolderPath endswith \"\\\\rcsi.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"csi.exe\", \"rcsi.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Csi.exe is a signed binary from Microsoft that comes with Visual Studio and provides C# interactive capabilities. It can be used to run C# code from a file passed as a parameter in command line. Early version of this utility provided with Microsoft “Rosl"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1072,T1218"
          }
        ]
      }
    }
  ]
}
