{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Process_Start_Locations')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Process Start Locations",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath contains \":\\\\RECYCLER\\\\\" or FolderPath contains \":\\\\SystemVolumeInformation\\\\\") or (FolderPath startswith \"C:\\\\Windows\\\\Tasks\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\debug\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\fonts\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\help\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\drivers\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\addins\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\cursors\\\\\" or FolderPath startswith \"C:\\\\Windows\\\\system32\\\\tasks\\\\\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious process run from unusual locations"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
