{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_File_Creation_Activity_From_Fake_Recycle.Bin_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious File Creation Activity From Fake Recycle.Bin Folder",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (InitiatingProcessFolderPath contains \"RECYCLERS.BIN\\\\\" or InitiatingProcessFolderPath contains \"RECYCLER.BIN\\\\\") or (FolderPath contains \"RECYCLERS.BIN\\\\\" or FolderPath contains \"RECYCLER.BIN\\\\\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects file write event from/to a fake recycle bin folder that is often used as a staging directory for malware"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence"
          }
        ]
      }
    }
  ]
}
