{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_PowerShell_Parent_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious PowerShell Parent Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessFolderPath contains \"tomcat\" or (InitiatingProcessFolderPath endswith \"\\\\amigo.exe\" or InitiatingProcessFolderPath endswith \"\\\\browser.exe\" or InitiatingProcessFolderPath endswith \"\\\\chrome.exe\" or InitiatingProcessFolderPath endswith \"\\\\firefox.exe\" or InitiatingProcessFolderPath endswith \"\\\\httpd.exe\" or InitiatingProcessFolderPath endswith \"\\\\iexplore.exe\" or InitiatingProcessFolderPath endswith \"\\\\jbosssvc.exe\" or InitiatingProcessFolderPath endswith \"\\\\microsoftedge.exe\" or InitiatingProcessFolderPath endswith \"\\\\microsoftedgecp.exe\" or InitiatingProcessFolderPath endswith \"\\\\MicrosoftEdgeSH.exe\" or InitiatingProcessFolderPath endswith \"\\\\mshta.exe\" or InitiatingProcessFolderPath endswith \"\\\\nginx.exe\" or InitiatingProcessFolderPath endswith \"\\\\outlook.exe\" or InitiatingProcessFolderPath endswith \"\\\\php-cgi.exe\" or InitiatingProcessFolderPath endswith \"\\\\regsvr32.exe\" or InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" or InitiatingProcessFolderPath endswith \"\\\\safari.exe\" or InitiatingProcessFolderPath endswith \"\\\\services.exe\" or InitiatingProcessFolderPath endswith \"\\\\sqlagent.exe\" or InitiatingProcessFolderPath endswith \"\\\\sqlserver.exe\" or InitiatingProcessFolderPath endswith \"\\\\sqlservr.exe\" or InitiatingProcessFolderPath endswith \"\\\\vivaldi.exe\" or InitiatingProcessFolderPath endswith \"\\\\w3wp.exe\")) and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessCommandLine contains \"/c powershell\" or ProcessCommandLine contains \"/c pwsh\") or ProcessVersionInfoFileDescription =~ \"Windows PowerShell\" or ProcessVersionInfoProductName =~ \"PowerShell Core 6\" or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious or uncommon parent processes of PowerShell"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
