{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_PowerShell_Mailbox_Export_to_Share')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious PowerShell Mailbox Export to Share",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"New-MailboxExportRequest\" and ProcessCommandLine contains \" -Mailbox \" and ProcessCommandLine contains \" -FilePath \\\\\\\\\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of the powerShell New-MailboxExportRequest Cmdlet to exports a mailbox to a remote or local share, as used in ProxyShell exploitati"
          },
          {
            "name": "tactics",
            "value": "exfiltration"
          }
        ]
      }
    }
  ]
}
