{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Powercfg_Execution_To_Change_Lock_Screen_Timeout')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Powercfg Execution To Change Lock Screen Timeout",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\powercfg.exe\" or ProcessVersionInfoOriginalFileName =~ \"PowerCfg.exe\") and ((ProcessCommandLine contains \"/setacvalueindex \" and ProcessCommandLine contains \"SCHEME_CURRENT\" and ProcessCommandLine contains \"SUB_VIDEO\" and ProcessCommandLine contains \"VIDEOCONLOCK\") or (ProcessCommandLine contains \"-change \" and ProcessCommandLine contains \"-standby-timeout-\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious execution of 'Powercfg.exe' to change lock screen time"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          }
        ]
      }
    }
  ]
}
