{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Userinit_Child_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Userinit Child Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\userinit.exe\" and (not((ProcessCommandLine contains \"\\\\netlogon\\\\\" or (FolderPath endswith \"\\\\explorer.exe\" or ProcessVersionInfoOriginalFileName =~ \"explorer.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious child process of userinit"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1055"
          }
        ]
      }
    }
  ]
}
