{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_RunAs-Like_Flag_Combination')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious RunAs-Like Flag Combination",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -c cmd\" or ProcessCommandLine contains \" -c \\\"cmd\" or ProcessCommandLine contains \" -c powershell\" or ProcessCommandLine contains \" -c \\\"powershell\" or ProcessCommandLine contains \" --command cmd\" or ProcessCommandLine contains \" --command powershell\" or ProcessCommandLine contains \" -c whoami\" or ProcessCommandLine contains \" -c wscript\" or ProcessCommandLine contains \" -c cscript\") and (ProcessCommandLine contains \" -u system \" or ProcessCommandLine contains \" --user system \" or ProcessCommandLine contains \" -u NT\" or ProcessCommandLine contains \" -u \\\"NT\" or ProcessCommandLine contains \" -u 'NT\" or ProcessCommandLine contains \" --system \" or ProcessCommandLine contains \" -u administrator \")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious command line flags that let the user set a target user and command as e.g. seen in PsExec-like tools"
          },
          {
            "name": "tactics",
            "value": "Privilege Escalation"
          }
        ]
      }
    }
  ]
}
