{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Process_Parents')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Process Parents",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessFolderPath endswith \"\\\\minesweeper.exe\" or InitiatingProcessFolderPath endswith \"\\\\winver.exe\" or InitiatingProcessFolderPath endswith \"\\\\bitsadmin.exe\") or ((InitiatingProcessFolderPath endswith \"\\\\csrss.exe\" or InitiatingProcessFolderPath endswith \"\\\\certutil.exe\" or InitiatingProcessFolderPath endswith \"\\\\eventvwr.exe\" or InitiatingProcessFolderPath endswith \"\\\\calc.exe\" or InitiatingProcessFolderPath endswith \"\\\\notepad.exe\") and (not((isnull(FolderPath) or (FolderPath endswith \"\\\\WerFault.exe\" or FolderPath endswith \"\\\\wermgr.exe\" or FolderPath endswith \"\\\\conhost.exe\" or FolderPath endswith \"\\\\mmc.exe\" or FolderPath endswith \"\\\\win32calc.exe\" or FolderPath endswith \"\\\\notepad.exe\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious parent processes that should not have any children or should only have a single possible child prog"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
