{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Serv-U_Process_Pattern')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Serv-U Process Pattern",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\cmd.exe\" or FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\" or FolderPath endswith \"\\\\wscript.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\sh.exe\" or FolderPath endswith \"\\\\bash.exe\" or FolderPath endswith \"\\\\schtasks.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\wmic.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\msiexec.exe\" or FolderPath endswith \"\\\\forfiles.exe\" or FolderPath endswith \"\\\\scriptrunner.exe\") and InitiatingProcessFolderPath endswith \"\\\\Serv-U.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a suspicious process pattern which could be a sign of an exploited Serv-U serv"
          },
          {
            "name": "tactics",
            "value": "credential_access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1555"
          }
        ]
      }
    }
  ]
}
