{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Schtasks_Schedule_Types')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Schtasks Schedule Types",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\schtasks.exe\" or ProcessVersionInfoOriginalFileName =~ \"schtasks.exe\") and (ProcessCommandLine contains \" ONLOGON \" or ProcessCommandLine contains \" ONSTART \" or ProcessCommandLine contains \" ONCE \" or ProcessCommandLine contains \" ONIDLE \")) and (not((ProcessCommandLine contains \"NT AUT\" or ProcessCommandLine contains \" SYSTEM\" or ProcessCommandLine contains \"HIGHEST\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects scheduled task creations or modification on a suspicious schedule t"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1053"
          }
        ]
      }
    }
  ]
}
