{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_DumpMinitool_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious DumpMinitool Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\DumpMinitool.exe\" or FolderPath endswith \"\\\\DumpMinitool.x86.exe\" or FolderPath endswith \"\\\\DumpMinitool.arm64.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"DumpMinitool.exe\", \"DumpMinitool.x86.exe\", \"DumpMinitool.arm64.exe\"))) and ((not((FolderPath contains \"\\\\Microsoft Visual Studio\\\\\" or FolderPath contains \"\\\\Extensions\\\\\"))) or ProcessCommandLine contains \".txt\" or ((ProcessCommandLine contains \" Full\" or ProcessCommandLine contains \" Mini\" or ProcessCommandLine contains \" WithHeap\") and (not(ProcessCommandLine contains \"--dumpType\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious ways to use the \"DumpMinitool.exe\" bin"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003,T1036"
          }
        ]
      }
    }
  ]
}
