{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_PowerShell_Encoded_Command_Patterns')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious PowerShell Encoded Command Patterns",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" JAB\" or ProcessCommandLine contains \" SUVYI\" or ProcessCommandLine contains \" SQBFAFgA\" or ProcessCommandLine contains \" aWV4I\" or ProcessCommandLine contains \" IAB\" or ProcessCommandLine contains \" PAA\" or ProcessCommandLine contains \" aQBlAHgA\") and (ProcessCommandLine contains \" -e \" or ProcessCommandLine contains \" -en \" or ProcessCommandLine contains \" -enc \" or ProcessCommandLine contains \" -enco\") and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.Exe\", \"pwsh.dll\")))) and (not((InitiatingProcessFolderPath contains \"C:\\\\Packages\\\\Plugins\\\\Microsoft.GuestConfiguration.ConfigurationforWindows\\\\\" or InitiatingProcessFolderPath contains \"\\\\gc_worker.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects PowerShell command line patterns in combincation with encoded commands that often appear in malware infection chai"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
