{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Creation_TXT_File_in_User_Desktop')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Creation TXT File in User Desktop",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where InitiatingProcessFolderPath endswith \"\\\\cmd.exe\" and (FolderPath contains \"\\\\Users\\\\\" and FolderPath contains \"\\\\Desktop\\\\\") and FolderPath endswith \".txt\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Ransomware create txt file in the user Desktop"
          },
          {
            "name": "tactics",
            "value": "Impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1486"
          }
        ]
      }
    }
  ]
}
