{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Volume_Shadow_Copy_VSS_PS.dll_Load')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Volume Shadow Copy VSS_PS.dll Load",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\vss_ps.dll\" and (not((isnull(InitiatingProcessFolderPath) or ((InitiatingProcessFolderPath endswith \"\\\\clussvc.exe\" or InitiatingProcessFolderPath endswith \"\\\\dismhost.exe\" or InitiatingProcessFolderPath endswith \"\\\\dllhost.exe\" or InitiatingProcessFolderPath endswith \"\\\\inetsrv\\\\appcmd.exe\" or InitiatingProcessFolderPath endswith \"\\\\inetsrv\\\\iissetup.exe\" or InitiatingProcessFolderPath endswith \"\\\\msiexec.exe\" or InitiatingProcessFolderPath endswith \"\\\\rundll32.exe\" or InitiatingProcessFolderPath endswith \"\\\\searchindexer.exe\" or InitiatingProcessFolderPath endswith \"\\\\srtasks.exe\" or InitiatingProcessFolderPath endswith \"\\\\svchost.exe\" or InitiatingProcessFolderPath endswith \"\\\\System32\\\\SystemPropertiesAdvanced.exe\" or InitiatingProcessFolderPath endswith \"\\\\taskhostw.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor64.exe\" or InitiatingProcessFolderPath endswith \"\\\\tiworker.exe\" or InitiatingProcessFolderPath endswith \"\\\\vssvc.exe\" or InitiatingProcessFolderPath endswith \"\\\\WmiPrvSE.exe\" or InitiatingProcessFolderPath endswith \"\\\\wsmprovhost.exe\") and InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\\") or (InitiatingProcessFolderPath startswith \"C:\\\\Program Files\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Program Files (x86)\\\\\") or (InitiatingProcessCommandLine contains \"\\\\dismhost.exe {\" and InitiatingProcessCommandLine startswith \"C:\\\\$WinREAgent\\\\Scratch\\\\\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the image load of vss_ps.dll by uncommon executabl"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,impact"
          },
          {
            "name": "relevantTechniques",
            "value": "T1490"
          }
        ]
      }
    }
  ]
}
