{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_WmiPrvSE_Child_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious WmiPrvSE Child Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\wbem\\\\WmiPrvSE.exe\" and ((FolderPath endswith \"\\\\certutil.exe\" or FolderPath endswith \"\\\\cscript.exe\" or FolderPath endswith \"\\\\mshta.exe\" or FolderPath endswith \"\\\\msiexec.exe\" or FolderPath endswith \"\\\\regsvr32.exe\" or FolderPath endswith \"\\\\rundll32.exe\" or FolderPath endswith \"\\\\verclsid.exe\" or FolderPath endswith \"\\\\wscript.exe\") or ((ProcessCommandLine contains \"cscript\" or ProcessCommandLine contains \"mshta\" or ProcessCommandLine contains \"powershell\" or ProcessCommandLine contains \"pwsh\" or ProcessCommandLine contains \"regsvr32\" or ProcessCommandLine contains \"rundll32\" or ProcessCommandLine contains \"wscript\") and FolderPath endswith \"\\\\cmd.exe\")) and (not(((ProcessCommandLine contains \"/i \" and FolderPath endswith \"\\\\msiexec.exe\") or FolderPath endswith \"\\\\WerFault.exe\" or FolderPath endswith \"\\\\WmiPrvSE.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious and uncommon child processes of WmiPr"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1047,T1204,T1218"
          }
        ]
      }
    }
  ]
}
