{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Execution_of_Hostname')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Execution of Hostname",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\HOSTNAME.EXE\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Use of hostname to get information"
          },
          {
            "name": "tactics",
            "value": "Discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1082"
          }
        ]
      }
    }
  ]
}
