{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_High_IntegrityLevel_Conhost_Legacy_Option')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious High IntegrityLevel Conhost Legacy Option",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"conhost.exe\" and ProcessCommandLine contains \"0xffffffff\" and ProcessCommandLine contains \"-ForceV1\") and ProcessIntegrityLevel =~ \"High\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "ForceV1 asks for information directly from the kernel space. Conhost connects to the console application. High IntegrityLevel means the process is running with elevated privileges, such as an Administrator conte"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1202"
          }
        ]
      }
    }
  ]
}
