{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Run_Key_from_Download')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Run Key from Download",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where (InitiatingProcessFolderPath contains \"\\\\Downloads\\\\\" or InitiatingProcessFolderPath contains \"\\\\Temporary Internet Files\\\\Content.Outlook\\\\\" or InitiatingProcessFolderPath contains \"\\\\Local Settings\\\\Temporary Internet Files\\\\\") and RegistryKey contains \"\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the suspicious RUN keys created by software located in Download or temporary Outlook/Internet Explorer directories"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
