{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Reconnaissance_Activity_Using_Get-LocalGroupMember_Cmdlet')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Reconnaissance Activity Using Get-LocalGroupMember Cmdlet",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"Get-LocalGroupMember \" and (ProcessCommandLine contains \"domain admins\" or ProcessCommandLine contains \" administrator\" or ProcessCommandLine contains \" administrateur\" or ProcessCommandLine contains \"enterprise admins\" or ProcessCommandLine contains \"Exchange Trusted Subsystem\" or ProcessCommandLine contains \"Remote Desktop Users\" or ProcessCommandLine contains \"Utilisateurs du Bureau à distance\" or ProcessCommandLine contains \"Usuarios de escritorio remoto\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious reconnaissance command line activity on Windows systems using the PowerShell Get-LocalGroupMember Cmd"
          },
          {
            "name": "tactics",
            "value": "Discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1087"
          }
        ]
      }
    }
  ]
}
