{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Schtasks_Execution_AppData_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Schtasks Execution AppData Folder",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"NT AUT\" or ProcessCommandLine contains \" SYSTEM \") and (ProcessCommandLine contains \"/Create\" and ProcessCommandLine contains \"/RU\" and ProcessCommandLine contains \"/TR\" and ProcessCommandLine contains \"C:\\\\Users\\\\\" and ProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\") and FolderPath endswith \"\\\\schtasks.exe\") and (not((ProcessCommandLine contains \"/TN TVInstallRestore\" and FolderPath endswith \"\\\\schtasks.exe\" and (InitiatingProcessFolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and InitiatingProcessFolderPath contains \"TeamViewer_.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of a schtask that executes a file from C:\\Users\\<USER>\\AppData\\Lo"
          },
          {
            "name": "tactics",
            "value": "execution,persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1053,T1059"
          }
        ]
      }
    }
  ]
}
