{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Download_From_Direct_IP_Via_Bitsadmin')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Download From Direct IP Via Bitsadmin",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \"://1\" or ProcessCommandLine contains \"://2\" or ProcessCommandLine contains \"://3\" or ProcessCommandLine contains \"://4\" or ProcessCommandLine contains \"://5\" or ProcessCommandLine contains \"://6\" or ProcessCommandLine contains \"://7\" or ProcessCommandLine contains \"://8\" or ProcessCommandLine contains \"://9\") and (ProcessCommandLine contains \" /transfer \" or ProcessCommandLine contains \" /create \" or ProcessCommandLine contains \" /addfile \") and (FolderPath endswith \"\\\\bitsadmin.exe\" or ProcessVersionInfoOriginalFileName =~ \"bitsadmin.exe\")) and (not(ProcessCommandLine contains \"://7-\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of bitsadmin downloading a file using an URL that contains an"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence,S0190"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036,T1197"
          }
        ]
      }
    }
  ]
}
