{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Download_from_Office_Domain')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Download from Office Domain",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"https://attachment.outlook.live.net/owa/\" or ProcessCommandLine contains \"https://onenoteonlinesync.onenote.com/onenoteonlinesync/\") and ((FolderPath endswith \"\\\\curl.exe\" or FolderPath endswith \"\\\\wget.exe\") or (ProcessCommandLine contains \"Invoke-WebRequest\" or ProcessCommandLine contains \"iwr \" or ProcessCommandLine contains \"curl \" or ProcessCommandLine contains \"wget \" or ProcessCommandLine contains \"Start-BitsTransfer\" or ProcessCommandLine contains \".DownloadFile(\" or ProcessCommandLine contains \".DownloadString(\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious ways to download files from Microsoft domains that are used to store attachments in Emails or OneNote docume"
          },
          {
            "name": "tactics",
            "value": "command_and_control"
          },
          {
            "name": "relevantTechniques",
            "value": "T1105,T1608"
          }
        ]
      }
    }
  ]
}
