{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Remote_Child_Process_From_Outlook')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Remote Child Process From Outlook",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath startswith \"\\\\\\\\\" and InitiatingProcessFolderPath endswith \"\\\\outlook.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a suspicious child process spawning from Outlook where the image is located in a remote location (SMB/WebDav shares"
          },
          {
            "name": "tactics",
            "value": "execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059,T1202"
          }
        ]
      }
    }
  ]
}
