{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_LOLBIN_AccCheckConsole')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious LOLBIN AccCheckConsole",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -window \" and ProcessCommandLine contains \".dll\") and (FolderPath endswith \"\\\\AccCheckConsole.exe\" or ProcessVersionInfoOriginalFileName =~ \"AccCheckConsole.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious LOLBIN AccCheckConsole execution with parameters as used to load an arbitrary "
          },
          {
            "name": "tactics",
            "value": "execution"
          }
        ]
      }
    }
  ]
}
