{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Parent_Double_Extension_File_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Parent Double Extension File Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessFolderPath endswith \".doc.lnk\" or InitiatingProcessFolderPath endswith \".docx.lnk\" or InitiatingProcessFolderPath endswith \".xls.lnk\" or InitiatingProcessFolderPath endswith \".xlsx.lnk\" or InitiatingProcessFolderPath endswith \".ppt.lnk\" or InitiatingProcessFolderPath endswith \".pptx.lnk\" or InitiatingProcessFolderPath endswith \".rtf.lnk\" or InitiatingProcessFolderPath endswith \".pdf.lnk\" or InitiatingProcessFolderPath endswith \".txt.lnk\" or InitiatingProcessFolderPath endswith \".doc.js\" or InitiatingProcessFolderPath endswith \".docx.js\" or InitiatingProcessFolderPath endswith \".xls.js\" or InitiatingProcessFolderPath endswith \".xlsx.js\" or InitiatingProcessFolderPath endswith \".ppt.js\" or InitiatingProcessFolderPath endswith \".pptx.js\" or InitiatingProcessFolderPath endswith \".rtf.js\" or InitiatingProcessFolderPath endswith \".pdf.js\" or InitiatingProcessFolderPath endswith \".txt.js\") or (InitiatingProcessCommandLine contains \".doc.lnk\" or InitiatingProcessCommandLine contains \".docx.lnk\" or InitiatingProcessCommandLine contains \".xls.lnk\" or InitiatingProcessCommandLine contains \".xlsx.lnk\" or InitiatingProcessCommandLine contains \".ppt.lnk\" or InitiatingProcessCommandLine contains \".pptx.lnk\" or InitiatingProcessCommandLine contains \".rtf.lnk\" or InitiatingProcessCommandLine contains \".pdf.lnk\" or InitiatingProcessCommandLine contains \".txt.lnk\" or InitiatingProcessCommandLine contains \".doc.js\" or InitiatingProcessCommandLine contains \".docx.js\" or InitiatingProcessCommandLine contains \".xls.js\" or InitiatingProcessCommandLine contains \".xlsx.js\" or InitiatingProcessCommandLine contains \".ppt.js\" or InitiatingProcessCommandLine contains \".pptx.js\" or InitiatingProcessCommandLine contains \".rtf.js\" or InitiatingProcessCommandLine contains \".pdf.js\" or InitiatingProcessCommandLine contains \".txt.js\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect execution of suspicious double extension files in ParentCommandLine"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
