{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspect_Svchost_Activity')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspect Svchost Activity",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine endswith \"svchost.exe\" and FolderPath endswith \"\\\\svchost.exe\") and (not(((InitiatingProcessFolderPath endswith \"\\\\rpcnet.exe\" or InitiatingProcessFolderPath endswith \"\\\\rpcnetp.exe\") or isnull(ProcessCommandLine))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "It is extremely abnormal for svchost.exe to spawn without any CLI arguments and is normally observed when a malicious process spawns the process and injects code into the process memory spa"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1055"
          }
        ]
      }
    }
  ]
}
