{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Driver_Install_by_pnputil.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Driver Install by pnputil.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"-i\" or ProcessCommandLine contains \"/install\" or ProcessCommandLine contains \"-a\" or ProcessCommandLine contains \"/add-driver\" or ProcessCommandLine contains \".inf\") and FolderPath endswith \"\\\\pnputil.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects when a possible suspicious driver is being installed via pnputil.exe lolbin"
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
