{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Usage_Of_ShellExec_RunDLL')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Usage Of ShellExec_RunDLL",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"ShellExec_RunDLL\" and (ProcessCommandLine contains \"regsvr32\" or ProcessCommandLine contains \"msiexec\" or ProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or ProcessCommandLine contains \"odbcconf\" or ProcessCommandLine contains \"\\\\Desktop\\\\\" or ProcessCommandLine contains \"\\\\Temp\\\\\" or ProcessCommandLine contains \"Invoke-\" or ProcessCommandLine contains \"iex\" or ProcessCommandLine contains \"comspec\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious usage of the ShellExec_RunDLL function to launch other commands as seen in the the raspberry-robin attack"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          }
        ]
      }
    }
  ]
}
