{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_Network_Command')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious Network Command",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"ipconfig /all\" or ProcessCommandLine contains \"netsh interface show interface\" or ProcessCommandLine contains \"arp -a\" or ProcessCommandLine contains \"nbtstat -n\" or ProcessCommandLine contains \"net config\" or ProcessCommandLine contains \"route print\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote syst"
          },
          {
            "name": "tactics",
            "value": "Discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1016"
          }
        ]
      }
    }
  ]
}
