{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Suspicious_GUP_Usage')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Suspicious GUP Usage",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\GUP.exe\" and (not(((FolderPath endswith \"\\\\Program Files\\\\Notepad++\\\\updater\\\\GUP.exe\" or FolderPath endswith \"\\\\Program Files (x86)\\\\Notepad++\\\\updater\\\\GUP.exe\") or (FolderPath contains \"\\\\Users\\\\\" and (FolderPath endswith \"\\\\AppData\\\\Local\\\\Notepad++\\\\updater\\\\GUP.exe\" or FolderPath endswith \"\\\\AppData\\\\Roaming\\\\Notepad++\\\\updater\\\\GUP.exe\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of the Notepad++ updater in a suspicious directory, which is often used in DLL side-loading atta"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1574"
          }
        ]
      }
    }
  ]
}
