{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Sysinternals_PsSuspend_Suspicious_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Sysinternals PsSuspend Suspicious Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ProcessCommandLine contains \"msmpeng.exe\" and (ProcessVersionInfoOriginalFileName =~ \"pssuspend.exe\" or (FolderPath endswith \"\\\\pssuspend.exe\" or FolderPath endswith \"\\\\pssuspend64.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects suspicious execution of Sysinternals PsSuspend, where the utility is used to suspend critical processes such as AV or EDR to bypass defen"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
