{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/System_Scripts_Autorun_Keys_Modification')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "System Scripts Autorun Keys Modification",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey contains \"\\\\Software\\\\Policies\\\\Microsoft\\\\Windows\\\\System\\\\Scripts\" and (RegistryKey contains \"\\\\Startup\" or RegistryKey contains \"\\\\Shutdown\" or RegistryKey contains \"\\\\Logon\" or RegistryKey contains \"\\\\Logoff\") and (not(RegistryValueData =~ \"(Empty)\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects modification of autostart extensibility point (ASEP) in registry."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
