{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/System_Control_Panel_Item_Loaded_From_Uncommon_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "System Control Panel Item Loaded From Uncommon Location",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\hdwwiz.cpl\" or FolderPath endswith \"\\\\appwiz.cpl\") and (not((FolderPath contains \":\\\\Windows\\\\System32\\\\\" or FolderPath contains \":\\\\Windows\\\\SysWOW64\\\\\" or FolderPath contains \":\\\\Windows\\\\WinSxS\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects image load events of system control panel items (.cpl) from uncommon or non-system locations which might be the result of sideloadin"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
