{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/System_Disk_And_Volume_Reconnaissance_Via_Wmic.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "System Disk And Volume Reconnaissance Via Wmic.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"volume\" or ProcessCommandLine contains \"path win32_logicaldisk\") and (FolderPath endswith \"\\\\WMIC.exe\" or ProcessVersionInfoOriginalFileName =~ \"wmic.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "An adversary might use WMI to discover information about the system, such as the volume name, size,\nfree space, and other disk information. This can be done using the `wmic` command-line utility and has been\nobserved being used by threat ac"
          },
          {
            "name": "tactics",
            "value": "Discovery,Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1047,T1082"
          }
        ]
      }
    }
  ]
}
