{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Tap_Installer_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Tap Installer Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\tapinstall.exe\" and (not(((FolderPath contains \":\\\\Program Files\\\\Avast Software\\\\SecureLine VPN\\\\\" or FolderPath contains \":\\\\Program Files (x86)\\\\Avast Software\\\\SecureLine VPN\\\\\") or FolderPath contains \":\\\\Program Files\\\\OpenVPN Connect\\\\drivers\\\\tap\\\\\" or FolderPath contains \":\\\\Program Files (x86)\\\\Proton Technologies\\\\ProtonVPNTap\\\\installer\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Well-known TAP software installation. Possible preparation for data exfiltration using tunneling techniq"
          },
          {
            "name": "tactics",
            "value": "Exfiltration"
          },
          {
            "name": "relevantTechniques",
            "value": "T1048"
          }
        ]
      }
    }
  ]
}
