{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Taskmgr_as_LOCAL_SYSTEM')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Taskmgr as LOCAL_SYSTEM",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\taskmgr.exe\" and (AccountName contains \"AUTHORI\" or AccountName contains \"AUTORI\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1036"
          }
        ]
      }
    }
  ]
}
