{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Terminal_Service_Process_Spawn')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Terminal Service Process Spawn",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessCommandLine contains \"\\\\svchost.exe\" and InitiatingProcessCommandLine contains \"termsvcs\") and (not(((FolderPath endswith \"\\\\rdpclip.exe\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\csrss.exe\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\wininit.exe\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\winlogon.exe\") or isnull(FolderPath))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a process spawned by the terminal service server process (this could be an indicator for an exploitation of CVE-2019-0708)"
          },
          {
            "name": "tactics",
            "value": "InitialAccess,LateralMovement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1190,T1210"
          }
        ]
      }
    }
  ]
}
