{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UAC_Bypass_Abusing_Winsat_Path_Parsing_-_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UAC Bypass Abusing Winsat Path Parsing - Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessIntegrityLevel in~ (\"High\", \"System\")) and InitiatingProcessCommandLine contains \"C:\\\\Windows \\\\system32\\\\winsat.exe\" and InitiatingProcessFolderPath endswith \"\\\\AppData\\\\Local\\\\Temp\\\\system32\\\\winsat.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe (UACMe 52)"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
