{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UAC_Bypass_Tools_Using_ComputerDefaults')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UAC Bypass Tools Using ComputerDefaults",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath =~ \"C:\\\\Windows\\\\System32\\\\ComputerDefaults.exe\" and (ProcessIntegrityLevel in~ (\"High\", \"System\"))) and (not((InitiatingProcessFolderPath contains \":\\\\Windows\\\\System32\" or InitiatingProcessFolderPath contains \":\\\\Program Files\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects tools such as UACMe used to bypass UAC with computerdefaults.exe (UACMe "
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
