{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UAC_Bypass_With_Fake_DLL')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UAC Bypass With Fake DLL",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where (FolderPath endswith \"\\\\dismcore.dll\" and InitiatingProcessFolderPath endswith \"\\\\dism.exe\") and (not(FolderPath =~ \"C:\\\\Windows\\\\System32\\\\Dism\\\\dismcore.dll\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Attempts to load dismcore.dll after dropping"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,persistence,privilege_escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548,T1574"
          }
        ]
      }
    }
  ]
}
