{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UAC_Bypass_Using_IEInstal_-_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UAC Bypass Using IEInstal - Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and FolderPath endswith \"consent.exe\" and (ProcessIntegrityLevel in~ (\"High\", \"System\")) and InitiatingProcessFolderPath endswith \"\\\\ieinstal.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the pattern of UAC Bypass using IEInstal.exe (UACMe 6"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,privilege_escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
