{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UAC_Bypass_Using_IDiagnostic_Profile')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UAC Bypass Using IDiagnostic Profile",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessIntegrityLevel in~ (\"High\", \"System\")) and InitiatingProcessCommandLine contains \" /Processid:{12C21EA7-2EB8-4B55-9249-AC243DA8C666}\" and InitiatingProcessFolderPath endswith \"\\\\DllHost.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the \"IDiagnosticProfileUAC\" UAC bypass techni"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Execution,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
