{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UAC_Bypass_WSReset')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UAC Bypass WSReset",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath endswith \"\\\\wsreset.exe\" and (ProcessIntegrityLevel in~ (\"High\", \"System\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the pattern of UAC Bypass via WSReset usable by default sysmon-con"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
