{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UAC_Bypass_Using_Event_Viewer_RecentViews')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UAC Bypass Using Event Viewer RecentViews",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"\\\\Event Viewer\\\\RecentViews\" or ProcessCommandLine contains \"\\\\EventV~1\\\\RecentViews\") and ProcessCommandLine contains \">\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects the pattern of UAC Bypass using Event Viewer RecentVie"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,privilege_escalation"
          }
        ]
      }
    }
  ]
}
