{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UAC_Bypass_Using_Windows_Media_Player_-_File')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UAC Bypass Using Windows Media Player - File",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath endswith \"\\\\AppData\\\\Local\\\\Temp\\\\OskSupport.dll\" and FolderPath startswith \"C:\\\\Users\\\\\") or (InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\system32\\\\DllHost.exe\" and FolderPath =~ \"C:\\\\Program Files\\\\Windows Media Player\\\\osk.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll (UACMe 32)"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,PrivilegeEscalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1548"
          }
        ]
      }
    }
  ]
}
