{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UEFI_Persistence_Via_Wpbbin_-_ProcessCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UEFI Persistence Via Wpbbin - ProcessCreation",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where FolderPath =~ \"C:\\\\Windows\\\\System32\\\\wpbbin.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of the binary \"wpbbin\" which is used as part of the UEFI based persistence method described in the reference section"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1542"
          }
        ]
      }
    }
  ]
}
