{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/UEFI_Persistence_Via_Wpbbin_-_FileCreation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "UEFI Persistence Via Wpbbin - FileCreation",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where FolderPath =~ \"C:\\\\Windows\\\\System32\\\\wpbbin.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects creation of a file named \"wpbbin\" in the \"%systemroot%\\system32\\\" directory. Which could be indicative of UEFI based persistence method"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1542"
          }
        ]
      }
    }
  ]
}
