{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Uncommon_Child_Processes_Of_SndVol.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Uncommon Child Processes Of SndVol.exe",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\SndVol.exe\" and (not((ProcessCommandLine contains \" shell32.dll,Control_RunDLL \" and FolderPath endswith \"\\\\rundll32.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects potentially uncommon child processes of SndVol.exe (the Windows volume mix"
          },
          {
            "name": "tactics",
            "value": "execution"
          }
        ]
      }
    }
  ]
}
