{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Uncommon_Child_Process_Of_Appvlp.EXE')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Uncommon Child Process Of Appvlp.EXE",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\appvlp.exe\" and (not((FolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\rundll32.exe\" or FolderPath endswith \":\\\\Windows\\\\System32\\\\rundll32.exe\"))) and (not(((FolderPath contains \":\\\\Program Files\\\\Microsoft Office\" and FolderPath endswith \"\\\\msoasb.exe\") or (FolderPath contains \":\\\\Program Files\\\\Microsoft Office\" and FolderPath endswith \"\\\\MSOUC.EXE\") or ((FolderPath contains \":\\\\Program Files\\\\Microsoft Office\" and FolderPath contains \"\\\\SkypeSrv\\\\\") and FolderPath endswith \"\\\\SKYPESERVER.EXE\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects uncommon child processes of Appvlp.EXE\nAppvlp or the Application Virtualization Utility is included with Microsoft Office. Attackers are able to abuse \"AppVLP\" to execute shell commands.\nNormally, this binary is used for Application"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
