{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Uncommon_Userinit_Child_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Uncommon Userinit Child Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\userinit.exe\" and (not(FolderPath endswith \":\\\\WINDOWS\\\\explorer.exe\")) and (not(((FolderPath endswith \":\\\\Program Files (x86)\\\\Citrix\\\\HDX\\\\bin\\\\cmstart.exe\" or FolderPath endswith \":\\\\Program Files (x86)\\\\Citrix\\\\HDX\\\\bin\\\\icast.exe\" or FolderPath endswith \":\\\\Program Files (x86)\\\\Citrix\\\\System32\\\\icast.exe\" or FolderPath endswith \":\\\\Program Files\\\\Citrix\\\\HDX\\\\bin\\\\cmstart.exe\" or FolderPath endswith \":\\\\Program Files\\\\Citrix\\\\HDX\\\\bin\\\\icast.exe\" or FolderPath endswith \":\\\\Program Files\\\\Citrix\\\\System32\\\\icast.exe\") or isnull(FolderPath) or (ProcessCommandLine contains \"netlogon.bat\" or ProcessCommandLine contains \"UsrLogon.cmd\") or (FolderPath endswith \":\\\\Windows\\\\System32\\\\proquota.exe\" or FolderPath endswith \":\\\\Windows\\\\SysWOW64\\\\proquota.exe\") or ProcessCommandLine =~ \"PowerShell.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects uncommon \"userinit.exe\" child processes, which could be a sign of uncommon shells or login scripts used for persistence."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1037"
          }
        ]
      }
    }
  ]
}
