{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Uncommon_File_Creation_By_Mysql_Daemon_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Uncommon File Creation By Mysql Daemon Process",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (InitiatingProcessFolderPath endswith \"\\\\mysqld.exe\" or InitiatingProcessFolderPath endswith \"\\\\mysqld-nt.exe\") and (FolderPath endswith \".bat\" or FolderPath endswith \".dat\" or FolderPath endswith \".dll\" or FolderPath endswith \".exe\" or FolderPath endswith \".ps1\" or FolderPath endswith \".psm1\" or FolderPath endswith \".vbe\" or FolderPath endswith \".vbs\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of files with scripting or executable extensions by Mysql daemon.\nWhich could be an indicator of \"User Defined Functions\" abuse to download malware.\n"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          }
        ]
      }
    }
  ]
}
