{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Uncommon_One_Time_Only_Scheduled_Task_At_0000')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Uncommon One Time Only Scheduled Task At 00:00",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"wscript\" or ProcessCommandLine contains \"vbscript\" or ProcessCommandLine contains \"cscript\" or ProcessCommandLine contains \"wmic \" or ProcessCommandLine contains \"wmic.exe\" or ProcessCommandLine contains \"regsvr32.exe\" or ProcessCommandLine contains \"powershell\" or ProcessCommandLine contains \"\\\\AppData\\\\\") and (FolderPath contains \"\\\\schtasks.exe\" or ProcessVersionInfoOriginalFileName =~ \"schtasks.exe\") and (ProcessCommandLine contains \"once\" and ProcessCommandLine contains \"00:00\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects scheduled task creation events that include suspicious actions, and is run once at 00:00"
          },
          {
            "name": "tactics",
            "value": "Execution,Persistence,Privilege Escalation"
          },
          {
            "name": "relevantTechniques",
            "value": "T1053"
          }
        ]
      }
    }
  ]
}
