{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Unsigned_AppX_Installation_Attempt_Using_Add-AppxPackage')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Unsigned AppX Installation Attempt Using Add-AppxPackage",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Add-AppPackage \" or ProcessCommandLine contains \"Add-AppxPackage \") and ProcessCommandLine contains \" -AllowUnsigned\" and ((FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\") or (ProcessVersionInfoOriginalFileName in~ (\"PowerShell.EXE\", \"pwsh.dll\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of the \"Add-AppxPackage\" or it's alias \"Add-AppPackage\" to install unsigned AppX packages"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion,Persistence"
          }
        ]
      }
    }
  ]
}
