{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Unusual_File_Modification_by_dns.exe')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Unusual File Modification by dns.exe",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where InitiatingProcessFolderPath endswith \"\\\\dns.exe\" and (not(FolderPath endswith \"\\\\dns.log\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects an unexpected file being modified by dns.exe which my indicate activity related to remote code execution or other forms of exploitation as seen in CVE-2020-1350 (SigRed)"
          },
          {
            "name": "tactics",
            "value": "Initial Access"
          },
          {
            "name": "relevantTechniques",
            "value": "T1133"
          }
        ]
      }
    }
  ]
}
