{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Use_Of_The_SFTP.EXE_Binary_As_A_LOLBIN')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Use Of The SFTP.EXE Binary As A LOLBIN",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \" -D ..\" or ProcessCommandLine contains \" -D C:\\\\\") and FolderPath endswith \"\\\\sftp.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the usage of the \"sftp.exe\" binary as a LOLBIN by abusing the \"-D\" f"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
