{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Use_Icacls_to_Hide_File_to_Everyone')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Use Icacls to Hide File to Everyone",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/deny\" and ProcessCommandLine contains \"S-1-1-0:\") and (ProcessVersionInfoOriginalFileName =~ \"iCACLS.EXE\" or FolderPath endswith \"\\\\icacls.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect use of icacls to deny access for everyone in Users folder sometimes used to hide malicious fi"
          },
          {
            "name": "tactics",
            "value": "defense_evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
