{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Use_NTFS_Short_Name_in_Command_Line')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Use NTFS Short Name in Command Line",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"~1.exe\" or ProcessCommandLine contains \"~1.bat\" or ProcessCommandLine contains \"~1.msi\" or ProcessCommandLine contains \"~1.vbe\" or ProcessCommandLine contains \"~1.vbs\" or ProcessCommandLine contains \"~1.dll\" or ProcessCommandLine contains \"~1.ps1\" or ProcessCommandLine contains \"~1.js\" or ProcessCommandLine contains \"~1.hta\" or ProcessCommandLine contains \"~2.exe\" or ProcessCommandLine contains \"~2.bat\" or ProcessCommandLine contains \"~2.msi\" or ProcessCommandLine contains \"~2.vbe\" or ProcessCommandLine contains \"~2.vbs\" or ProcessCommandLine contains \"~2.dll\" or ProcessCommandLine contains \"~2.ps1\" or ProcessCommandLine contains \"~2.js\" or ProcessCommandLine contains \"~2.hta\") and (not(((InitiatingProcessFolderPath endswith \"\\\\WebEx\\\\WebexHost.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor\\\\thor64.exe\") or ProcessCommandLine contains \"C:\\\\xampp\\\\vcredist\\\\VCREDI~1.EXE\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid command-line detection"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
