{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Use_Short_Name_Path_in_Image')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Use Short Name Path in Image",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath contains \"~1\\\\\" or FolderPath contains \"~2\\\\\") and (not((((InitiatingProcessFolderPath in~ (\"C:\\\\Windows\\\\System32\\\\Dism.exe\", \"C:\\\\Windows\\\\System32\\\\cleanmgr.exe\")) or (InitiatingProcessFolderPath endswith \"\\\\WebEx\\\\WebexHost.exe\" or InitiatingProcessFolderPath endswith \"\\\\thor\\\\thor64.exe\") or ProcessVersionInfoProductName =~ \"InstallShield (R)\" or ProcessVersionInfoFileDescription =~ \"InstallShield (R) Setup Engine\" or ProcessVersionInfoCompanyName =~ \"InstallShield Software Corporation\") or ((FolderPath contains \"\\\\AppData\\\\\" and FolderPath contains \"\\\\Temp\\\\\") or (FolderPath endswith \"~1\\\\unzip.exe\" or FolderPath endswith \"~1\\\\7zG.exe\")))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image detect"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1564"
          }
        ]
      }
    }
  ]
}
