{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Use_of_OpenConsole')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Use of OpenConsole",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessVersionInfoOriginalFileName =~ \"OpenConsole.exe\" or FolderPath endswith \"\\\\OpenConsole.exe\") and (not(FolderPath startswith \"C:\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects usage of OpenConsole binary as a LOLBIN to launch other binaries to bypass application Whitelist"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1059"
          }
        ]
      }
    }
  ]
}
