{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/User_Added_to_Remote_Desktop_Users_Group')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "User Added to Remote Desktop Users Group",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Remote Desktop Users\" or ProcessCommandLine contains \"Utilisateurs du Bureau à distance\" or ProcessCommandLine contains \"Usuarios de escritorio remoto\") and ((ProcessCommandLine contains \"localgroup \" and ProcessCommandLine contains \" /add\") or (ProcessCommandLine contains \"Add-LocalGroupMember \" and ProcessCommandLine contains \" -Group \"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects addition of users to the local Remote Desktop Users group via \"Net\" or \"Add-LocalGroupMember\"."
          },
          {
            "name": "tactics",
            "value": "Lateral Movement,Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1021,T1133,T1136"
          }
        ]
      }
    }
  ]
}
