{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/User_Added_To_Highly_Privileged_Group')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "User Added To Highly Privileged Group",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"Group Policy Creator Owners\" or ProcessCommandLine contains \"Schema Admins\") and ((ProcessCommandLine contains \"localgroup \" and ProcessCommandLine contains \" /add\") or (ProcessCommandLine contains \"Add-LocalGroupMember \" and ProcessCommandLine contains \" -Group \"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects addition of users to highly privileged groups via \"Net\" or \"Add-LocalGroupMember\"."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1098"
          }
        ]
      }
    }
  ]
}
