{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Verclsid.exe_Runs_COM_Object')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Verclsid.exe Runs COM Object",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/S\" and ProcessCommandLine contains \"/C\") and (FolderPath endswith \"\\\\verclsid.exe\" or ProcessVersionInfoOriginalFileName =~ \"verclsid.exe\")",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects when verclsid.exe is used to run COM object via G"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
