{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Visual_Studio_Code_Tunnel_Shell_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Visual Studio Code Tunnel Shell Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (InitiatingProcessCommandLine contains \".vscode-server\" and InitiatingProcessFolderPath contains \"\\\\servers\\\\Stable-\" and InitiatingProcessFolderPath endswith \"\\\\server\\\\node.exe\") and ((ProcessCommandLine contains \"\\\\terminal\\\\browser\\\\media\\\\shellIntegration.ps1\" and (FolderPath endswith \"\\\\powershell.exe\" or FolderPath endswith \"\\\\pwsh.exe\")) or (FolderPath endswith \"\\\\wsl.exe\" or FolderPath endswith \"\\\\bash.exe\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of a shell (powershell, bash, wsl...) via Visual Studio Code tunnel. Attackers can abuse this functionality to establish a C2 channel and execute arbitrary commands on the system."
          },
          {
            "name": "tactics",
            "value": "CommandAndControl"
          },
          {
            "name": "relevantTechniques",
            "value": "T1071"
          }
        ]
      }
    }
  ]
}
