{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Visual_Studio_Code_Tunnel_Remote_File_Creation')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Visual Studio Code Tunnel Remote File Creation",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where InitiatingProcessFolderPath contains \"\\\\servers\\\\Stable-\" and InitiatingProcessFolderPath endswith \"\\\\server\\\\node.exe\" and FolderPath contains \"\\\\.vscode-server\\\\data\\\\User\\\\History\\\\\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of file by the \"node.exe\" process in the \".vscode-server\" directory. Could be a sign of remote file creation via VsCode tunnel feature\n"
          },
          {
            "name": "tactics",
            "value": "Command And Control"
          }
        ]
      }
    }
  ]
}
