{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Wab_Execution_From_Non_Default_Location')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Wab Execution From Non Default Location",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (FolderPath endswith \"\\\\wab.exe\" or FolderPath endswith \"\\\\wabmig.exe\") and (not((FolderPath startswith \"C:\\\\Windows\\\\WinSxS\\\\\" or FolderPath startswith \"C:\\\\Program Files\\\\Windows Mail\\\\\" or FolderPath startswith \"C:\\\\Program Files (x86)\\\\Windows Mail\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects execution of wab.exe (Windows Contacts) and Wabmig.exe (Microsoft Address Book Import Tool) from non default locations as seen with bumblebee activ"
          },
          {
            "name": "tactics",
            "value": "defense_evasion,execution"
          }
        ]
      }
    }
  ]
}
