{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Whoami.EXE_Execution_With_Output_Option')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Whoami.EXE Execution With Output Option",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((ProcessCommandLine contains \" /FO CSV\" or ProcessCommandLine contains \" -FO CSV\") and (FolderPath endswith \"\\\\whoami.exe\" or ProcessVersionInfoOriginalFileName =~ \"whoami.exe\")) or ProcessCommandLine =~ \"*whoami*>*\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of \"whoami.exe\" with the \"/FO\" flag to choose CSV as output format or with redirection options to export the results to a file for later u"
          },
          {
            "name": "tactics",
            "value": "Discovery"
          },
          {
            "name": "relevantTechniques",
            "value": "T1033"
          }
        ]
      }
    }
  ]
}
