{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Windows_Defender_Service_Disabled_-_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Windows Defender Service Disabled - Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryValueData =~ \"DWORD (0x00000004)\" and RegistryKey endswith \"\\\\Services\\\\WinDefend\\\\Start\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects when an attacker or tool disables the  Windows Defender service (WinDefend) via the registry"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1562"
          }
        ]
      }
    }
  ]
}
