{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Windows_Credential_Editor_Registry')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Windows Credential Editor Registry",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey contains \"Services\\\\WCESERVICE\\\\Start\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the use of Windows Credential Editor (WCE)"
          },
          {
            "name": "tactics",
            "value": "CredentialAccess,S0005"
          },
          {
            "name": "relevantTechniques",
            "value": "T1003"
          }
        ]
      }
    }
  ]
}
