{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Winrar_Execution_in_Non-Standard_Folder')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Winrar Execution in Non-Standard Folder",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where ((FolderPath endswith \"\\\\rar.exe\" or FolderPath endswith \"\\\\winrar.exe\") or ProcessVersionInfoFileDescription =~ \"Command line RAR\") and (not(((FolderPath contains \":\\\\Program Files (x86)\\\\WinRAR\\\\\" or FolderPath contains \":\\\\Program Files\\\\WinRAR\\\\\") or FolderPath endswith \"\\\\UnRAR.exe\"))) and (not(FolderPath contains \":\\\\Windows\\\\Temp\\\\\"))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a suspicious winrar execution in a folder which is not the default installation fold"
          },
          {
            "name": "tactics",
            "value": "collection"
          },
          {
            "name": "relevantTechniques",
            "value": "T1560"
          }
        ]
      }
    }
  ]
}
