{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/WinSxS_Executable_File_Creation_By_Non-System_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "WinSxS Executable File Creation By Non-System Process",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where (FolderPath endswith \".exe\" and FolderPath startswith \"C:\\\\Windows\\\\WinSxS\\\\\") and (not((InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\Systems32\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\SysWOW64\\\\\" or InitiatingProcessFolderPath startswith \"C:\\\\Windows\\\\WinSxS\\\\\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the creation of binaries in the WinSxS folder by non-system processes"
          },
          {
            "name": "tactics",
            "value": "Execution"
          }
        ]
      }
    }
  ]
}
