{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/WinSock2_Autorun_Keys_Modification')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "WinSock2 Autorun Keys Modification",
        "category": "Hunting Queries",
        "query": "DeviceRegistryEvents\n| where RegistryKey contains \"\\\\System\\\\CurrentControlSet\\\\Services\\\\WinSock2\\\\Parameters\" and (RegistryKey contains \"\\\\Protocol_Catalog9\\\\Catalog_Entries\" or RegistryKey contains \"\\\\NameSpace_Catalog5\\\\Catalog_Entries\") and (not((RegistryValueData =~ \"(Empty)\" or InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\MsiExec.exe\" or InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\syswow64\\\\MsiExec.exe\")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects modification of autostart extensibility point (ASEP) in registry."
          },
          {
            "name": "tactics",
            "value": "Persistence"
          },
          {
            "name": "relevantTechniques",
            "value": "T1547"
          }
        ]
      }
    }
  ]
}
