{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Wlrmdr.EXE_Uncommon_Argument_Or_Child_Process')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Wlrmdr.EXE Uncommon Argument Or Child Process",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFolderPath endswith \"\\\\wlrmdr.exe\" or ((((ProcessCommandLine contains \"-s \" or ProcessCommandLine contains \"/s \") and (ProcessCommandLine contains \"-f \" or ProcessCommandLine contains \"/f \") and (ProcessCommandLine contains \"-t \" or ProcessCommandLine contains \"/t \") and (ProcessCommandLine contains \"-m \" or ProcessCommandLine contains \"/m \") and (ProcessCommandLine contains \"-a \" or ProcessCommandLine contains \"/a \") and (ProcessCommandLine contains \"-u \" or ProcessCommandLine contains \"/u \")) and (FolderPath endswith \"\\\\wlrmdr.exe\" or ProcessVersionInfoOriginalFileName =~ \"WLRMNDR.EXE\")) and (not(((InitiatingProcessFolderPath in~ (\"\", \"-\")) or isnull(InitiatingProcessFolderPath) or InitiatingProcessFolderPath =~ \"C:\\\\Windows\\\\System32\\\\winlogon.exe\"))))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of \"Wlrmdr.exe\" with the \"-u\" command line flag which allows anything passed to it to be an argument of the ShellExecute API, which would allow an attacker to execute arbitrary binaries.\nThis detection also focuses on any uncommon c"
          },
          {
            "name": "tactics",
            "value": "Defense Evasion"
          },
          {
            "name": "relevantTechniques",
            "value": "T1218"
          }
        ]
      }
    }
  ]
}
