{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/WMIC_Remote_Command_Execution')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "WMIC Remote Command Execution",
        "category": "Hunting Queries",
        "query": "DeviceProcessEvents\n| where (ProcessCommandLine contains \"/node:\" and (FolderPath endswith \"\\\\WMIC.exe\" or ProcessVersionInfoOriginalFileName =~ \"wmic.exe\")) and (not((ProcessCommandLine contains \"/node:127.0.0.1 \" or ProcessCommandLine contains \"/node:localhost \")))",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects the execution of WMIC to query information on a remote system"
          },
          {
            "name": "tactics",
            "value": "Execution"
          },
          {
            "name": "relevantTechniques",
            "value": "T1047"
          }
        ]
      }
    }
  ]
}
