{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Wmiprvse_Wbemcomn_DLL_Hijack')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Wmiprvse Wbemcomn DLL Hijack",
        "category": "Hunting Queries",
        "query": "DeviceImageLoadEvents\n| where FolderPath endswith \"\\\\wbem\\\\wbemcomn.dll\" and InitiatingProcessFolderPath endswith \"\\\\wmiprvse.exe\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "etects a threat actor creating a file named `wbemcomn.dll` in the `C:\\Windows\\System32\\wbem\\` directory over the network and loading it for a WMI DLL Hijack scenari"
          },
          {
            "name": "tactics",
            "value": "execution,lateral_movement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1021,T1047"
          }
        ]
      }
    }
  ]
}
