{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/Wmiprvse_Wbemcomn_DLL_Hijack_-_File')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "Wmiprvse Wbemcomn DLL Hijack - File",
        "category": "Hunting Queries",
        "query": "DeviceFileEvents\n| where InitiatingProcessFolderPath =~ \"System\" and FolderPath endswith \"\\\\wbem\\\\wbemcomn.dll\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\\Windows\\System32\\wbem\\` directory over the network and loading it for a WMI DLL Hijack scenario."
          },
          {
            "name": "tactics",
            "value": "Execution,LateralMovement"
          },
          {
            "name": "relevantTechniques",
            "value": "T1021,T1047"
          }
        ]
      }
    }
  ]
}
